{"reviews": [{"date": "2014-11-20", "text": "Oh Lord, I can't believe this was once Bill's Kitchen & Teriyaki, the deadest place you could ever enter with the most mediocre Japanese food this side of Tokyo Express. I still recall their Pork Chop Ramen which was a bowl of packaged-tasting noodles with a pair of burnt pork chops on a separate plate. Seriously. But now, it's wall-to-wall hipsters with a slick urban crunch bordertown vibe as Garaje tries to make up its mind what it is. It's definitely dinerish with a Mexican roadside twist that makes it the perfect Latino complement to the Asian-twanged HRD Coffee Shop a few doors down. It was Jamie W. who suggested who come here, so I wanted to take advantage of his rare venture into trying something new.", "stars": "4.0"}, {"date": "2014-11-19", "text": "Amazing and delicious.. Try the special fries and the tacos.. Love it will come again and again!!!", "stars": "5.0"}, {"date": "2014-11-16", "text": "Came here for the Cali Zapata and I ended up ordering the Rolls Royce (The Cali Zapata w/ shrimp added). I think next time I would probably stick with the Cali on its own, but both were pretty good....I just wasn't feeling the shrimp for some reason. Adding some refried beans would really take it to the next level in my opinion, but that's because I grew up eating California burritos that way) Make sure you request their in-house hot sauce (although very mild), unless you're really into the bottled stuff. Awesome beer selection. Places seems like it would be perfect for large groups.", "stars": "4.0"}, {"date": "2014-11-14", "text": "A co-worker took me there for lunch one day and I had to go back. Fortunately, I was not disappointed. Hands down the best tacos I've ever eaten, on multiple visits now. Add it to a wide variety of draft beers, tables with built-in smartphone charges, and great service. Can't think of a better way to multi-task than to power up my phone's battery while enjoying a beer on tap. A sure bet for a night out in SOMA.", "stars": "5.0"}, {"date": "2014-11-12", "text": "This place was freaking awesome.  Seriously.", "stars": "5.0"}, {"date": "2014-11-12", "text": "10.04.13 | bookmarked 02.25.13", "stars": "4.0"}, {"date": "2014-11-10", "text": "Well price, very good tacos and poblanos. Everything here is fantastic and savory. It hits the spot when your tipsy or way past that. I love spicy and they have the spicy sauce that had the wooden top on it. I grew in San Diego living off of good cheap Mexican food, this really is one of the best Mexican foods in sf", "stars": "5.0"}, {"date": "2014-11-08", "text": "Garaje effortlessly beats other Mex joints as its ambience for the price-range is hard-to-find in prime San Francisco. Its orangish exteriors made me think twice if it was at the right place or not because it looks a little tucked away in a series of confusing small businesses. Obscurity!", "stars": "5.0"}, {"date": "2014-11-07", "text": "Seriously good eats.  You might have to wait a little longer, they are chatty at the register, but oh man, when you get your order.  Excellent fish tacos, but I go for the prawn one everytime.  Awesome decor!  Cool vibe, walking distance from Howard, mission, etc.  will give 5 stars if cashiers realize not the best time to hold a long conversation with every customer when there is a huge line.  But I digress...", "stars": "4.0"}, {"date": "2014-11-06", "text": "Service: lovely! The staff here is super nice and welcoming. Every time I am there they offer me something, a sampling of their newest local brews. Or this weeks locally made desert. They always have a smile Amon and are full of energy! ", "stars": "5.0"}, {"date": "2014-11-03", "text": "I was very happy they were able to make me a vegan zapato.  Basically, they made the vegetarian without cheese but they added corn.  My only complaint is that they used so much corn that there was more corn than there was anything else (i.e. more corn than beans), so that was a little odd.  To their credit, the corn was fresh (not canned)  If I go back, I'll just ask for the veggie zapato without cheese.", "stars": "4.0"}, {"date": "2014-11-03", "text": "You want good cheap food. Head to garaje !", "stars": "5.0"}, {"date": "2014-11-01", "text": "Garaje's red facade opens up to a 2 level, double-skylit galley. It seems to get busy here and the line was rather long.", "stars": "3.0"}, {"date": "2014-11-01", "text": "I've probably been here 10+ times at this point. It is a fun place with a lot of atmosphere for a casual lunch or dinner. It's kind of like being in a cool garage with street signs and automotive motifs everywhere. It's lively and often full even later into the night.", "stars": "5.0"}, {"date": "2014-10-31", "text": "Garaje is an amazing \"hole in the wall\" restaurant in SoMa.  The outside looks relatively run-down, but the inside is actually quite a nice restaurant/bar.  Don't let the exterior fool you.", "stars": "4.0"}, {"date": "2014-10-30", "text": "Great food, great place, cheap. I'm really impressed how good this place is.", "stars": "5.0"}, {"date": "2014-10-29", "text": "My first trip to San Francisco,I ate my first meal at this restaurant. Wow The food was fresh delicious and reasonably priced. I loved the Indiana license plates as the decor.I wish I was a local to eat there everyday.Keep up the work and personable hospitality.", "stars": "5.0"}, {"date": "2014-10-28", "text": "The first time I had Garaje, my friend and I were trying to hit up HRD only to find that it was closed for the day. We found this place on Yelp and passed the storefront twice because the sign was somewhat non-obvious. I didn't really know what to expect but I ordered a Zapato and sat down with my ticket. A few short minutes passed and a panini-pressed burrito arrived at my table. It looked humble enough, but when I took my first bite, my mouth exploded with rich, creamy, chewy, crunchy, and savory sensation. Yum. The Zapato is created when French Fries, beans, cheese, guacamole, and meat are married within a compressed and crispy tortilla. It was what I could only call pure happiness compressed into a dense and efficient package. ", "stars": "5.0"}, {"date": "2014-10-22", "text": "Get the California Steak Zapato. I've been here twice and ordered this both times. It's awesome. A heart-attack in a tortilla, probably, but awesome. Zapato means \"shoe\" in Spanish, but this not-quite-burrito tastes nothing like a shoe. It's a grilled tortilla with steak, guacamole, and French fries inside. Did I just describe your three favorite things in one sentence? Ever imagined them combined? Go to Garaje and try it for yourself.", "stars": "5.0"}, {"date": "2014-10-22", "text": "I stopped in to this \"Garage\" with some friends while visiting SF. The atmosphere is oily and deep fried meets a grimy pub.. fun! ", "stars": "5.0"}, {"date": "2014-10-20", "text": "This place is awesome! Must stop at this place before a Giants game. Get the tacos or zapattos and huge selection of beer. ", "stars": "5.0"}, {"date": "2014-10-20", "text": "The beer battered tilapia taco's are bangin!", "stars": "4.0"}, {"date": "2014-10-20", "text": "One of my friends sang the praises of Garaje, so we made plans to meet up one day for lunch during the work week. There was a pretty long line at the counter, but we were able to snag a table pretty easily after ordering.", "stars": "2.0"}, {"date": "2014-10-17", "text": "I made an out-of-the-way effort to eat here, but wouldn't recommend it unless you are jn the area. Had the fish &chips zapato, which was unique sounding, but it was just a sandwiched pressed burrito with fish and French fries, and some guacamole. Good was decent enough, but the service that day, not busy, took 20 min to get my order. To me, that was a bit too long for something that was supposed to be fast and simple.", "stars": "3.0"}, {"date": "2014-10-13", "text": "We came on a Thursday night and immediately found open tables around 6pm. No line either! When we left, there was a long line and people were waiting for us to leave our table. So I recommend getting there early! There is also a lot of free parking on the side streets nearby.", "stars": "4.0"}, {"date": "2014-10-13", "text": "This place is pretty legit. Ordered the crab sanwich and it was smackin. The batter was crispy. The bread was toasted good. The chipotle mayo just made everything better. The prices ain't bad either but your gonna be spending about $10 here since everything is mostly 8 and above unless your just getting a taco. Otherwise I highly recommend their local menu items as well as their burgers. Zapatos were alright. Basically expected the flavor but still good. Only problem with this place is that its really hard to find parking. But I say its worth the struggle.", "stars": "5.0"}, {"date": "2014-10-11", "text": "Food was incredible and unique.", "stars": "4.0"}, {"date": "2014-10-11", "text": "Love the place. Great tasty food and reasonable price. The only problem is that you might have a hard time finding seats.", "stars": "5.0"}, {"date": "2014-10-10", "text": "Hands down my favorite taco place in the city! ", "stars": "3.0"}, {"date": "2014-10-08", "text": "The grilled fish tacos are great! Yummy guacamole! It can get quite busy during lunch, but the line moves pretty fast!", "stars": "5.0"}, {"date": "2014-10-04", "text": "Happy spot = our go to spot in SoMa. Good food & good burgers & good beer. I wish they were open on Sundays - as this part if the city closes on Sunday evenings.", "stars": "5.0"}, {"date": "2014-10-03", "text": "Wildly overrated. The food was OK but nothing special. It also made me horribly sick. Wanted to like this place but would have been better off going to Chipotle. Just not 4.5 star worthy.", "stars": "1.0"}, {"date": "2014-09-24", "text": "After reviews by my trusted fellow Yelpers I knew I had to try Garaje.  The problem?  I am not usually in the area during its hours of operations.  Yes, I am in this neighborhood just about every weekend, but usually during the day when Garaje is closed.  ARGH!  It didn't help that everyone was telling me how great the food is here.", "stars": "4.0"}, {"date": "2014-09-24", "text": "Why get french fries on the side when you can have them INside your burrito? (Or zapato as the case is at Garaje). Come to think of it, french fries aren't all that Mexican at all but regardless, the combination works and is so freakin' delicious. I'm dreaming about it all the way down here in Miami. ", "stars": "5.0"}, {"date": "2014-09-23", "text": "This place is awesome but requires some serious patience.  Wait time for food is often 20 minutes and wait time to even order at the counter can take another 10 minutes.  I've actually walked out of here 4 times because the line was too long and I knew it would be over 30 minutes just to get a burger.  It takes a long time to get food here.  However, if you're a big beer and sports fan then this place is cool to hang out at because they have plenty of both.   It's a place to relax and hang out with friends or coworkers after a long day or a good place to catch a game. ", "stars": "4.0"}, {"date": "2014-09-23", "text": "Sat upstairs and got the zapato! Order came far quicker and generally all together this time. The food was very filling and the flavor was unusual :))", "stars": "4.0"}, {"date": "2014-09-23", "text": "For first timers I'd suggest dinner, 'cause the lunch lines are an immediate turn off, unless of course you are trying to chat up a new client or love interest. Expect  20 min wait time and more after  12:15. This is a tech lunch haven, so if you must , get there  at 11:30 for the least wait. Once you do get to the order desk, be sure you have cash on the barrel head or you are  SOL. The vibe is super casual garage theme with a license plate collection meets Rock poster collection. Give it an 8.5 on the coolio meter.They even thought enough about the interior to put  sound  baffles in the low ceiling entrance  area. There is also an upstairs  balcony.  ", "stars": "4.0"}, {"date": "2014-09-23", "text": "Dang! This place gets packed at lunchtime, but it's well worth the wait. ", "stars": "4.0"}, {"date": "2014-09-21", "text": "Curious to know where all the SoMa engineers go for lunch? It appears to be Garaje! ", "stars": "4.0"}, {"date": "2014-09-20", "text": "A \"no crap on tap\" sign is posted at the front and boy do they mean it. Great beer selection. I went with a delicious stout last night. ", "stars": "5.0"}], "average_rating": "4.5", "latest_date": "20140603", "name": "Garaje", "address": "475 3rd St", "latitude": 37.78201, "latest_score": "85", "num_of_inspections": "3", "ave_score": "86.3333333333", "longitude": -122.396132}
{"reviews": [], "average_rating": "4.0", "latest_date": "20131107", "name": "Marlowe", "address": "500 Brannan St", "latitude": 37.7783200510611, "latest_score": "93", "num_of_inspections": "3", "ave_score": "95.3333333333", "longitude": -122.396771288052}
{"reviews": [{"date": "2014-11-18", "text": "The short: mediocre food", "stars": "3.0"}, {"date": "2014-11-13", "text": "This place is amazing for lunch!  The brie and turkey sandwich is so delicious and all of their salads are so tasty!  The half sandwich/salad combo is such a deal!  SO much food!  Call ahead and order because it does get very busy at lunch.  And for good reason!", "stars": "5.0"}, {"date": "2014-11-10", "text": "I am a sandwich critic because my mom made me the best sanwhiches growing up and i consequently make some pretty good sanwhiches myself. This place has better sanwhiches than any other place I have ever had. I got the egg salad sandwich on a baguette and the portobello sandwich and split the two with my sister. If the silence was broken at completely silent table (all completely engorged in our meals) it was a moan let out by one of us. Amazing, that is all.", "stars": "5.0"}, {"date": "2014-11-09", "text": "This is one of my favorite spots for a delicious sandwich and salad. Every time I visit Cafe Du Soleil I have a 5-star experience. The owner is very kind, helpful, and makes sure that everything comes out perfectly. He is a master of his profession and his passion for food definitely shows. The restaurant is quaint and clean. If you go before 4:30, you can get the lunch combo and it's totally worth it. ", "stars": "5.0"}, {"date": "2014-11-07", "text": "Today's persimmon chicken salad - it was a visual and a gourmet treat rolled up in one!  The sweetness of persimmon against chickory greens and chicken - so very delicious!!  Michael and his staff always go the extra mile to please their customers.   They are the very best!", "stars": "5.0"}, {"date": "2014-11-05", "text": "Three words....Order The Sandwiches. ", "stars": "3.0"}, {"date": "2014-10-29", "text": "Fantastic! Incredible salads and sandwiches. I had the Maison salad with chicken (which is hot rotisserie chicken) and a Cafe au Lait with almond milk. ", "stars": "5.0"}, {"date": "2014-10-28", "text": "I had lunch here during a conference at Moscone. It was magnifique! The salad with Scottish salmon was fresh with delicious dressing. The turkey, Brie & peach sandwich was fantastic. My friend had the Niciose salad, lobster bisque and loved them. We highly recommend it! Service was friendly & excellent too!", "stars": "5.0"}, {"date": "2014-10-23", "text": "The best lunch I have had in years! We ordered the nicoise salad, the turkey/brie/peach sandwich and the lobster bisque. Everything was amazing! ", "stars": "5.0"}, {"date": "2014-10-22", "text": "Amazing!!  The $13 lunch combo with half sandwich and half Nicoise salad was so delicious I wanted to lick the plate. The salad ingredients were fresh and bright, and the baguette for the sandwich had so much depth I wanted to cry.", "stars": "5.0"}, {"date": "2014-10-19", "text": "Nicoise salad is awesome at this cafe! I eat salads everyday and without hesitation I give this place two thumbs up. The tuna, eggs, lettuce, beans, potatoes, red peppers, capers, olives are mixed to perfection. As often as I visit this place, the salad is always fresh and tasty. I will continue to visit this place as long as they don't change the chef. I have a sensitive palate and  will know when another person prepares this salad. So if you are in the neighborhhod--try this cafe--it's worth every cent. Last but not least, their mocha cafe is excelent--so much so that I stopped going to Starbucks.  Michael has great customer skills and knows how to stir mocha drinks to perfection. His staff reflects his charisma. Hence the tips that we, as customers, leave for the tasty food and outstanding service.", "stars": "5.0"}, {"date": "2014-10-16", "text": "The BEST SOMA lunch spot I know of - a little gem, just south of Moscone. My girlfriends from the office and I head here once a week for real food; perfectly prepared and always delicious.", "stars": "5.0"}, {"date": "2014-10-10", "text": "What a wonderful cafe in San Francisco! I love the half salad and sandwich combos, everything I have tried is delicious and the owner Michael is very welcoming and friendly. There usually is a line during lunch because it's so good. Definitely recommend this place to anyone who is in SF.", "stars": "5.0"}, {"date": "2014-10-09", "text": "WOW. The Shrimp bay sandwich is out of this world!!! I love the creamy mayo with the fresh dill and cucumber and avocado. I was blown away by the sandwich and I can't wait to come back an try more things!!", "stars": "5.0"}, {"date": "2014-10-07", "text": "Been here a few times and no matter what I order (usually a salad or a sandwich) the food tastes great every time! ", "stars": "4.0"}, {"date": "2014-10-06", "text": "The food is fresh but the taste is nothing special.", "stars": "3.0"}, {"date": "2014-10-02", "text": "My first time here but promise it won't be my last! The salad and sandwich combo is plenty of food for not-too-bad price, considering the quality. Had a smoked-salmon and asparagus salad w/ a half cheddar apple pastrami sandwich and they both were delish!", "stars": "5.0"}, {"date": "2014-09-30", "text": "Small shop with really good food. The owner is really friendly and helpful. Today there is a big event, so the shop was really busy. Despite this, the owner took the  time to chat with me and joke around. If you get a \"half\" salad and \"half\" sandwich, I promise you'll be full.", "stars": "5.0"}, {"date": "2014-09-25", "text": "Cafe Du Soleil filled that void of good sandwich around my work. Simply the best cafe for sandwich and salad in the SOMA neighborhood. ", "stars": "5.0"}, {"date": "2014-09-11", "text": "Super cute place. At first seemed rather expensive, but the combo deal half salad, half sandwich for $13 is really nice. We actually thought they messed up our orders because it looked like too much food for a French cafe haha. ", "stars": "4.0"}, {"date": "2014-09-10", "text": "I came by with a craving for some fresh veggies and was not disappointed. I don't usually take the time to make a Salad Nicoise at home and so was excited to see it on their menu. The greens and vegetables were very fresh and tasty, and the salad was well dressed. Overall this is a classic Salad Nicoise with potatoes, tuna, green beans, and egg. Just how I like it! And the small portion size was enough to fill me. I noticed that the cashier and who I assume is the owner, has a bit of a brisk manner of dealing with people; I think he is well meaning and this is just his European personality. I was very happy with the experience and would come back for a salad if I were in the area.", "stars": "4.0"}, {"date": "2014-09-06", "text": "Delicious food! And the owner is an absolute gem. So humble, kind, friendly, and generous. Can't wait to come back again and again :)", "stars": "5.0"}, {"date": "2014-09-05", "text": "Love this place! The smoked salmon salad (I forgot the exact name of it) is TO DIE for! I definitely will be coming back the next time I'm in SF!", "stars": "5.0"}, {"date": "2014-09-05", "text": "I would love to keep Cafe du Soleil my secret lunch spot, but I just can't do that to the best little lunch spot in all of the city, it is so AWESOME!  Sometimes the wait is long and line is out the door, but there is good reason.  The wait and line is nothing like LA or NY, so quit crying about the wait because the food is that good.  The lunch combos, salad/sandwich or salad/soup are the best for trying a couple of things.  It's all good, try not to eat the same thing twice until you have tried everything there at least once.  I have too many favorites to list.  Thank you!", "stars": "5.0"}, {"date": "2014-09-04", "text": "Some of the best food in San Francisco. Order ahead because Michael takes his time making everybody's order a masterpiece. This is quality and deliciousness.", "stars": "5.0"}, {"date": "2014-09-04", "text": "Stopped by here for a late lunch with my boyfriend after finding this place on Yelp and it did not disappoint! Absolutely delicious.", "stars": "5.0"}, {"date": "2014-09-03", "text": "Ordered a turkey and avocado sandwich and it came without avocado, leaving it as two pieces of bread, turkey, spread and a massive amount of lettuce. So much lettuce that the sandwich couldn't reasonably hold it all. It was also on the small side and I ended up needing a second lunch a few hours later.", "stars": "2.0"}, {"date": "2014-08-29", "text": "This place is DELISH. ", "stars": "5.0"}, {"date": "2014-08-27", "text": "I passed by several time in front of this inviting small place and today I have my first lunch there with a friend.", "stars": "5.0"}, {"date": "2014-08-27", "text": "One of my favorite lunch spots in the soma! The owner and his staff are very hard working and always are really nice. I love the Niçoise salad, peach-turkey sandwich and the st. Albray+mushroom sandwich.  I recommend the\"la combo\" because you get a sufficient amount of salad and half of a sandwich. I usually just eat the salad during lunch and the sandwich late afternoon. ", "stars": "5.0"}, {"date": "2014-08-25", "text": "BY FAR the BEST lunch spot in the city.  ", "stars": "5.0"}, {"date": "2014-08-25", "text": "I came in here for the first time today and ordered the small caprese sandwich.  For the price ($6.50) it was a decent size but was on the lighter side for a lunch.  However, it left me feeling satisfied enough.  If you're hungry, I'd order the large.  Quality and flavor wise there was nothing really to complain about.  The bread was top notch and the ingredients were fresh.  I subtracted one star because I was asked if I wanted it hot and I said cold, yet I received it hot.  Also, I would like more info about where the bread and meat come from.", "stars": "4.0"}, {"date": "2014-08-21", "text": "Just tried this place for lunch and was super impressed for a teensy little cafe!", "stars": "4.0"}, {"date": "2014-08-21", "text": "Great salads in terms of taste and quantity. Good convenient location to work. -1 star for the slow service on the orders. I had to wait 20 minutes for my salad. The owner who is there needs to start pushing orders out quicker.. If not, he might start losing customers for the slow service. No one should have to wait 20 min for a Caesar salad ..", "stars": "4.0"}, {"date": "2014-08-21", "text": "The coffee drinks are good.  The ham gruyere sandwich is okay but not fantastic.  The outdoor seating is pleasant, and the location is convenient.", "stars": "4.0"}, {"date": "2014-08-17", "text": "Stumbled upon this cafe on my recent trip to SF. Pleasant, little lunch spot a bit misplaced in SoMa. ", "stars": "4.0"}, {"date": "2014-08-15", "text": "I'm in LOVE! Okay, so the line is super long, even at ~2PM on a weekday, but the service is really friendly. This restaurant received rave reviews from my coworkers, and I'm not much of a sandwich person, anyway. I ordered the half sandwich and half salad. I asked which combos were on the \"approved list\", and they said ANY combo I wished. Thinking about the long line ahead of us, I made a quick decision and selected the PROSCUITTO DI PARMA which is Shaved Parmigiano-Reggiano, French Baguette and the CHICKEN, AVOCADO & MANGO which is the Organic mixed baby greens, Roasted chicken, avocado, Mango, Persian lime & ginger vinaigrette. The sandwich looks unassuming, but is super delicious. I took a few bites, but I needed to save it to share with my kids after work. The salad was soooo amazing with the huge slices of mangoes and fresh berries, and REAL chicken that was succulent and cooked perfectly for a salad. ", "stars": "5.0"}, {"date": "2014-08-15", "text": "I love this awesome lil French café!", "stars": "4.0"}, {"date": "2014-08-14", "text": "LOVE this cute little French cafe because of the following reasons:", "stars": "5.0"}, {"date": "2014-08-11", "text": "I literally just made a Yelp account about a minute ago so I could review this place. First things first, this place is really small and adorable, I didn't worry too much about the seating because I was taking it back to the office to eat but just keep that in mind.", "stars": "5.0"}], "average_rating": "4.5", "latest_date": "20140411", "name": "Cafe Du Soleil", "address": "345 3rd St", "latitude": 37.783401, "latest_score": "96", "num_of_inspections": "3", "ave_score": "95.3333333333", "longitude": -122.398127}
{"reviews": [{"date": "2014-11-19", "text": "Service is slow but I guess that's to be expected.  ", "stars": "3.0"}, {"date": "2014-11-13", "text": "Bad-ass sister restaurant of \"San Tung Restaurant\" in Sunset, probably the best American Korean Chinese food (you may say WTF, but yes) you can have in the city. Their fried chicken wings is probably the most peppery stuff I had in my life, unforgettable. Other dishes are OK, some with huge portions (and lot of rice), like the rice with ribs, not sure how one can finish that.", "stars": "4.0"}, {"date": "2014-11-13", "text": "If I had a choice whether to dine at San Tung or SO, 99 times out of 100, I'd choose SO over San Tung.  Here's why:", "stars": "5.0"}, {"date": "2014-11-04", "text": "I met up a friend here for lunch and was excited to try this spot given the amazing yelp reviews and how crowded it was when we arrived.  We had the \"Mao Pao noodles\" and \"Whatever\" dish.  I thought it was strange that the waiter brought us soup bowls when we didn't order soup; when the food arrived I realized that the sauce noodles we ordered were basically in a thick soup form which I found strange.  I typically love spicy food but both dishes were spicy in a bad way.  There was just something off about all the seasoning in the dishes.  At the end when we declined to take our leftovers the waiter seemed offended (awkward).", "stars": "2.0"}, {"date": "2014-11-04", "text": "People who don't like this place must hate their lives. I've never been disappointed with a meal here.", "stars": "5.0"}, {"date": "2014-11-04", "text": "I love them and their badass attitude!  The mushrooms are so bleeping good!  I think that they are suffering from being too popular.  people that have to wait get grumpy.  Expect a wait, and enjoy the delicious food!!!!", "stars": "5.0"}, {"date": "2014-11-03", "text": "Ordered take-out from here on a Friday night -- quick and great customer service. I would give it 3.5 stars because the food was yummy, but average quality. We ordered the black bean noodles, chicken wings and mapo tofu over noodles (basically the dishes that everyone raves about). Noodles were super chewy and the chicken wings were delicious. Make sure to eat them while they're hot!", "stars": "3.0"}, {"date": "2014-10-31", "text": "My boyfriend lives a few blocks away, and we come here often. ", "stars": "4.0"}, {"date": "2014-10-29", "text": "I have found a place where I can get the sapor of immensely tasty fried chicken, noodles, and dishes made with beef. Yes I am talking about SO; a perfect stead to chill out and have some remarkable food. I also enjoyed different shakes and beer. There is lot more in the beverages, as the way you like to pick. I thoroughly enjoyed the tasty, captivating, and spicy food out there. Everyone can enjoy this affordable treat. Chipotle fried rice and chicken wings are the specialty of this place, and I enjoyed every bit of it to the fullest.", "stars": "4.0"}, {"date": "2014-10-24", "text": "Great food but the wings are some of the best I've ever had! I live 14 hrs away and I will go back anytime I'm in San Fran", "stars": "5.0"}, {"date": "2014-10-24", "text": "Update: I have been back for lunch a couple times now and have tried several things. All of them amazing. The diced chicken, cherry chicken, and green beans are killer! I don't even live in the city and I crave So all the time!", "stars": "5.0"}, {"date": "2014-10-23", "text": "The food simply isn't good.  It was average.  Had the Mao Pao sauce noodles with beef, and the spiciness was attempting to make up for the apparent lack in flavor.", "stars": "2.0"}, {"date": "2014-10-18", "text": "What I had assumed was just your run of the mill asian fusion SF eatry, SO turned out to be the exact opposite. ", "stars": "5.0"}, {"date": "2014-10-18", "text": "I've started eating at the old San Tung on the other side of 19th ave since middle school, some 20 years or so ago.  I'm getting old, but the food is still as great as ever!  Haven't been back because of the lines at the new place, but SO happy this location is here and I can actually walk in and get seated and eat!  And good beer too. Great noodles, wings are even better than the original because of the spices!  I love it!  Who cares about msg and gluten free?  If you do, then go somewhere else, more for me!! Muahahahhaha.", "stars": "5.0"}, {"date": "2014-10-16", "text": "Tasty food all around.  The wings are a definite must order starter, then so many different options.  Really enjoyed the food here.", "stars": "4.0"}, {"date": "2014-10-12", "text": "My boyfriend and I paid SO a visit on Friday night after our Costco run. I had been craving fried chicken for weeks and had yet to find a place to satisfy my craving. After some yelp reviews, I decided that SO would be the place that I though could best satisfy my cravings. My boyfriend was a total sweetheart and came along for the ride. Parking was a bit of a struggle (after some serious parking maneuvering, I managed to find a spot right in front of the restaurant) and even though we got there kind of late, there were 4 parties of 2 in front of us so we had to wait for a bit. Of course we had to order the fried chicken, we also ordered the string beans, the potstickers, coroque, and the black bean sauce noodles.  ", "stars": "4.0"}, {"date": "2014-10-12", "text": "Highlights", "stars": "4.0"}, {"date": "2014-10-11", "text": "I don't know...I'm just not convinced by this place. I had such high hopes for the black bean sauce! My friend had the pork noodles and I had the renowned black bean noodles, but neither had a lot of flavor. ", "stars": "3.0"}, {"date": "2014-10-11", "text": "Love, love, love their fried wings. Gotta try! Everything else is ok, but their wings are to crave for.", "stars": "4.0"}, {"date": "2014-10-11", "text": "Food: 2 stars overall. The green beans had OK flavor (maybe it was MSG?) but overcooked and too oily; the chicken wings were good; and the mao pao was seriously lacking - noodles were soggy and the spiciness didn't make up for the off flavor.", "stars": "1.0"}, {"date": "2014-10-09", "text": "OMG I love this place.  Been here twice and I am obsessed with their chicken wings and chipotle fried rice!!!! Chicken wings are JUST as good as san tung!! Chipotle fried rice def has MSG!!! Lol.  Actually I don't know but I know it's addicting.  YUM!!! ", "stars": "5.0"}, {"date": "2014-10-09", "text": "I wish I could have 0 stars. Such rude waiter. That guy at the cashier is a dhead. Go there bcz of the reviews and experience it.", "stars": "1.0"}, {"date": "2014-10-08", "text": "Wings again!", "stars": "5.0"}, {"date": "2014-10-07", "text": "My favorite chicken wing place in San Fran.  The SO noodles are amazing and spicy.  Basically I've never had a bad meal here.  I totally support these guys cause they serve amazing food!  Stupid customers should not show up so I don't have to wait in line (cause there is usually a very long line--people know a good thing when they taste it and yes that includes MSG).", "stars": "5.0"}, {"date": "2014-10-07", "text": "This review is for my visit to SO on 09/24/2014. I actually bookmarked this place to try when they had first opened, but completely forgot about them until I read an article about how the chef walked out after back to back complaints and whatnot. The article included photos of handwritten signs posted stating that the restaurant uses MSG, does not believe in organic food, and does not, um, care about gluten free. Not being a stranger to Chinese food, I did not mind that there was MSG in my non-organic and gluten-laden food.", "stars": "3.0"}, {"date": "2014-10-05", "text": "James Chu's pro-MSG marketing campaign worked. Here I was, sitting in his small restaurant awaiting the infamous Chicken Wings and Chipotle Sausage Fried Rice. And I will say they were amazing. My favorite was actually the fried rice. Coming out of the kitchen piping hot, the rice was still moist and not overly dry, and the overall dish was well seasoned and balanced with shredded cabbage and mushrooms. The Chipotle sausage was delicious and thinly cut. I ordered the fried rice without jalapeños so it wasn't spicy, which paired really well with the chicken wings since they already have a bit of a spicy kick to them. ", "stars": "4.0"}, {"date": "2014-10-04", "text": "Tried the infamous chicken wings and they are just as good as the stories! Yes, it is a bit spicy (mostly from black pepper), but I could not stop eating them! They were the crispiest wings I have ever had.", "stars": "5.0"}, {"date": "2014-10-02", "text": "To the owner, Please don't close the restaurant after reading my post. Hehe. I don't mind MSG, it's umami. The wings, fried rice, dumplings were all so GOOD!. I just had a bad experience with the waitress, the short Asian, mid 30's?, a nickle, wearing yoga pants with granny panty inside..the lines gave it away. ", "stars": "5.0"}, {"date": "2014-10-02", "text": "A good deal for great food! On the surface the prices may not seem that special but the size of the portions more than makes up for it. Be sure to try the wings, but hope you like white pepper - seems to be one of their favourite ingredients! Cheapish beer and good spice levels make for a great meal. Come early as it fills up fast", "stars": "4.0"}, {"date": "2014-10-01", "text": "Had the diced chicken wings, regular chicken wings, string beans, and garlic pork noodle.", "stars": "3.0"}, {"date": "2014-09-30", "text": "I've always thought San Tung was way overrated, good to be sure, but not worth the hype.  This place is comparable.  In a vacuum, I'd rank both places as 3/4-star tweeners.  But given that the payoff in my opinion doesn't equal the hype, I'd make it 3 stars.  But in SO's case, HUGE props for saying F.U. to all the picky eaters.  Guess what people, sometimes a hair falls unnoticed off the head of the food preparer, whether you're at home or in a restaurant.  And sometimes a tiny bug survives the lettuce-washing process.  And here's a big shocker: Walk in to the kitchen of the nicest 5-star restaurant in the City at 3 a.m. and turn the lights on suddenly.  Odds are high you will see a roach scurry off.  That's just how it is.  So push that hair or bug aside, eat the rest of your food, and don't whine.  And if you don't want the food the way the chef intends to make it for you, stay home and cook for yourself.  P.S. Extra MSG and gluten on mine, please.", "stars": "4.0"}, {"date": "2014-09-29", "text": "This review is not based on the food.", "stars": "1.0"}, {"date": "2014-09-27", "text": "Had to check this place out after the owner blew a gasket and called out all his customers for wanting healthier, non-MSG food (See picture section).  Hilarious.  ", "stars": "1.0"}, {"date": "2014-09-25", "text": "The food here is fantastic. It's an offshoot of San Tung (well that's what everyone tells me), and you can see it in their wings - they have the same texture as San Tung's but are BETTER because they have a spicy kick. I love that.", "stars": "5.0"}, {"date": "2014-09-24", "text": "Time: 12:31pm/78°F intermittent cloud", "stars": "3.0"}, {"date": "2014-09-23", "text": "I support this business even more after all the bad publicity it has gotten regarding the owner's attitude towards some of his demanding customers. I worked for a restaurant where some customers were down right rude, racist and disrespectful to the staff and we felt helpless because the manager and owner cared about making money only. At the end of the day, we all work for our dignity and some customers feel that they are (over) entitled. mr chu...  Great job and you will have my business!!! Keep kicking those assholes out", "stars": "5.0"}, {"date": "2014-09-23", "text": "Chicken wings were great. Best beef and fried rice in San Fransisco. Highly recommended. Prices are reasonable. Location is very convinient.", "stars": "5.0"}, {"date": "2014-09-23", "text": "****CUSTOMER SINCE JUDAH /IRVING****", "stars": "4.0"}, {"date": "2014-09-23", "text": "I ate at this place weekly for over a year. Delicious, great service. No bullshit.", "stars": "4.0"}, {"date": "2014-09-22", "text": "Damn I love this place.  Depending on what I am eating I may need a gallon of water as a side dish, but you know what you are getting.  Obviously the wings are a must have, but so are the green beans, most of the noodle dishes and the Dirty Dastard (with the egg especially).", "stars": "5.0"}], "average_rating": "4.0", "latest_date": "20140324", "name": "SO", "address": "1010 Bryant St", "latitude": 37.772413, "latest_score": "90", "num_of_inspections": "4", "ave_score": "92.25", "longitude": -122.407498}
{"reviews": [{"date": "2014-11-19", "text": "Deli board makes great food.  The sandwiches are delightful, they taste fresh, the bread is soft, and the flavor is great.  The salads have fresh ingredients, and are a great portion.  The downside? A sandwich or salad will cost you $16.00 and 30 minutes of your time, just to get the food.", "stars": "3.0"}, {"date": "2014-11-17", "text": "I had to give 2 stars only because of the price. The sandwich itself was pretty good. Soft bread, good tasting meat, and fresh veggies. However $20 for a sandwich and cup of soup is pretty ridiculous. I do not think I will return to this place as I can get great deli sandwiches for half the price at many other places in the city, and these are nothing to write home about.", "stars": "2.0"}, {"date": "2014-11-16", "text": "This place makes my stomach & heart happy. I live on the Peninsula but work in the city & I crave their sandwiches when I'm back home. I love their creative menu, funky sandwich names, & their sandwiches. The $$$ is exactly that..money, money, money in my tummy, tummy, tummy. It's filled with meat, cheesy goodness, and flavor. I could eat it 5 times a day. And don't forget the Skully! Turkey, kosher salami, cheese, and all the fixings..And now I'm hungry.", "stars": "5.0"}, {"date": "2014-11-13", "text": "Came here because of the great reviews. Both of the two sandwiches were incredibly small and the were just so-so at best. I should not be able to eat a $14 sandwich in 9 bites. The reason I am giving them 2 stars is because I paid $32 for two sandwiches.  I feel like an idiot for paying that much for two sandwiches.  I would have had the same experience going to subway, grinding the meat up, microwaving it, putting the meat back on, and spending $10 on two sandwiches. This place is VERY VERY over rated.", "stars": "2.0"}, {"date": "2014-11-11", "text": "This has to be the best sandwich I have ever had.  Pricing is right in line for quality food in San Francisco.  ", "stars": "5.0"}, {"date": "2014-11-08", "text": "The most under rated and under-talked about sandwich place in SF. So much better than Ike's and Wise Sons. The guy running this joint also has great place, \"The Rye Project\".", "stars": "5.0"}, {"date": "2014-11-08", "text": "Been meaning to try his place for a long time now. Since it's open only during the day i never get to it. Was in the area for a meeting so i hit it up before heading there. The Hermine is a loaded sandwich. Brisket, corned beef, muenster, pastrami, sauce, good bread. Good pickle on the side and a Doc Browns. With tip that got to be basically $20 for lunch. Now if the sandwich were twice e size id probably be more comfortable with the price. Its no less tasty just a tad on the expensive side. Still worth trying though if youve never been", "stars": "4.0"}, {"date": "2014-11-06", "text": "Sure, the sandwiches might be a bit on the expensive side, but that'll help me not eat here every day and endanger the tensile strength of  my belt.", "stars": "4.0"}, {"date": "2014-11-03", "text": "What's better than overstuffed sandwiches on a Saturday afternoon?  Our SF hosts have lunch here regularly on Saturdays just to enjoy the special BK sandwich = sausage, bacon eggs and cheese.  Turned out to be my favorite meal in SF.  Husband had the Zeke and also raved.  Fun and friendly staff and a line out the door for the whole time we were there.", "stars": "5.0"}, {"date": "2014-10-29", "text": "My coworker was going to get a sandwich from here and asked if I wanted to tag along.  How can I say no to a sandwich? (Cue in appropriate Joey Tribbiani GIF).", "stars": "5.0"}, {"date": "2014-10-28", "text": "Hot roast beef and munster cheese todsy, exceptionally good!!!  Try any of Adam's soups and / or salads if you are not up for a sandwich.", "stars": "5.0"}, {"date": "2014-10-25", "text": "This place is amazing.  I would give it 6 stars.  The pastrami and brisket feeds my dreams.  Great staff too.", "stars": "5.0"}, {"date": "2014-10-24", "text": "Why, cruel universe, do you close deli board at 4?  So good!  I wish I could get a sammy here after 6 when I get off, but alas.  Pickles!!!", "stars": "5.0"}, {"date": "2014-10-21", "text": "been eating these sammiches since they had the little window shop on howard and STILL can't find a better deli.", "stars": "5.0"}, {"date": "2014-10-17", "text": "The food gets a solid 5 stars no questions asked. Some of the best pastrami I have ever had in my life.", "stars": "3.0"}, {"date": "2014-10-12", "text": "So, here is the deal.  This place is just about the stupidest place that I have ever had a sandwich in my life.  There is absolutely no reason to pay the ridicules cost for a sandwich that this place charges and the energy could not be in more bland and boring...  I grew up in San Francisco and there was a time where the expectation of a good sandwich shop was more like Lucca or Molinari or Roxie's or but NOT Subways!  Go to Tony Baloney's down the street if you want a killer sandwich at a fair price with interesting decor.", "stars": "1.0"}, {"date": "2014-10-10", "text": "I believe that they are the best sandwich spot for any meat lover. Their price tells you about the quality of the meat that goes into that sandwich. The moment I digest that sandwich I feel like going back for more. They are known for the pastrami and my favorite is the Corned beef. I also like the Tuna on Dutch Crunch. I like the quality of the clover sprouts, pickles and all other fixxings that go into my sammich. I highly recommend this place to anyone that likes a hot meat loaded sandwich.", "stars": "5.0"}, {"date": "2014-10-10", "text": "It's way overpriced, but I don't care because it's just that good... All about that Cohen.", "stars": "5.0"}, {"date": "2014-10-10", "text": "Sandwich was really good! Staff was friendly and welcoming. My only complaint was it's too expensive I would say instead of $14 it should be no more than $11. If the price was adjusted I would be at least a weekly regular.", "stars": "4.0"}, {"date": "2014-09-30", "text": "Ordered the Chloe w Dutch crunch instead of a French roll and added Pepperchini mix. The sandwich is REALLY good, woulda been perfect with a little more sauce... I added some stadium mustard to it. It comes with pickles on the side, yum. I did order a bag of chips and water bottle with it, and it came to like $19 ... Definitely WAY more money than I like to spend on lunch, but I'm on jury duty and they had great reviews so I had to check it out. It is a great spot though! They had a line the whole hour I've been here.", "stars": "4.0"}, {"date": "2014-09-27", "text": "So goooood!  Sandwiches are substantial. During the day I can't eat too much bc I will surely fall asleep.  Back in high school I had band class after lunch and I swear, I fell asleep sometimes. Anyways, in order to avoid food induced narcolepsy, I only ate half of my sandwich. It pained me to give the other half away to a friend but I needed to stay awake.  I had the Ron which was delicious. It had a great balance of flavors - nothing that was too overpowering. It was roast beef, cheddar, slaw, jalapeños, and avocado on a garlic French roll. Sandwiches are served hot!  Also, they give you a giant pickle on the side that tasted like Clausen pickles - my favorite since they are crunchy and have a strong salty, vinegary, dill flavor.  Will be back!", "stars": "5.0"}, {"date": "2014-09-25", "text": "I'm giving this place 2 stars because the price is outrageous. ", "stars": "2.0"}, {"date": "2014-09-23", "text": "Super Hight Quality Meat.  Their sauces are awesome too, so don't forget to try those while you are there.  Also, if there is a sandwich you really like remember the name, they rotate menu but they can make it again usually.", "stars": "5.0"}, {"date": "2014-09-18", "text": "Like most negative reviews on Yelp some ot the ones here are just so stupid. ", "stars": "5.0"}, {"date": "2014-09-15", "text": "Was excited to see what all the hype was about, and while the food itself is good, the service and staff leave much to be desired. ", "stars": "2.0"}, {"date": "2014-09-12", "text": "Warm, meaty, flavorful sandwiches.  Good variety and creative combinations of ingredients.  They are a bit on the pricey side and tend to be a bit of gut-bomb, but I love gut-bombs.  If you dig Reubens, grab the Ruby Claire.", "stars": "5.0"}, {"date": "2014-09-07", "text": "The VHAT. Yes.", "stars": "4.0"}, {"date": "2014-09-06", "text": "Do yourself a favor and go here!!  Ahhhhh-Mazing sandwiches!!!  We tried The Zeke and The Mezman!  Both Oh. So. Good.", "stars": "5.0"}, {"date": "2014-09-05", "text": "This place is very good for the food and for the people that work here are very friendly. I live across the street from deli board don't get me wrong the first time I tried I was surprised with the prices, $9 a sandwich whow, hey this is the city so prices are a bit higher. The sandwich was very good, tasty, meaty not dry at all. Just noticed that the price went up again $9, $11 and now $15 for a sandwich. I like this place but for a local resident with a family, I sure have to think twice about eating here, beside the majority of the people eating their look like younger techie hipsters with no kids that have no problem in paying that much for a sandwich. So I'm pretty sure they will be good with out my support of ever buying a sandwich their again so I will enjoy this cause it's the last I'll have. $$$$$", "stars": "2.0"}, {"date": "2014-09-04", "text": "Seems like this is where hipsters go to grab some good pastrami. It's a cute little place that offers a variety of hot sandwiches and fresh salads. I had the pastrami sandwich and I have to say, I think I prefer thick cut pastrami better, so the sandwich was okay. The meat was good but too thin for my liking. The bread tasted similar to potbelly sandwich bread so a bit on the chewier side. I really liked the bubbies salad which was egg salad, tuna salad, and chicken salad on a bed of field greens. You could tell they made the salads from scratch so I felt really good after eating the whole thing. ", "stars": "3.0"}, {"date": "2014-08-30", "text": "One of our favorite restaurants in the city. We make the trip, which is very out of our way, at least once a week. Why? Best sandwiches in the city. Hands down. Also, great appetizers (if they happen to have one - jewshi, newshi, platter, whatever - GET IT), soups, and salads. And hot sauces. Super tasty housemade hot sauces in rotating flavors. But really cannot overstate how PHENOMENAL the sandwiches are. Don't forget to check the specials board or you might miss out on the BK breakfast sandwich, the meaty gyro, the messy Italian beef, the cheesesteak I myself keep missing, or something else exciting.", "stars": "5.0"}, {"date": "2014-08-25", "text": "If you love sandwiches, you'll LOVE deli board. I got their Boca and wasn't disappointed. Warm and toasted, lots of sauce, melted cheese...portions aren't ginormous like little luccas but it's still a pretty heavy sandwich. I ate half for lunch and the other half for dinner; still good later :) ", "stars": "5.0"}, {"date": "2014-08-25", "text": "Prices have climbed significantly in the past year and the sandwiches have gotten significantly smaller.", "stars": "2.0"}, {"date": "2014-08-25", "text": "OVERRATED.", "stars": "2.0"}, {"date": "2014-08-23", "text": "Let me first be very clear. This is not a quick and cheap sandwich joint a la (the spectacularly good) Ted's. This is a high-end sandwicherie.", "stars": "5.0"}, {"date": "2014-08-19", "text": "I got the Chloe and it arrived wrapped as a stolid grenade that when split open, rushed forth like an oven door in a steamy burst of soft French bread, juicy stacks of meat (turkey, Romanian pastrami, and salami), coleslaw and spicy cherry peppers.", "stars": "5.0"}, {"date": "2014-08-19", "text": "the first couple times i came here, i thought the sandwiches were so good.  after a few more times, the sandwiches started to all taste the same.  especially if you order from the first column where the meat is pastrami, corned beef etc.  ", "stars": "3.0"}, {"date": "2014-08-16", "text": "One of the best restaurants in San Francisco. Amazing sandwiches, fantastic meat, special \"Newish\" appetizers on occasion. Friendly staff, speedy service, and a spacious ambiance. House-made hot sauce, \"Stadium\" mustard. You must try it!", "stars": "5.0"}, {"date": "2014-08-14", "text": "This really is as good as it gets. Albeit this is a substantial walk from my office (15-20 minutes), its worth every second. If I'm ever craving a sandwich, or a salad, Deli Board never fails to deliver (fun fact : It also gets auto-corrected to Delhi Board on my phone, which always makes me laugh and think of home).", "stars": "5.0"}, {"date": "2014-08-01", "text": "Whoa Whoa Whoa! Hold on Ike's, you have a contender! Ever since my friend introduced my to Deli Board, I've been a huge fan. Love their sandwiches! They do not skimp you out of meat. In fact, they are very generous in the amount of meats and toppings in their sandwiches. My goal is to try each one down the menu list. ", "stars": "4.0"}], "average_rating": "4.5", "latest_date": "20140423", "name": "Deli Board", "address": "1058 Folsom St", "latitude": 37.7777276, "latest_score": "85", "num_of_inspections": "3", "ave_score": "88.6666666667", "longitude": -122.4071504}
{"reviews": [{"date": "2014-11-12", "text": "The butternut squash sandwich was great. Also lusting after the dishes of everyone around me. Will be back to try more of their menu", "stars": "4.0"}, {"date": "2014-10-29", "text": "Loveddddd this place! The bread was soft and melt in my mouth and the lamb was superb!!! I had the lamb sandwich and I will be back for more! Additionally, I had excellent customer service!!! You MUST come here, this place is quality!!!", "stars": "5.0"}, {"date": "2014-10-07", "text": "Delicious sandwiches and salads from a family run business.  Great lunch option if you're in the area.", "stars": "4.0"}, {"date": "2014-09-23", "text": "First, the place smelled like heaven. I had the Kale and white bean salad with chicken. Perfect. I'm a very picky salad guy but no qualms at all, this is good. My companion had the pork belly sandwich and said, \"It's soooo good.\"  Not much I can add to that!", "stars": "4.0"}, {"date": "2014-09-21", "text": "There are a ton of sandwich spots for lunch in the downtown area and recently I have been unhappy with most of them. As such I didn't have very high hopes when trying out this place for a lunch adventure. It turned out to be a pleasant surprise.", "stars": "4.0"}, {"date": "2014-09-17", "text": "The one star is for their service. ", "stars": "2.0"}, {"date": "2014-08-20", "text": "It's alright, nothing really stands out. You probably won't be disappointed or enthused.", "stars": "2.0"}, {"date": "2014-08-07", "text": "Ordered the turkey breast sandwich and heirloom tomatoe soup...was only seated for a few minutes before my sandwich arrived, about a minute later my soup arrived . Absolutely one of the best lunch spots for people who care about quality food and have limited time. Great dining experience all the way around", "stars": "5.0"}, {"date": "2014-07-28", "text": "Pretty good but the wait and service sucks.  Way to busy at lunch so pre order or they will forget about you", "stars": "3.0"}, {"date": "2014-07-23", "text": "AMAZING Kale salad!!", "stars": "5.0"}, {"date": "2014-07-16", "text": "I went here for lunch because I wanted to try something new.  I got the beef cheek sandwich and it was pretty damn amazing.  The beef cheeks were really tender, with roasted bell peppers, but I didn't get the cheese.  Overall the sandwich was really tasty and moist, a little on the fatty side.  It came with a simple but well dressed arugula salad.  The whole thing was $11.41, tax included.  Kind of pricey, but I will be back to try the Moroccan lamb.", "stars": "4.0"}, {"date": "2014-07-02", "text": "Whoah!!! Just stumbled in and what a surprise, great samich! Btw had the turkey.", "stars": "5.0"}, {"date": "2014-06-18", "text": "I went there a second time.  This time around I asked for a small substitution for my sandwich.  It seemed to have been a big deal for some reason.  Anyway, the chef himself delivered the sandwich to me which I thought was kind of strange since he didn't do that for anyone else.  I hadn't eaten all day and was very hungry.  I did not feel well at all after eating the sandwich and for a few days after that.  I won't go back.", "stars": "3.0"}, {"date": "2014-06-10", "text": "This place is great - I just moved into the neighborhood and was looking for a quick but decent bite to eat two of the days I was unpacking", "stars": "4.0"}, {"date": "2014-06-05", "text": "Pleasant staff, nice seating, good sandwiches.", "stars": "4.0"}, {"date": "2014-05-21", "text": "I stopped by to get an iced latte on my way to the DMV and the first sip I was like, \"Holy crap. This is the best latte I've ever tasted\"... and then after that, it wasn't that great. I kind of think their ice cubes change the flavor of the drink a little bit.", "stars": "4.0"}, {"date": "2014-05-05", "text": "4 stars, and 5 napkins!", "stars": "4.0"}, {"date": "2014-04-22", "text": "Walked by this place with a co-worker and I'm glad we stopped by. Tasty food, nicely presented, and the ambiance/public is pleasant too. Enjoyed it. Will recommend it to my other colleagues. Good luck with your business!", "stars": "5.0"}, {"date": "2014-04-21", "text": "Don't come for breakfast. You'll be disappointed.", "stars": "3.0"}, {"date": "2014-04-08", "text": "I'm updating my review because my recent visits to V-105 were much improved. The sandwiches and salads are great and the place has a nice atmosphere.", "stars": "5.0"}, {"date": "2014-03-05", "text": "This place is a neighborhood gem. The food is gorgeous, locally sourced, and more gourmet than most options in this price point. It's obviously made with love because the cafe is run by a husband-wife team. I have a hard time deciding what to order there when I watch the food being prepared because it all looks so good, but my recommendation is the portabella sandwich on house-made focaccia. It'll make your day.", "stars": "5.0"}, {"date": "2014-03-02", "text": "Came here one afternoon for lunch. The chef behind the counter don't look esp. happy that day (in part due to a customer in front of me asking for the wrong thing), but I forged ahead anyway and got the mango chai and the brisket special.", "stars": "4.0"}, {"date": "2014-02-14", "text": "I've had the Crispy Pork sandwich, Moroccan Lamb sandwich, and Bacon Mac & Cheese, which were all remarkably good. The sandwiches come with multiple layers of tasty condiments and side salads, which justifies the price for me. The service has been consistently slow, but the kind owners and flavorful fixings push this place over the edge in my opinion. Check it out for a low-key lunch with friends or co-workers.", "stars": "5.0"}, {"date": "2014-02-07", "text": "Great little lunch place in a less congested part of Valencia. Parking is actually fairly easy here during the day. Good selection of salads and sandwiches, and the food is very fresh and tasty. I had the portabella mushroom sandwich with an arugula side salad and it was excellent.", "stars": "5.0"}, {"date": "2014-02-06", "text": "One of the best lunches i have had anywhere. I had the crispy pork belly sandwich My friend had the Moroccan lamp sandwich. We also had the Cesar salad which was also very good. I will return and hope it becomes a part of the area.  I loved it", "stars": "5.0"}, {"date": "2014-02-05", "text": "LOVE LOVE LOVE them here! The owners run the place and they are incredibly nice. The staff are as friendly ad they come. I have yet to have something on the menu that I do not like. Yes, I have in fact had almost everything on the menu. ", "stars": "5.0"}, {"date": "2014-01-16", "text": "This place was lovely.  Their lemonade was tasty, the chicken sandwich I had was delicious and not insanely large, service with a smile and good WiFi.  I'll happily go back", "stars": "5.0"}, {"date": "2014-01-14", "text": "I can't tell which is sweeter-- the lamb or the employees! I work in customer service and I don't have any idea what these people are trippin about with their crabby reviews. Maybe they're sourpusses themselves cause this little boy right here walked in and got a free cookie with his lambwich.", "stars": "5.0"}, {"date": "2014-01-12", "text": "Danielle and Susy are beautiful, kind people with a uniquely wonderful place to eat in SoMa.", "stars": "5.0"}, {"date": "2013-12-20", "text": "Unbelievably amazing. Their fresh, house made bread is delicious and the sandwiches they come up with are very balanced and delicious. My favorite sandwich so far is the pork, with the portobello as a close second. The only sandwich I didn't like was chicken and apple, but I appreciate the attempt at interesting flavor combinations. ", "stars": "5.0"}, {"date": "2013-12-16", "text": "Best sandwich I've had in a while :) Roasted butternut squash with all the trimmings on homemade focaccia. Delicious! Can't wait to go back!", "stars": "5.0"}, {"date": "2013-12-12", "text": "Ingredients still seem fresh but seasoning is a bit bland.  The smoothly pureed cauliflower soup was creamy but lacked flavor.  The side arugula salad was half dressed but still fresh. Don't forget to bring a bag for togo orders.  Not sure if they provide it with a fee but they didn't offer it, as I walked out with items three-story piled high.", "stars": "3.0"}, {"date": "2013-11-19", "text": "Absolutely loved the lamb sandwich! Reasonably priced and original. Will be back to try their vegi sandwich and salads. Everything looked great. Outdoor seating however is a table or two on the busy street. Really could use a parklett.", "stars": "5.0"}, {"date": "2013-11-18", "text": "I always get the butternut squash sandwich on salted focaccia bread with tomato, avocado, side of arugula salad. Primo!", "stars": "5.0"}, {"date": "2013-10-23", "text": "My favorite lunch destintion. Wish it was open on the weekends and evenings.", "stars": "5.0"}, {"date": "2013-10-14", "text": "This place does \"simple\" exceptionally.  Small, approachable menu...great sounding combinations of flavors and very tasty food. Truffled Mac and Cheese was great, fruit based salad was incredible and roasted turkey sandwich was well executed.  Would come back!", "stars": "5.0"}, {"date": "2013-10-11", "text": "The beef cheeks focaccia sandwich is amazing!", "stars": "4.0"}, {"date": "2013-10-08", "text": "Great spot for lunch! Always hits the spot and I wish I knew how to make that little side salad they give with all their sandwiches. The only thing- it's a little pricy for lunch. I like to keep my lunches to under 10 bucks in the city. Sometimes this goes a little bit over.", "stars": "4.0"}, {"date": "2013-10-07", "text": "Great sandwiches, salads and drinks. What more could you ask for? It's surprisingly not difficult to get a table during lunch...surprising because this is a superlative spot. ", "stars": "5.0"}, {"date": "2013-09-26", "text": "'Wich don't kill my vibe, 'Wich V-105, I can feel your tastiness from two planets awayy", "stars": "4.0"}], "average_rating": "4.5", "latest_date": "20140418", "name": "V-105", "address": "105 Valencia St", "latitude": 37.7714817, "latest_score": "100", "num_of_inspections": "5", "ave_score": "96.6", "longitude": -122.422399}
{"reviews": [{"date": "2014-11-17", "text": "I think you have got to be drunk to like this place (which I imagine, most who eat here are). The food comes cold and in small portions, also incredibly salty. Not quality stuff, but cheap! Spaghetti bread was stale last two times I ordered it. The chicken waffles are pretty good, but the machine has been broken the last few times I've stopped by. The workers are always very nice and cracking jokes, but that's sort of the only thing to rave about while waiting for your cold food in the icy, dark alley. Who would've guessed that the world's missing hospitality would be found at a little hole-in-the-wall?", "stars": "2.0"}, {"date": "2014-11-15", "text": "Great food! Little hole in the wall, got the chicken sandwich, bread awesome, spicy like mayo sauce with coleslaw. Totally will go back for the food. Only disappointment is that it is down a kinda dark street at night, and although it's next to a bar, there seemed to be many homeless people wondering by. I had my 10 year old son with me it was around 9ish and some drunk homeless man kept walking hovering the area taking about very negatively about himself and his race. It was not a good waiting around experience with my son.", "stars": "4.0"}, {"date": "2014-11-12", "text": "great food but last time i came it was to salty.", "stars": "3.0"}, {"date": "2014-11-09", "text": "Nothing like good food to counteract all the alcohol you've been drinking next door. That basically sums up Box Kitchen for me.", "stars": "4.0"}, {"date": "2014-11-06", "text": "Food was good, came it fast, service in the window was super friendly. Very convenient spot and you can bring it in to Tempest while you're drinking, \"high five!\"", "stars": "4.0"}, {"date": "2014-10-21", "text": "Perfect place for a late night bite! We got the falafel wrap, fried mac and cheese balls and the chicken in waffle. Everything was prepared fresh and tasted delicious. The chicken inside the waffle was quite interesting and came with a delicious maple Sriracha sauce. There isn't any seating as it is literally a little box, but you could walk to the nearby neighbourhoods or just stand outside and eat, like we did!", "stars": "4.0"}, {"date": "2014-10-18", "text": "My last trip wasn't the best simply because I ordered a well done burger and received a burger that looked fresh out the slaughter house oozing with blood and juices. I haven't been back since, ugh!", "stars": "3.0"}, {"date": "2014-10-11", "text": "Cool place, food didn't blow me away. ", "stars": "3.0"}, {"date": "2014-10-09", "text": "Best hole in the wall, ever.  Little pricy without a doubt but it'll fill your late night cravings with incredible,  greasy,  original menu options. It's all great, you can't go wrong here.", "stars": "5.0"}, {"date": "2014-10-08", "text": "This place is an alley that I drive down every night to get home and I never noticed it until I was hangry one night and jumped on Yelp.  OMG, the Box burger and garlic fries were amazing...best burger that I have had in SF.  The burger was juicy, flavorful, and paired nicely with the garlic fries.  As for the service, they were friendly and my order didn't take too long even though it was made to order.", "stars": "5.0"}, {"date": "2014-10-07", "text": "What I ordered:", "stars": "4.0"}, {"date": "2014-10-03", "text": "potato skins with quail eggs at a gross, loud dive bar on Natoma @ 5th. St. I met someone in the area and wanted to try this dish. I don't know how the place is rated as highly as it is... Maybe it's decent for the area. What a shit show. Granted, I can't stand dive bars in grimy areas.", "stars": "1.0"}, {"date": "2014-10-01", "text": "I came here with a friend before catching a movie at the Metreon. It was about a 7 minutes walk away. Box Kitchen is in an alley way next to a bar (Tempest) or maybe it was connected to the bar. It seemed sketchy with all that. ", "stars": "4.0"}, {"date": "2014-09-29", "text": "This place is a great little hole in the wall, literally. There are no seats to speak of and you order your food at the door and they call your name out.  The good is really great and satisfying.  I had the salt and vinegar fries and the Chicken sandwich, I was not disappointed.  I only had one complaint my fried who is celiac couldn't be assured of a gluten free meal. All else was amazing.", "stars": "4.0"}, {"date": "2014-09-26", "text": "Better than expected burger and excellent garlic fries. Burger patty was perfect. Overall a bit fatty but good. Positively surprised, would go again.", "stars": "4.0"}, {"date": "2014-09-23", "text": "Where have you been all my life, Box Kitchen? You taste excellent sober; I can't wait to taste you drunk. You're a beacon of light in a falling apart alleyway; you're the hole-in-the-wall that San Francisco needs and deserves. If you're asking \"What? Why does a dive bar's outside food window have rave reviews? Why is it open for lunch?\" I have no answers to your questions, but you must come and experience Wonderland for yourself.", "stars": "4.0"}, {"date": "2014-09-22", "text": "Burgers and garlic fries here are mouth watering.  ", "stars": "4.0"}, {"date": "2014-09-21", "text": "This is literally a hole in the wall place. It is a hole in a brick wall. It was pretty busy and it did take quite a while to get our food. I ordered the potato skins which was $9 for 3 potato skins... which is 1.5 potatoes. I'm used to getting at least 6 potato skins and for a cheaper price. But anyway, the potato skins had cheese like normal, but also had pork belly and a quail egg on them...... I was not a fan. I also tried someone else's garlic parmesan fries which I debated getting and I'm glad I did not get them. They were just meh.", "stars": "1.0"}, {"date": "2014-09-20", "text": "Open from 4:20p.m. :) to 2:00a.m. The Chicken Sandwich!!!", "stars": "5.0"}, {"date": "2014-09-19", "text": "Yum yum yum yum yummmmm. This place is effing delicious. I've passed by it a few times and never really took notice to it. But thank god was around this place when my belly started to grumble. My boyfriend got the ribs, which I forced him to share with me once I took a bite and was unable to stop funneling them into my black hole of a mouth. I got the garlic fries and the elote which is their corn on a cob. Both delicious. The garlic fries were bomb and the elote I couldn't help but moan with every bite. ", "stars": "5.0"}, {"date": "2014-09-17", "text": "I go here all the time and have had most of the menu. All very good but I'm not a huge fan of the felafel wrap.", "stars": "5.0"}, {"date": "2014-09-16", "text": "This place is a sweet hole in the wall find. Order at the door and they call your name. People are super chill. Great quality and right next door is tempest if you wanna get a drink. Definitely recommend it for a late night bite.", "stars": "4.0"}, {"date": "2014-09-13", "text": "Food: 3", "stars": "3.0"}, {"date": "2014-09-09", "text": "Above-average bar food, served with an XXL side of IDGAF.", "stars": "3.0"}, {"date": "2014-09-07", "text": "Burger was good, but I wish the cashier tonight told me earlier that they ran out of burger buns and gave me I think sour dough (which I don't like). Told him I wanted to go and he got that wrong... He might be tired, but so am I... I even tipped him too and I don't think he even noticed.", "stars": "3.0"}, {"date": "2014-09-04", "text": "Chicken. And. Waffles.", "stars": "5.0"}, {"date": "2014-08-31", "text": "Not sure how this place earned 5 stars but it is definitely not worthy of 5 stars. I had  ordered garlic fries ($5), salt and vinegar fries ($6) and tacos barbacoa ($7) so was expecting nothing but goodness. ", "stars": "2.0"}, {"date": "2014-08-27", "text": "Wow.  I could say this is the best burger I have ever had.  I could also say this is the best meal I have had in SF.  ", "stars": "5.0"}, {"date": "2014-08-23", "text": "This is the place to visits for a delicious quality late night meal that will NOT disappoint. We are so delighted to have found this little gem through yelp and they really do have one of the best burgers we have ever had. Although $8 might be a bit much for just the burger and no sides, but trust me, everything about this place is amazing. We also really enjoy the fact that they change their menu frequently but at the same time keep their best items permanent. The neighborhood is very shady, but hey, for food this good at 12am, I'll take my chances.", "stars": "5.0"}, {"date": "2014-08-17", "text": "A literal hole in the wall. Had the honey mustard chicken sandwich and a coconut. Expected more, to be honest, from the reviews for this place. The sandwich was decent. Would probably come back and try something else, but was pretty expensive for the back alley soup kitchen vibe. The coconut was perfect.", "stars": "4.0"}, {"date": "2014-08-16", "text": "This place was awesome! Great food. We had the honey mustard chicken sandwich, pork tacos, and queso. It was all amazing! Great flavor, and fresh ingredients. I  also thought it was super reasonably priced for San Francisco. Definitely a pretty sketch neighborhood from the looks, but we didn't run into any trouble in the block in a half we walked or while waiting for our food--which was ready super quick.", "stars": "5.0"}, {"date": "2014-08-09", "text": "Ok stayed at Intercontinental on Howard St. I wanted some other than room service. Great late night food! We could not decide so we purchased corn on the cob, box burger, honey chicken sandwich, potato skins and the garlic fries. Best was the Box Burger. Area was suspect so don't walk by yourself. We left San Fran yesterday and we are still talking about the concert, Crustacean and the Box Burger!", "stars": "4.0"}, {"date": "2014-08-09", "text": "Let me start off by saying that I was SO sad they didn't have the chicken in waffles when I came here last night. I risked my life walking through the SUUPER shady alley way and hunting for a parking spot on Market, all I wanted was chicken IN my waffles.", "stars": "4.0"}, {"date": "2014-08-05", "text": "The burger I got here was delicious -- especially the tomatoes. You know how much burgers' tomatoes are kind of.. bland? These tomatoes, I have no idea where they got them but they taste divine, juicy, and red, unlike any tomatoes I have ever tasted on a burger. The other ingredients were top notch too, but for some reason the tomatoes were the most memorable.", "stars": "5.0"}, {"date": "2014-08-03", "text": "Pretty cool, great for late night. ", "stars": "4.0"}, {"date": "2014-08-02", "text": "Food is super tasty, but its in a sketchy back alley. Order the chicken sandwich, bring mace.... oh and a pop if you dont plan to hit the bar. No drinks here.", "stars": "4.0"}, {"date": "2014-07-31", "text": "Scary neighborhood, parking meters, back alley hole in the wall, next to a rowdy, er I mean lively bar (Tempest).", "stars": "5.0"}, {"date": "2014-07-27", "text": "Great late night food.", "stars": "5.0"}, {"date": "2014-07-26", "text": "Okay , this burger could easily go for 35 bucks in a primo restaurant. The guys who started the swanky bar next door opened this place for drunk eats. They applied their culinary acumen and the result is our benefit. Nothing price-to-value wise is better. Go for it.", "stars": "5.0"}, {"date": "2014-07-20", "text": "Holy crap, this was good (i.e. the Box Burger). It's the kind of place you want to call a hidden gem, but yet any yuppie or hipster in SF knows about it already. I'm sure the backlash is gestating at a minimum, so here's my part to stem the tide. This is a legitimate contender for the best burger I've had - I can't think of one I like better. I'm from Dallas and I've eaten a ton there - Dallas is a great burger town. This was my first in SF and it pains my right-leaning self to say this trumps all in Dallas. I ate in the dark so couldn't see exactly what was elevating it to these heights, but upon ravaging this sandwich in the course of two city blocks, I inspected the barren box and I do believe I discovered pancetta bits. Cheating? Perhaps, but it's not like there weren't two buns and a beef patty in there too. Young Darryl couldn't imagine saying it, but, at $8 this was a bargain.", "stars": "5.0"}], "average_rating": "4.0", "latest_date": "20140430", "name": "Box Kitchen", "address": "431 Natoma St", "latitude": 37.7811688139033, "latest_score": "84", "num_of_inspections": "3", "ave_score": "83.6666666667", "longitude": -122.406377480554}
{"reviews": [{"date": "2014-11-16", "text": "Love coming here for brunch - they're always playing great music and it's affordable.  The bagel plate is a perfect light meal.  The eggs & hash is delicious and very filling if you've got a big appetite.  On Saturdays, they have fresh donuts in the attached bakery (Pinkie's) and the flavors are different every week. If you miss out on the donuts, the chocolate bread is always a win", "stars": "4.0"}, {"date": "2014-11-13", "text": "Wow. I can't believe I'm writing my first negative review. ", "stars": "2.0"}, {"date": "2014-11-09", "text": "I've been going to Pinky's somewhat regularly (the bakery next door; same owner) and wanted to try Citizen's Band as I was very pleased with the pastries at Pinky's (especially the quiche).  ", "stars": "5.0"}, {"date": "2014-11-07", "text": "Poutine is incredible, fried chicken sandwich is incredible, pastries are incredible, staff is incredible", "stars": "5.0"}, {"date": "2014-10-25", "text": "This review is for lunch/dinner.", "stars": "2.0"}, {"date": "2014-10-25", "text": "Great place to eat...small menu, but what they have is amazing. The cooks are perfect at what they do. Excellent dive!!!!", "stars": "5.0"}, {"date": "2014-10-24", "text": "I'm going to give this place 4 starts because the combination of the food and service is really good for the type of restaurant that this is.  ", "stars": "4.0"}, {"date": "2014-10-18", "text": "The food was pretty good. I got a cheeseburger with fries. My wife got the Mac and cheese, it was also good. We got a few beers and we got out for under $40. Not too bad. ", "stars": "3.0"}, {"date": "2014-10-16", "text": "Burger was fantastic. Perfectly medium rare just like I ordered, and adding the egg made it even juicier. I did not have the problem that some others have reported of cold or overcooked. The bacon was worth the extra cost as well. ", "stars": "5.0"}, {"date": "2014-10-13", "text": "This place definitely has a different vibe to it. Reminds me of an old diner filled with old photographs, old radios and magnets. The kitchen is open which is pretty cool if you enjoy watching that stuff. ", "stars": "3.0"}, {"date": "2014-10-13", "text": "We dined here on a Friday night and enjoyed the food but thought it was nothing special. The fried chicken was a bit dry but otherwise tasty. The poutine was a little bland and would have been much improved by some more seasoning. I didn't try the burger but my friend liked it. The service was good and I liked the ambiance overall.", "stars": "3.0"}, {"date": "2014-10-12", "text": "Cool concept - good music - but food simply didn't deliver. Burger was tasteless and overcooked, bacon was undercooked and not even tasty - and deviled eggs were as average as can be.", "stars": "1.0"}, {"date": "2014-10-10", "text": "I had the most amazing culinary adventure here the other night.  I was hungry and feeling pretty lazy so cooking and walking far to dinner were out of the question.  That was when I discovered that this gem was only a 5 minute walk away from my place.  I made a reservation on OpenTable and upon entering I was immediately seated at the counter.  The menu had a bunch of things that I wanted to try, but I ultimately decided on the burger with an egg on top and the fries.  The burger was of the Kobe variety, was juicy on the inside, had a nice crust on the outside, and was perfectly seasoned to give it a great flavor.  The combination of the burger, bun, cheese, egg, pickles, and mayo were perfect and the fries were a great match.  Before I knew it, I had polished it off and I rarely can polish off an entire plate of fries and burger unless I haven't eaten anything earlier in the day.  ", "stars": "5.0"}, {"date": "2014-10-10", "text": "Well, I really, really wanted to like this place.  I mean, the menu looked really promising. However, the taste is what they failed to deliver. ", "stars": "3.0"}, {"date": "2014-10-10", "text": "Overview...Came here for a bite with friends before heading to a show nearby. We all arrived at 6:30pm per our reservation and was seated quickly. We mentioned to our waitress that we were in a hurry and needed to leave by 7:45-8pm. An hour was sufficient eating/scarfing down food time, right?!? She said of course. Not a problem. ", "stars": "3.0"}, {"date": "2014-10-03", "text": "LOVE this place!!  It had been years since I ate there, but the minute I put some of the yummy mac and cheese in my mouth the tasty memories came back to me.  I can't tell you what we ordered as it was more a case of what we DIDN'T order!!!  My favorites are the mac and cheese...I mean come on it comes with a stack of onion rings!!!  Who wouldn't LOVE that??!!  The fried chicken is moist on the inside and crispy on the outside!  ", "stars": "5.0"}, {"date": "2014-09-28", "text": "This was recommended by friends, and turned out to be everything they praised. The service is quick and friendly, we set by some locals that come every week. The food was amazing and the portions were more than we could eat. Everything was the right temperature and very delicious. Must visit.", "stars": "5.0"}, {"date": "2014-09-28", "text": "Decided to order delivery from citizen's band through caviar, which i instantly regretted. My gf and i ordered the steak dish which costed $28 dollars and the poutine fries which cost $10. When I opened the box it looked like I only got half of a steak that was cut up into 4 pieces and a bunch of corn...NOT what I expected! Did you guys forget the other half or did you just gather up a bunch of left over scraps and just throw in the box because for $28 that's definitely not worth it. The fries was the worst out of the two because there was NO GRAVY on my poutine. The gravy is pretty much an essential part which makes it a POUTINE!  If you want to get ripped off then, order from citizens band.", "stars": "1.0"}, {"date": "2014-09-25", "text": "I wanted to try this place, but didn't have time for a sit down dinner. I heard so much about their Mac and cheese and I had to try it. So I called in my order for take out. Let me tell you the Mac and cheese did not disappoint! To top it off it's served with three huge onion rings.  The only knock I would give it, is that it wasn't enough Mac for the price, but I would definitely go back again.", "stars": "4.0"}, {"date": "2014-09-17", "text": "Dive accurately describes it. The food is good but pricey. Chicken is $23. I had the Mac n cheese. Interesting but good. Came with onion rings on top and some really salty ham.  ", "stars": "3.0"}, {"date": "2014-09-12", "text": "Well,  it kind of looked like a divey place, to be honest.  We looked in, and there was no one at the door. No signs saying\" please wait to be seated\" or anything. After a moment, when we were not greeted, shrugging inwardly, we walked in and took a seat at one of the empty tables. The seats were uncomfortable,  the noise level was obnoxiously high, and no, music, I'm afraid I am not down with OPP. After sitting for about 5 minutes, wondering if we were supposed to order burgers and fries from a counter somewhere, a woman approached and said \"excuse me, but do you have a RESERVATION?\"", "stars": "2.0"}, {"date": "2014-09-11", "text": "Good food for after you've been drinking!  We had the poutine (pretty good), steak (ew awful), Mac n cheese with bacon (THE BEST WHEN YOU'RE DRUNK), and cauliflower (REALLG TASTY STUFF).  I don't understand why the steak is so expensive when it's not very good.  But everything else was surprisingly delicious!  Makes me almost want to move to San Francisco haha~~", "stars": "4.0"}, {"date": "2014-09-10", "text": "The website reads \"Fusing white tablecloth caliber food with the comfort ", "stars": "2.0"}, {"date": "2014-09-09", "text": "Was excited to try a new restaurant and enjoy a yummy meal with friends. Unfortunately, the experience at Citizens Band left me disappointed, disgusted and embarrassed for the chefs, especially because I myself am a chef. ", "stars": "1.0"}, {"date": "2014-09-08", "text": "The only reason we came in here for dinner is that we were in the neighborhood and they seem to have pretty good Mac'n'Cheese and burgers according to Yelp reviews. We arrived around 8pm and the restaurant is almost half empty, so we were able to find seats right away. I liked the laid-back atmosphere and their small menu.", "stars": "3.0"}, {"date": "2014-09-08", "text": "Wouldn't go out of my way for it. Not knowing San Francisco, it's not in a neighborhood I would choose to go for ok food.", "stars": "2.0"}, {"date": "2014-09-07", "text": "Delicious!!! Had the watermelon salad, so refreshing. Also had the hamburger and carrot cake. Both to die for!! This place is a must try.", "stars": "5.0"}, {"date": "2014-09-05", "text": "The hostess was pretty spectacularly rude and the food was just okay, for the price. The waitress was nice enough, but she kept interrupting conversation every ten minutes in an effort to turn our table. Meh about sums it up.", "stars": "2.0"}, {"date": "2014-09-03", "text": "I've had my eye on citizen's band ever since I saw that they had a poutine dish with pork belly. Being honest with myself, pretty much anything with pork belly is going to draw my attention. This was no different. So when I was looking through my list of places to try, I settled on this place since it is in the SoMa area and no more than a miles walk away. ", "stars": "3.0"}, {"date": "2014-09-02", "text": "Was excited to try this place after reading the menu and reviews.  So I would say don't eat here on a hot day.  It was hot in SF and we baked while trying to enjoy our dinner.  The ladies that served us were nice and attentive. ", "stars": "3.0"}, {"date": "2014-09-01", "text": "Yummy updated Southern food.  You want to come here with a couple people and share an entree plus a few sides.", "stars": "5.0"}, {"date": "2014-08-30", "text": "Comfort food for sure!  Started with the caramelized cauliflower which was simply done to perfection.  Enjoyed the Kobe burger with clue cheese and it was to die for!  Great atmosphere and service, and enjoyed having the open kitchen!  Would definitely recommend and come again!", "stars": "5.0"}, {"date": "2014-08-29", "text": "Had a very nice lunch here last week and I suspect that it will become one of my lunch spot go-tos. ", "stars": "5.0"}, {"date": "2014-08-29", "text": "Holy cow this is good stuff. Came here for lunch today and left about five pounds heavier and in desperate need for a food coma nap. ", "stars": "5.0"}, {"date": "2014-08-27", "text": "Overpriced and Just Average", "stars": "3.0"}, {"date": "2014-08-25", "text": "Get the poutine!  Well, everything's great here.  But the poutine is the best I've had, including the places in Vancouver that are supposed to be renowned for it.  Just make sure you exercise a lot afterwards.  Make that beforehand too.", "stars": "5.0"}, {"date": "2014-08-25", "text": "I personally like it when restaurants have short menus, much like Citizen's Band does. This is because I'm indecisive, but also because I think that the shorter the list, the better and more specialized the food. Eh, my theory could be wrong. ", "stars": "4.0"}, {"date": "2014-08-25", "text": "Cool and laid back cafe. I really liked the hipster feeling of the place and definitely not over-pretentious. ", "stars": "3.0"}, {"date": "2014-08-24", "text": "I went for dinner on a Friday night. Great, because there was no line, no wait at all, but it was underwhelming. I love the space and the food was delicious, although it was a bit expensive for what we were getting (the veggie entree - delicious - but didn't feel worth the nearly 20 bucks.   ", "stars": "3.0"}, {"date": "2014-08-23", "text": "Great comfort food, nice and attentive staff and such a cute place. Glad I just moved to the neighborhood. I willl be coming here often.", "stars": "4.0"}], "average_rating": "4.0", "latest_date": "20141022", "name": "Citizen’s Band", "address": "1198 Folsom St", "latitude": 37.7750205, "latest_score": "84", "num_of_inspections": "3", "ave_score": "89.3333333333", "longitude": -122.410091}
{"reviews": [{"date": "2014-11-14", "text": "no not good compared to crepes in Japantown in my opinion.  but that can be because I am an Asian lol.  the crepe part is too thick.  content is too plain.", "stars": "3.0"}, {"date": "2014-11-07", "text": "Well, you would think you can't go wrong with a banana-nutella crepe. ", "stars": "3.0"}, {"date": "2014-11-04", "text": "LOVE this place - its a curse that I live around the corner.", "stars": "5.0"}, {"date": "2014-10-31", "text": "Not phenomenal crepes but great late night spot when you're hungry.  They have dessert and savory crepes and a pretty extensive menu.  I think the nutella fruit crepes are the best.  Will definitely go back cause it's a chill spot.", "stars": "4.0"}, {"date": "2014-10-25", "text": "Across the street from Bootie. Tasty savory and sweet crepes. What more do you need to know?", "stars": "4.0"}, {"date": "2014-10-22", "text": "Fantastic staff and great savory crepes.  Will definitely go back", "stars": "5.0"}, {"date": "2014-10-20", "text": "I wouldn't call the crepes here, \"crepes\".  Crepes are supposed to be paper thin, but the \"crepes\" here are more like thin pancakes. ", "stars": "2.0"}, {"date": "2014-10-05", "text": "I think the cause of Crepes A Go Go's high rating is the fact that it's located down the street from a lot of bars. In other words, it's drunk food, and drunks like anything... unless they're angry drunks. Heck, a drunk guy even complimented my Ninja Turtle t-shirt. Well, now that I think about it, that drunk at least did have good taste.", "stars": "3.0"}, {"date": "2014-09-18", "text": "For the price, time of day and level of happiness it provided, I will give it a 4 star! ", "stars": "4.0"}, {"date": "2014-09-12", "text": "Gotta becareful here. They think you're drunk and will over charge you. They'll nickel and dime you without you knowing.  They'll even do it on the tax.  When questioned,  the owner said the tax rate is 9.75%, when in fact is 8.75%. I bet they don't even pay the tax they collect to the gov't. Shady.  Just be sure to calculate everything yourself and be very specific about what you order.", "stars": "2.0"}, {"date": "2014-09-01", "text": "Heard the craze over crepes a go go many times before, but finally got to try it last Saturday.. totally lives up to the hype, it was delicious!!", "stars": "5.0"}, {"date": "2014-08-11", "text": "Absolutely stunning crepes:) The best I have had so far. I would recommend the Nutella and kiwi :)", "stars": "5.0"}, {"date": "2014-07-26", "text": "Hungry in the middle of the night? Go here! Sweet and savory crepes at your rescue!", "stars": "5.0"}, {"date": "2014-07-11", "text": "Funny guys with good customer service. Always enjoy my crepe no matter which one I choose.", "stars": "4.0"}, {"date": "2014-07-06", "text": "GREAT late night eats after a night out. Anything you order is good (because I had a bite of all of my friends' food) but I really enjoyed my own crepe (the grilled chicken sauteed in onions, garlic, and peppers). My friend ordered a savory crepe and also a sweet crepe and was double fisting his food the whole time. He told me that I needed to order two, which I thought was excessive, but good thing I listened to him. My chicken crepe wasn't enough. I was hooked and needed more! So I got the nutella strawberry and raspberry crepe topped with whip cream. Mmm!", "stars": "5.0"}, {"date": "2014-07-01", "text": "Pretty good crepes.  I like that this place is open super late in a city that tends to close rather early.   I liked that they let me go off menu on my crepe contents.", "stars": "4.0"}, {"date": "2014-06-30", "text": "This place gets 4 stars instead of 5 because the new guys just lack the old owners' enthusiasm and friendliness. ", "stars": "4.0"}, {"date": "2014-06-06", "text": "This place was SO satisfying after a long night of drinking next door. We walked out of the bar and I wished I could have gotten street meat (Seattle staple). Not something you find on the streets of SF, but crepes worked! You can't be picky when drunk and hungry.", "stars": "3.0"}, {"date": "2014-06-05", "text": "Ok.  The one on Polk is much better.  These guys act like they hate their jobs.  Also, located in a food truck in a dicey area.  You feel as though your'e going to get mugged...", "stars": "2.0"}, {"date": "2014-05-20", "text": "Perfect late night joint...smack in the middle of all the clubs and bars. They must make a killing in profits.", "stars": "5.0"}, {"date": "2014-05-18", "text": "If you're looking for a fast, sweet snack while at the pier this is the place for you. They make pretty decent crepes and fairly quickly too.", "stars": "3.0"}, {"date": "2014-04-02", "text": "In this desolate part of town, there's not much open after 11pm. So where to go? Crepes A Go Go on a mid week show it's pretty light. I can only imagine if Friday and Sat night prime time drunko time is like. Got a solid smoked turkey and cheese. Tried a friend's nutella sweet crepe too. Straight up unfussy handheld foods for your late night munching", "stars": "4.0"}, {"date": "2014-03-23", "text": "How is it that all these years of partying in SF and this is the first time we saw this place?! ", "stars": "4.0"}, {"date": "2014-03-12", "text": "What an ideal after-hours/post drinking spot conveniently located a street from my bldg. Although, I am rarely a fan of late night eats that involve a carb overload..my friends had to eat and so they ended up trying it and I had a little and it was all pretty good for that late hour!", "stars": "4.0"}, {"date": "2014-03-03", "text": "This is a great crepe place to visit for a late night snack in SoMa. The sweet crepe with butter and sugar is superb and just like crepes in France. ", "stars": "5.0"}, {"date": "2014-03-02", "text": "jesus tits...just like any vice can be met in this town granted one has the means.  this place next to butter is proof any food item you crave, reminisce or can think up is also made available", "stars": "3.0"}, {"date": "2014-02-06", "text": "After working an event at the nearby DNA Lounge I was feeling peckish and wanted to get something sweet before heading home. Hidden away on 11th St next to Butter was the crepe truck. $2.50 for a simple sugar and butter and crepe sure hit the spot. Since the crepes seemed to be made ahead of time (there was a visible stack of them) they only had to put together the toppings and off we go. ", "stars": "4.0"}, {"date": "2014-01-22", "text": "Our friends brought us here for a midnight snack. Didn't know what to expect since I didn't realize they were taking us to a food truck. One friend suggested the Crepes Ooh la la with cheese, beef, green onions, green olives, jalapeños, sour cream, and Italian parsley for $9. Seemed a bit steep price wise, but it was so good. I was full, but since it was so tasty, I actually ate half of the order. It was a bit spicy for my husband, but I would definitely get it again. Maybe I'll try the more affordable item next time, the cheese, beef, grilled jalapeños and onions for $7.50.", "stars": "4.0"}, {"date": "2014-01-18", "text": "Nutella Banana crepe is awesome", "stars": "5.0"}, {"date": "2013-12-17", "text": "Something must have changed. This time I didn't get a fresh crepe like they did before and got a pre-cooked one that was reheated. So many crepe options that they are priced weird. A Nutella strawberry banana crepe is $0.50 more than just a Nutella strawberry crepe with a banana add-on.  If you ask to do the add-on they just charge you for the expensive one. I guess when your drunk no one catches that.", "stars": "2.0"}, {"date": "2013-11-11", "text": "Unbelievably good crepes, the best I've ever had. Service is friendly and fast, and prices are good. ", "stars": "5.0"}, {"date": "2013-11-07", "text": "Well, this is a great late night truck that stays open until 4Am. It has been identified as one of San Francisco's landmarks. Great and quick service, staff always clean and prompt. I admire the owner for his personality and exceptional customer service, one of the characteristics of successful businessman. Keep up the good work.", "stars": "5.0"}, {"date": "2013-10-14", "text": "It was Friday night and I was planning on staying in. I was tired and sore from the gym, but my friends decide to kidnap me and make me fat. First stop was Arang, then it was Kowloon Tong, a round of pool at Family's and then Crepes A Go Go.", "stars": "5.0"}, {"date": "2013-10-05", "text": "Out of 5 stars I would of given this place a zero. They gave me a triple whammy. I was over charged, food poisoned, and received unfriendly service. Whatever you do... Do not order anything with mushrooms they are tainted. I'm still feeling the side effects and it's horrible.", "stars": "1.0"}, {"date": "2013-09-23", "text": "yumm!", "stars": "5.0"}, {"date": "2013-09-21", "text": "BOMB DIGGITY Crepes in a sketchy part of town.", "stars": "4.0"}, {"date": "2013-09-07", "text": "MMM this is a trailer in soma that has a whole tons of crepes. They're open so late! I run club nights at a venue a couple buildings away, and this is perfect for a snack at 3am.  The crepes themselves aren't heavy like some are here in SF, and i was totally sober. They are easy to eat by hand before, after or during one of the nearby clubs, and a healthier and yummier option than getting greasy pizza. Cash only, but there's an atm at the convenience store nearby. There's also a little outdoor seating, and the people who run it are friendly. I really liked the ricotta applesauce crepe.", "stars": "4.0"}, {"date": "2013-09-06", "text": "AWESOME crepes! I've had three here and they've all been incredible both in flavor combination and in portion! I guess my only qualm with this place is that if you show up after 1.30AM, the prices are doubled. So if you're out for a heavy night of drunken debauchery and are craving that crepe afterwards, be sure to drunkenly stumble on over before 1:30... Mind you, there's also a sizable crowd...", "stars": "4.0"}, {"date": "2013-08-06", "text": "This place is be!", "stars": "5.0"}, {"date": "2013-07-09", "text": "This place is PERFECT after a night of being drunk!  Well this would have to do since there isn't a good mexican food place in the bay.  I love crepes!  I had the nutella with bananas and it was sooo good.  Great late night snack!", "stars": "5.0"}], "average_rating": "4.5", "latest_date": "20140716", "name": "Crepes A Go Go", "address": "350 11th St", "latitude": 37.771076, "latest_score": "96", "num_of_inspections": "3", "ave_score": "86.6666666667", "longitude": -122.413417}
{"reviews": [{"date": "2014-11-21", "text": "Trying to figure out why this place is a 3 Michelin Star restaurant....  The service was amazing, but there are no words to describe the level of disappointment with how bland the food is. I kept hoping I would be WOWed, but ended the meal w a level of guilt for paying close to $450 for subpar, tiny, buttery food. I do not recommend. Entirely wayyyy toooo expensive.!!!!!!!!!!", "stars": "2.0"}, {"date": "2014-11-18", "text": "I'll keep my review concisely focused on our experience, as the food is consistent and highlighted extensively in other reviews. For background, we had the discovery menu for two a few weeks prior to this review.", "stars": "3.0"}, {"date": "2014-11-18", "text": "We've been lucky enough to eat here three times - once at the original location and twice at the new one. To be honest, we both really enjoyed the ambiance at the original location better. The food is still great, although it's not as surprising after the first experience. I wish they had changed things up as a lot of time had passed between the visits. This generally means that we will be unlikely to ever go back unless we hear of a shift in the menu or style, etc.. That said, the food and the inventiveness is impeccable. The staff are fun and friendly, giving Saison a lightness that offsets the seriousness of the very-visible kitchen. Watching the kitchen is still fascinating, and the whole team is (as I recall) wonderfully diverse, which we noticed.", "stars": "4.0"}, {"date": "2014-11-15", "text": "good food. worth going back.", "stars": "5.0"}, {"date": "2014-11-13", "text": "Factory Dining", "stars": "1.0"}, {"date": "2014-11-07", "text": "From the viewpoint of two avid foodies who have dined in the best restaurants around the world, Saison is a destination unto itself. The discovery menu and the wine pairings blew us away! Impeccable, attentive, yet unintrusive service is definitely something to write home about. Ask for a table opposite the kitchen: watching these masters work was like listening to a perfectly orchestrated and executed symphony! Bottom line, from stem- and tableware selections to the restrooms smelling like a flower garden, no detail in this place is overlooked! Simply perfect!  If you can bear the prices, make a point to try this fantastic food temple! Bravo, Chef Josh and team! Congrats on the very well deserved 3 Michellin stars!", "stars": "5.0"}, {"date": "2014-10-25", "text": "The service was amazing. I sat at the bar, which I believe made my experience even better, as I got to watch Samuel make all the cocktails and mocktails. He even creates his own drinks to cater to what taste he thinks you prefer. Definitely get one of those! ", "stars": "5.0"}, {"date": "2014-10-19", "text": "A different kind of degustation... flavors are clean and light that you will not feel bloated after the meal.", "stars": "5.0"}, {"date": "2014-10-08", "text": "A serious focus on food. ", "stars": "4.0"}, {"date": "2014-10-06", "text": "For our 7th year anniversary we decided to splurge,", "stars": "5.0"}, {"date": "2014-09-26", "text": "I had their tasting menu and my dining companion as well but with wine pairing. And we were seated at the bar. I could not even remember how many courses it was.  Food kept coming! Food was inventive and thoughtful as I would expect. And I appreciated that each course was presented by someone who actually cook in the kitchen.  When the bill was settled, they brought my car key with the receipt.  It was nice touch!  The bill was about $1000 including the tip! Ugh. Overall great food, great service, and nice ambiance.  So you know you have to factor the high price in my review... was it worth $1000? Personally I am not sure.  However I am positive that you will impress any dining companion if you treat her/him here.  :)", "stars": "4.0"}, {"date": "2014-09-18", "text": "We are here celebrating my husband bday today. Everything is perfect, food, service and environment. However one thing is really disturbing. The cute chef keep licking the spoon after he placed food into the bowl. Everytime he lick it he will wipe it with the towel he has..... Is that really disgusting?!?!? It doesn't happen once it happens everytime he places good. Guess how many germs u get from this cute looking chef!!", "stars": "1.0"}, {"date": "2014-09-10", "text": "This is by far the best restaurant I have been to in San Francisco.", "stars": "5.0"}, {"date": "2014-09-06", "text": "Wonderful dining experience.....Saison is a very warm and inviting space, with all staff members working in concert to make sure we felt welcome, special, and completely invited to enter there culinary world. We went on a wine night, so there were less dishes and more wine tastings, but some food highlights included a smoked trout in a warm broth, their \"fire in the sky\" slow-roasted beet, and bites of fire-roasted lamb. Although extremely expensive, I would actually go again some time.", "stars": "4.0"}, {"date": "2014-09-06", "text": "My second time eating there and was surprised that another table next to ours got a different version of a dish with a really NICE piece of UNI on it. I asked why, and was brushed off as something \"Chef\" decides. If \"Chef\" decides, you might want to inquire with the CHEF to put you on the good list so you get the better ingredients/dishes. Since the menu has only one option (no upgrades) just left us feeling confused why this other table got better ingredients then us.  ", "stars": "4.0"}, {"date": "2014-09-02", "text": "Came here for my birthday and I was very delighted with the whole experience. I made reservations a few weeks in advance and even then the only dinner reservation they had available was 5.30 pm but since I wanted to go here on my birthday, I took it. The waitress told me that our table had a view, and I wondered what view she was talking about given the location. Once there, I found out what the view was; the kitchen! We were seated right across from the kitchen where the magic happens, I could look at those chefs meticulously cooking and plating all night long. We had a corner table and the pillows just make you feel at home!", "stars": "5.0"}, {"date": "2014-08-28", "text": "This update is just for the bar.", "stars": "4.0"}, {"date": "2014-08-22", "text": "I had to save my 2500th review because I wanted to make it something special.", "stars": "5.0"}, {"date": "2014-07-30", "text": "Was it worth it? If you like metro men in suits coming out explaining every single dish. Haha. This was a bit entertaining. On a serious note, it was nice the chefs (sous, pastry, etc, but not Skenes himself) came out to present each dish. The bill was over $3k for a party of 5. I didn't even do the wine pairings due to my current condition.", "stars": "3.0"}, {"date": "2014-07-29", "text": "The parade of spoons!! ", "stars": "5.0"}, {"date": "2014-07-24", "text": "Exceptional food and service. Have showned their placement in the world ranking. Food was very well prepared very detailed. Plating equipment was very delicate. Will hope to see them climb up more!", "stars": "5.0"}, {"date": "2014-07-16", "text": "Mind blowing. The best Michelin star restaurant I have been to by far. ", "stars": "5.0"}, {"date": "2014-07-01", "text": "These people are doing some of the most meticulous and interesting food anywhere, and they seem to be able to charge for it.  It's kind of a weird combination of casual and exceptionally fancy, though.  Perhaps it's a conflict between customer expectations given the price and a desire for a more casual experience on the part of the restaurant.", "stars": "4.0"}, {"date": "2014-06-29", "text": "We has the 21 course tasting menu and it was a great experience. We are world travelers and foodies and give it 9.5 yo. 9.8 out of 10   This is one of the top 10 places we dined at.  Most dishes were close to a wow with 2-3 wow dishes. The uni with avocado and the ribeye were clear wows. Only suggestion was they should give petty-fords at the end. To me anyone giving this a negative review is not a foodie and or does not have the money to fine at fine dining    This just a tad shy of French laundry and similar to places like Altiere-creme. I would go back", "stars": "5.0"}, {"date": "2014-06-24", "text": "With Saison's new digs came an exorbitant new price tag: a $248/person menu with no booze. Pre-tax. Pre-tip. And, that's the cheapest menu.", "stars": "5.0"}, {"date": "2014-06-21", "text": "Items Enjoyed:", "stars": "5.0"}, {"date": "2014-06-20", "text": "Food - Epic", "stars": "5.0"}, {"date": "2014-06-20", "text": "Food : 3.8 stars", "stars": "3.0"}, {"date": "2014-06-17", "text": "Took the bf here for his birthday and this is the best restaurant in SF.  I dare you to find better :)   Saison for SF is like how EMP is for NYC.", "stars": "5.0"}, {"date": "2014-06-15", "text": "Exorbitantly expensive for one of the most disappointing Michelin star meals I've ever had. ", "stars": "2.0"}, {"date": "2014-06-04", "text": "Be prepared to be a balla here just like at Benu.", "stars": "5.0"}, {"date": "2014-06-02", "text": "Well...I've been here 4-5 times, the first of which was when they rented out the kitchen at their old location a couple of times a week and had a few seatings every week based on when they rented it out. I must say that I miss that experience (and price).", "stars": "4.0"}, {"date": "2014-06-01", "text": "If you do not love fish, chances are you won't love Saison.  Luckily, we love fish.  On the regular tasting menu ($248.) out of 13 courses, 6 were fish (1 raw, 4 cooked, 1 caviar), 2 vegetables, 1 pigeon.  There was one I just can't remember other than it was a savory course with chocolate (very little) and foam on top.  It was some kind of whipped liver.  Very rich.  We really enjoyed it!  LOL", "stars": "4.0"}, {"date": "2014-05-28", "text": "Oh how I wanted to love you, Saison. My date and I were really looking forward to the 20 course tasting menu and accompanying beverage pairings. Yet, here is where I struggle...", "stars": "2.0"}, {"date": "2014-05-26", "text": "Splendid food and elegant presentations with a positive note on the service, too.  I've eaten, and actually enjoyed, certain edibles here that I had never had wanted to try.  It's that yummy.", "stars": "5.0"}, {"date": "2014-05-19", "text": "Went here to celebrate a birthday.  They split the menu into two prices, one for $248 and another \"discovery tasting\" for $398.  We opted for the $248 meal.  We got a bottle of wine for the table.  After everything was said and done, the total came out to around $350 per person.", "stars": "5.0"}, {"date": "2014-05-18", "text": "3-4 stars for the food, 2-3 stars for the service (I've been sitting on this review for over a year now, so things could have changed drastically by now..).", "stars": "3.0"}, {"date": "2014-05-15", "text": "Speechless ...both the food and the service! Me and my mom went with the tasting menu, fantastic! the fish was fresh and tasty ...carefully prepared(eye witnessed, our table were facing the kitchen), the chef actually brought the food to us, extra points! and we were so lucky, the chef wrote down several restaurant recommendations in Chicago(special thanks to our awesome Maitre D'- Matthew who asked chef the favor) ...yes, we gonna try all of them! and cup of buckwheat tea and small treats before you checkout ...and a bag of small treats before you leave ...I mean, it was an awesome experience regardless of the price ...we felt very welcomed, cozy and comfortable from the beginning to the end ...Definitely coming back =D", "stars": "5.0"}, {"date": "2014-05-05", "text": "Absolutely one of the best in SF!", "stars": "5.0"}, {"date": "2014-04-22", "text": "Best meal of my life, go for the Discovery Menu! Expensive, but worth every penny. The cost for the most part is going straight into the ingredients/preparation. ", "stars": "5.0"}], "average_rating": "4.5", "latest_date": "20140225", "name": "Saison", "address": "178 Townsend St", "latitude": 37.7795269, "latest_score": "96", "num_of_inspections": "2", "ave_score": "98.0", "longitude": -122.3922908}
{"reviews": [{"date": "2014-11-18", "text": "I made reservations through yelp/open table for me and my +1. When I checked the confirmation email right before leaving, the wrong day was listed! I called Zero Zero and the lady at the front desk who I spoke to was SO nice- she accommodated us for that night! I was really impressed with their customer service- definitely added a star to my review for that gesture :) Shout out to the really nice host!", "stars": "5.0"}, {"date": "2014-11-17", "text": "i was invited to a dinner at this place. Their food was fantastic, service was awsome but what i like the most is the ambiance of this place. Not too causal but not too formal. I like their pizza the most, especially the pizza with clam, it is quite unique.", "stars": "5.0"}, {"date": "2014-11-16", "text": "I'am an out of town food enthusiast. Pizza is a favorite in my family. I split a Margherita pizza with my wife and it was amazing. Crust was nice and done while the cheese melted away. ", "stars": "4.0"}, {"date": "2014-11-16", "text": "Went here for brunch today and was so happy I did. The decor is excellent, the first thing you notice is the gorgeous bar display and the second floor seating. My friend and I were seated at a high top in the bar area and found it to be a great location for two friends that wanted to talk our way through lunch :)", "stars": "4.0"}, {"date": "2014-11-15", "text": "Oddly enough, this restaurant doesn't strike me as \"trendy\" or \"swanky,\" despite my expectations from previous  reviews. It's... dark, has a bar tended by bearded men, and has thumping music with a beat that makes it hard to chew, but it still feels more like an upscale Pizzeria Uno (and I don't mean that as an insult!) It's not a trendy crowd, either - lots of families and FiDi folks coming for drinks after work. Sigh of relief. ", "stars": "3.0"}, {"date": "2014-11-12", "text": "Went during the afternoon and only got to order a very basic pizza, but it tasted amazing. ", "stars": "5.0"}, {"date": "2014-11-12", "text": "Great customer service on the phone. Went to pick up my order. Bartender had no idea about the order and no server in the front. After getting my order pizza was cold a lacking in flavor. Along with pizza being personal size thinking it would be 10 dollars each. Order was 40 for two personal pizza. Never again!", "stars": "2.0"}, {"date": "2014-11-10", "text": "Pizza is so personal. I mean, there's different styles, textures, thickness, flavors, and temperatures to eat it at.", "stars": "3.0"}, {"date": "2014-11-09", "text": "Headline: caused food poisoning and flagship pizza was meh", "stars": "1.0"}, {"date": "2014-11-06", "text": "Very very good pasta.  The duck rigatoni is lovely. Unfortunately the service we had left lots and lots to be desired.  5 stars if it weren't for the waiter.", "stars": "4.0"}, {"date": "2014-11-06", "text": "After being told how amazing this place is, I'll admit my expectations were probably a little high. ", "stars": "3.0"}, {"date": "2014-11-04", "text": "Great quality and atmosphere, but can find better for the price.", "stars": "3.0"}, {"date": "2014-10-28", "text": "Been coming here for years. My favorite pizza in SF. Try the ceasar salad and ricotta donut dessert!", "stars": "5.0"}, {"date": "2014-10-28", "text": "My roommate and I trekked here all the way from North Beach because due to Fleet Week, it was actually faster to walk the more than two miles to SoMa than take a bus/uber/taxi. -_____-  Needless to say, I think anything would have tasted amazing by that point. That being said, Zero Zero is still pretty good.", "stars": "4.0"}, {"date": "2014-10-27", "text": "Horrible customer service- probably the worst I have ever experienced. Called earlier in the day to confirm corkage and was told $20/bottle. We brought in 4 bottles and had already opened one, when the manager came over and literally acted like a sociopath saying we were only allowed to bring in 2 bottles max and we would not be permitted to open the other 2. I kindly advised him that his staff needs to be better informed because we received contradictory information, to which he said \"I don't care. It is 2 bottles and that is it.\" These were $200+ bottles we had brought in to taste, not some crap from Safeway. We ended up going down the street to Oola where they were happy to open our wines and we repaid them in kind by ordering most everything off the menu. Zero Zero's loss.", "stars": "1.0"}, {"date": "2014-10-27", "text": "I dined at Zero Zero last week with two friends.   We enjoy good food often and all of us were very impressed with the menu, flavors, service and ambiance.    Michael was our server and he was warm and attentive.  We enjoyed the rigatoni with duck, mushroom pizza, kale salad and yellowtail sashimi.   WOW!!!   The cheese is made in-house daily and you can tell.   I cannot wait to return.    Yummy cocktails were coming out from the bar so I'll try those next.", "stars": "5.0"}, {"date": "2014-10-23", "text": "When a pizza place is named after a specific grade of flour, you know it's going to be good. I love the crispy, wood stove, Neapolitan-style pizzas, and this place had plenty of good flavor combinations to try. ", "stars": "4.0"}, {"date": "2014-10-22", "text": "Made a reservation through OpenTable for a Friday night and I'm glad we did because this place was very busy! ", "stars": "4.0"}, {"date": "2014-10-22", "text": "I went last night with a friend and it was both of our first times here. We went around 7 without reservations and although they were busy, we were able to be seated within 15 minutes. Probably because it was a Tuesday night.", "stars": "4.0"}, {"date": "2014-10-22", "text": "My favorite pizza place in the City.  The Margherita Extra is delicious.  The soft-serve with olive oil and sea salt is a must.", "stars": "5.0"}, {"date": "2014-10-21", "text": "I had the roasted corn carbonara pasta which was definitely really really tasty.  Others in my group had pizza and also said that it was really delicious.  We went in for lunch on a saturday afternoon and the place was full but we did not have to wait at all.  I'd go back here again to try the pizza that my friends had.", "stars": "4.0"}, {"date": "2014-10-21", "text": "Great pizzas and sides. Nice wine list. Friendly service.", "stars": "4.0"}, {"date": "2014-10-20", "text": "The food was fresh and the restaurant had a good buzz. The staff was friendly and I will go back again in the not too distant future.", "stars": "4.0"}, {"date": "2014-10-20", "text": "This place is just amaze balls. lol.", "stars": "5.0"}, {"date": "2014-10-19", "text": "I had the chance to come here the other day since I heard so much about this place. I'm a big fan of deep dish pizza, but I also like thin crust pizza as well if it's done right. This place definitely has their pizza on point, even though it's not the best I've had. Here's some highlights from my meal.", "stars": "4.0"}, {"date": "2014-10-19", "text": "We were here early on a Saturday evening and had the opportunity to watch the place fill up and get busy - great atmosphere and great music playing. The chicory salad was particularly good, though perhaps too much dressing on the bottom half of the salad.  The Terroir cocktail was outstanding - St. George gin, basil, and huckleberries... Is come back just for this drink!!", "stars": "5.0"}, {"date": "2014-10-17", "text": "Another year, another birthday dinner!  So glad we opted for a fun place this year, not the staid and more formal atmosphere of some place like Waterbar, where we were last year.  The moment we stepped inside, I liked the place. The decor is modern, but warm and inviting. The high ceiling makes it seem bigger than it is and the seating on the second floor allows for more diners.  The large half moon booths are perfect for bigger parties.", "stars": "4.0"}, {"date": "2014-10-16", "text": "A very well-known pizza joint in SOMA and SF in general, expectations were pretty high when I finally made my way out here.", "stars": "2.0"}, {"date": "2014-10-16", "text": "I have been there for dinner probably about 6 or 7 times by now. ", "stars": "4.0"}, {"date": "2014-10-11", "text": "If you like flavorful italian, you'll like Zero Zero. ", "stars": "4.0"}, {"date": "2014-10-05", "text": "While scoping for a dinner location within walking distance of the convention center, we happened upon Zero Zero and decided to try our luck. It was packed on a week night and since we didn't have reservations, we had a short wait.", "stars": "4.0"}, {"date": "2014-10-05", "text": "Came here last night and sat at the bar. Amazing drinks- get the upstairs neighbor if you're a bourbon lover like myself. The arancini and pork belly appetizers were absolutely delicious as well! I'll definitely be back for more.", "stars": "5.0"}, {"date": "2014-10-05", "text": "I must say, SOMA is turning into such a trendy place.  Granted it still feels a bit shady walking around at night, but there are some excellent bars and restaurants.  Zero Zero fits in as a great Italian restaurant (mostly pizza and pasta).  It has a low-lit, warm ambience that's great for a night out with friends.  Their bar is good to, with a big screen TV for watching sports.  Most importantly, the food was excellent.", "stars": "4.0"}, {"date": "2014-10-04", "text": "Solid 4-Stars. ", "stars": "4.0"}, {"date": "2014-10-01", "text": "Excellent pizza, delicious drinks and a fun atmosphere.   I would have given Zero Zero five stars if it weren't for the miscommunication with the hostess.   We did not have a reservation, but we put our names down and were told there would be a 45-minute wait and were advised to hang out at the bar.   We ordered drinks and an appetizer (to hold us over) and after an hour, we approached the hostess to check in on when we would be seated.  She said that since she saw us eating, she assumed we no longer needed a table.   We were able to be seated, but still at the bar and not in an ideal location.  Oh well - I would still recommend this restaurant.", "stars": "4.0"}, {"date": "2014-10-01", "text": "Yummy pizzas, they're a little bigger than individual pizza so can be shared. And all the appetizers are good too. The place itself is bit loud but lovely laid out and staff is friendly.", "stars": "5.0"}, {"date": "2014-10-01", "text": "Duck Rigatoni - Delicious.", "stars": "4.0"}, {"date": "2014-09-30", "text": "Delicious pizza, great appetizers and decent wine selections! Definitely a fan, just a bit loud and cramped.", "stars": "4.0"}, {"date": "2014-09-29", "text": "Zero Zero is popularly known as a pizza joint, but I come here for their awesome pasta! They have some of the most interesting and delicious dishes on their seasonal menus that I absolutely adore. The rigatoni with tender duck is a winner and the gnocchi with bay shrimp, sweet corn, peppers, uni butter, and crunchy breadcrumbs is out of this world! The gnocchi is pan fried and not pasty like other places and the whole dish has harmonious flavors and textures that are just perfect together. My only complaint was that I wished there was more...it's my favorite! ", "stars": "4.0"}, {"date": "2014-09-29", "text": "I was walking around this around looking for a place to grab such delicious drinks and sit down for a bit before heading out of town and we found this place. It was surprisingly awesome. The place has an industrial-loft but comfy feel. All the reviews are pretty accurate. The staff was very attentive and friendly.  My bartender was part of the reason my review is 5 instead of 4 stars. He was so helpful and I loved hearing him share his knowledge on the area. I wish I could remember his name...I know it was D- something. If you get the chance to sit at the bar I would highly recommend him. He will make your drinks quick and strong with an added touch of personality. (Just how I like em'.) Can't wait to try this spot again for some weekly specials.", "stars": "5.0"}], "average_rating": "4.0", "latest_date": "20140616", "name": "Zero Zero", "address": "826 Folsom St", "latitude": 37.781636, "latest_score": "90", "num_of_inspections": "3", "ave_score": "89.0", "longitude": -122.402048}
{"reviews": [{"date": "2014-11-22", "text": "Their taco Tuesdays are deliciously cheap! Completely worth it.", "stars": "5.0"}, {"date": "2014-11-19", "text": "Such a fun brunch spot! The lounge seating creates a really cozy and relaxing environment. The decor is eclectic but fun and overall falls into their lat american theme. ", "stars": "5.0"}, {"date": "2014-11-19", "text": "This is a great find in SF! Cozy/relaxed atmosphere, great food, great drinks and friendly service!", "stars": "5.0"}, {"date": "2014-11-16", "text": "Great joint for a date or night out with friends. Super friendly staff and solid food.", "stars": "4.0"}, {"date": "2014-11-14", "text": "Definitely a good find! Cool decor.", "stars": "5.0"}, {"date": "2014-11-12", "text": "Azucar was packed due to an event this evening, but I still really enjoyed the drinks, food, and comfortable atmosphere. ", "stars": "4.0"}, {"date": "2014-11-12", "text": "Azucar is a great cantina/bar in my area of SOMA! I went here when I first moved to the area for cocktails with my roommate. The staff were all so friendly and welcoming, we did not get to try the food but I plan to go back for the taco tuesday!!", "stars": "4.0"}, {"date": "2014-11-09", "text": "This little gem is amazing! The ambiance is perfect with great music and comfortable seating. The service was great and so was the happy hour. The happy hour food was so delicious! You must order everything on the happy hour menu. You won't regret It!", "stars": "5.0"}, {"date": "2014-11-09", "text": "I had the best time here , I was there midday , only a couple people at the bar  after lunch,  but loved the place, the decor  was a combination,  Mexican Dia de Los Muertos  and folk art, junk store finds like an old TV in wood cabinet, and  Scandanavian  seating areas,  the  cook Edgar does delicious Philipino food at lunch  but I would recommend less adventurous eaters  skip the Sisig, it is a Phillipino specialty with a South of Market twist , the gravy was heavenly but the texture of the pork is off putting  to some ( includes the pigs ears as well as pork belly ) try the adobo or pancet,  the  Bloody Mary is made with pineapple juice, tomato juice, vodka and spices garnished with lime and a glas rimmed with  mexican spice, the best.   The staff were friendly and regulars talkative. , if you are wandering around this is an undiscovered unpretentious little place that I imagine would be  convenient  meeting point if  nearby.   Not sure what is in the neighborhood, they were filming a HBO special while I was there so outside was packed with TV trucks, while I was there Edgar was experimenting with different cocktails , they made a lot of their own bitters and syrups . I didn't try the desserts so don't know about that", "stars": "4.0"}, {"date": "2014-10-29", "text": "Taco Tuesday is tacolicious. AYCE for about $10 and you have your choice of either meat or vegetarian. ", "stars": "4.0"}, {"date": "2014-10-28", "text": "Best tacos on Taco Tuesdays!  $10 for all you can eat. Delicious and cheap. Can't get any better than that!  And the staff are fun!", "stars": "5.0"}, {"date": "2014-10-25", "text": "This is a fun place to go for taco Tuesdays! There's an all you can eat taco deal for around $10 and you have your choice of veggie or meat tacos. Their tacos aren't the most authentic, but are still tasty. Their drinks are good and there's also a margarita special on Tuesdays! I came here for a friends birthday and the staff were very fun and friendly and even gave us a round of shots on the house. If coming on a Tuesday, I'd definitely call ahead to make a reservation as the place gets pretty crowded. ", "stars": "4.0"}, {"date": "2014-10-22", "text": "This \"Unlimited Taco Tuesday for $10\" is a classic. They provide good service, and tacos are reasonably good for what you pay. Obviously they make cash with the drinks, which are pretty good as well. Overall a safe bet for a Tuesday evening.", "stars": "4.0"}, {"date": "2014-10-21", "text": "Really cool place to chillax. No tables, just lounge chairs. Just bring a sober state of mind and leave happy with a smile, *hiccups*....", "stars": "5.0"}, {"date": "2014-10-15", "text": "This place is amazing! The food and service was amazing! I love the look of the place too, didn't feel generic at all.", "stars": "5.0"}, {"date": "2014-10-14", "text": "The entire staff was extremely rude. I ordered two tacos and traded one of them for one of my friend's bottomless tacos. Again, I ordered two tacos and are two tacos. I later understood this was against the policy but the way the waitress told us was in a very aggressive manner, accusing us rather than explaining calmly and listening to our reason for sharing. She proceeded to make it a much bigger deal than it needed to be. I understand that we did something 'wrong', but for her AND the manager to talk to us in an extremely rude way tells me they just do not care about giving good service. ", "stars": "1.0"}, {"date": "2014-10-13", "text": "Really enjoyed this place. The drinks were great- It is more of a lounge than a dinner place in my opinion. Their food menu wasn't extensive and if youre a picky eater it will be hard for you since there aren't that many options. All the drinks are good- i had the azucar azul or some drink like that.. it had blue in the name and our waiter was really funn and was really nice to us! ", "stars": "5.0"}, {"date": "2014-10-12", "text": "Nice place to have a margarita with some friends. The food is ok. Nice the app to chose the songs", "stars": "4.0"}, {"date": "2014-10-10", "text": "Let us start with a haiku:", "stars": "5.0"}, {"date": "2014-10-07", "text": "Nice Taco Tuesday deal. Yummy veggies tacos! Felt a bit rushed by the wait staff--- still a good place to try", "stars": "4.0"}, {"date": "2014-10-05", "text": "Super chill spot for cocktails, shots, and tacos before a night out on the town. Wait staff was a little slow helping our large party at times, but didn't mind us walking up to the bar from time to time to add more drinks to our tab. Tacos looked amazing from what was on the table, however the ceviche was only OK and was more of a dip for chips than a dish.", "stars": "4.0"}, {"date": "2014-10-01", "text": "Met up with some coworkers here for happy hour for Taco Tuesday! The service was so great, our waiters were incredibly attentive despite our loud and obnoxious group.  ", "stars": "4.0"}, {"date": "2014-09-29", "text": "We came in at like 6:58pm on a Sunday and their happy hour ends at 7pm. The waiter was nice enough to let us order (0 to 100... Real quick)!! ", "stars": "5.0"}, {"date": "2014-09-21", "text": "Came here for Taco Tuesdays - tacos were OK (hard to please a San Diegan ;)), but you can have an unlimited amount of the carne and/or the veggie for $10 per person. Friendly, attentive service.", "stars": "3.0"}, {"date": "2014-09-15", "text": "Cute loungey space. Wasn't too packed, so easy to find a table on a Thursday evening. We sat at the big communal table. ", "stars": "4.0"}, {"date": "2014-09-15", "text": "great space...the food looked amazing.", "stars": "5.0"}, {"date": "2014-09-13", "text": "I loved this place!! Carnitas tacos are seriously a must try!! Best ever! And the ambiance is very chill :))", "stars": "5.0"}, {"date": "2014-09-10", "text": "\"Azucar\" means \"sugar\" in Spanish (I can't believe I still remember this from high school Spanish..), and that sums up my experience here pretty well! I'd had Azucar Lounge bookmarked for ages, and I finally made the commitment to trek to the city on a Tuesday evening when my visiting SoCal friend mentioned she'd heard about this place's endless taco Tuesdays.", "stars": "4.0"}, {"date": "2014-09-10", "text": "Went here for taco Tuesday with a group of people and had a blast! $10 unlimited tacos and carafes of margaritas. The tacos were pretty good considering they were unlimited, but I'm not sure if I got my money's worth. I could eat barely 4 tacos which is usually cheaper than $10 at most places, but the concept was cool! We ordered carafes of margaritas for the table - pretty good and a good deal for your money. ", "stars": "4.0"}, {"date": "2014-09-08", "text": "I was a bit worried when walking around the neighborhood, but when I walked into Azucar, I was like wow, cool place! This place is hip, decently fancy, and overall really \"chill.\" ", "stars": "4.0"}, {"date": "2014-08-28", "text": "sweet hangout, but the food is not good.", "stars": "3.0"}, {"date": "2014-08-26", "text": "Way fun place to hang out with friends, take a date for dinner and drinks.. whatever you wanna do, it's a great place to hang out and have a good time! ", "stars": "5.0"}, {"date": "2014-08-19", "text": "This place is SO GOOD! You definitely get value coming to Taco Tuesday here. They make their tacos fresh *it comes out warm and toasty* and the tacos go well with their $4 margaritas. ", "stars": "5.0"}, {"date": "2014-08-19", "text": "My friend and I were pointing out how random this place is with its Mexican theme, a sewing machine on one of the tables, an old school TV, and blasting 90s music haha.", "stars": "5.0"}, {"date": "2014-08-15", "text": "Came here after work with some coworkers. It's not super close to our office (Embarcadero/Transbay Terminal area) but it was just a quick ride on the 14. It was busy but not as slammed as some of the places we normally go to. We arrived at 6 and I was worried we wouldn't get a table but the manager was very nice and sat us temporarily at a table that was being held for a reservation at 7, and then we moved when another table opened up. ", "stars": "5.0"}, {"date": "2014-08-15", "text": "This little lounge is an oasis on a busy Soma street corner... close to tons of bars and restaurants, but without the chaos that so many bars and restaurants breed. In my opinion, Azucar leaves absolutely nothing to be desired. The drinks are fabulous, the food is great and the atmosphere is just perfect for any occasion... I really can't say enough good things. ", "stars": "5.0"}, {"date": "2014-08-11", "text": "Went for a birthday brunch over the weekend and wound up with probably the worst service I have ever seen.  1. As the waiter was reading our orders back to us, he suddenly remembered the menu had changed and plantains would be replaced with kale (strange substitution and one that we should have been told beforehand).  2. $15 bottomless mimosas gave us each 3 mimosas. 3. We waited 45 minutes to get our food, two people in our group waiting over an hour. 4. Two meals were sent back. 5. One meal was too spicy for anyone to eat (note, we waited an hour for this meal). 6. One late arrival never had his order taken. We were told this was our fault for not telling a bus boy he needed to order. 7. We were told the bacon wasn't undercooked, it was delivered pre cooked and this is what it was white and slimy.  8.  When we asked to speak to a manager, we had to wait 20 minutes because he was also cooking the food.  He was very rude but ultimately comped our meals.", "stars": "1.0"}, {"date": "2014-08-09", "text": "GREAT place. Wonderful drink selection at the bar. The food is awesome, Taco Tuesday is a must!!!", "stars": "5.0"}, {"date": "2014-08-09", "text": "pretty sure the jalapeno beer gave me explosive diarrhea", "stars": "3.0"}, {"date": "2014-08-08", "text": "The company came here for a Taco Tuesday/happy hour. The ambiance is nice, the staff is attentive and the food is great. Unfortunately (for me), the others in the group weren't looking for tacos, apparently every other person had dinner plans. I felt betrayed. :(", "stars": "5.0"}], "average_rating": "4.5", "latest_date": "20140714", "name": "Azucar Lounge", "address": "299 9th St", "latitude": 37.77392, "latest_score": "94", "num_of_inspections": "4", "ave_score": "97.0", "longitude": -122.411618}
{"reviews": [{"date": "2014-11-22", "text": "The wait here is just ridic. Like nothing I've ever seen. We arrived here at around 11am on a Sunday and the line was wrapped around the block. 1.5 long hours later we get seated at a table. I'm not against a little wait, but 1.5 hours for anything, especially breakfast, is just preposterous in my opinion.   ", "stars": "3.0"}, {"date": "2014-11-20", "text": "First time eating here...I took friends from out of town at 10 on a thursday and though completely full we were seated quickly as there was no line at all. ", "stars": "3.0"}, {"date": "2014-11-18", "text": "Doesn't live up to the hype. The line is always ridiculous and the food just isn't that great. It's not bad, but it's nothing special either. Certainly not worth waiting in line for.", "stars": "3.0"}, {"date": "2014-11-17", "text": "Come, come! The Dottie's experience is in full flight here.", "stars": "4.0"}, {"date": "2014-11-16", "text": "Delicious, friendly, and accommodating. Worth the one hour wait. Tip: go solo or with two people and you'll get seated much quicker. Had the vegan hash (off menu), the provolone strata and a piece of the chili-cheddar cornbread. All were fantastic!", "stars": "5.0"}, {"date": "2014-11-16", "text": "Went there around 11AM and the line was wrapped around the building! Neighborhood seems sketchy, had a few homeless ask for money while I was waiting in line. Waited in line for about 30-45 minutes but it was well worth it! Staff was very attentive, coming to our table frequently. Had 2 of \" The Open Roads\" believe it was roughly $15 each. But it came with two eggs, bacon, ham or sausage, home fries, and either 2 pancakes or one french toast split. The french toast was SO GOOD! Looking forward to going back just for the french toast. Asked one of the staff why it was so good and he was very informative about what type of bread they use (I believe he said it was milk based & thicker than regular french toast bread\" Also they asked if we wanted our bacon \"crispy\" or \"chewy\" which I thought was quite interesting. I've never been to a restaurant that asked me how I wanted my bacon, but I saw that as a plus.", "stars": "5.0"}, {"date": "2014-11-15", "text": "I don't usually Yelp, but I couldn't pass up the chance to rave about both food and service. Louise...stellar!", "stars": "5.0"}, {"date": "2014-11-14", "text": "I spent a week in SF, looking for a good breakfast spot each morning. I tried Dottie's on my last morning in town, and I think I saved the best for last. I'll be back every time i'm in town from now on. There was a line out the door to get in not too long after they opened. The atmosphere was warm, the service was excellent, and the food was delicious. I had a 3 egg omelet with the cornbread and jalepeno jelly. My meal mates had french toast and over medium eggs, both with bacon, and both were equally impressed. Before I could drink more than half of my coffee someone was around to fill it up. Our waitress was cheerful and full of personality, which was delightful. ", "stars": "5.0"}, {"date": "2014-11-13", "text": "Best breakfast I've had in America. The frittata special was awesome, especially with a side of pico de gallo. My boyfriends scramble a perfectly soft cooked scramble. Staff were friendly and efficient. What more do you need! Waited about 20 mins for a table at 11am on a Thursday.", "stars": "5.0"}, {"date": "2014-11-13", "text": "Blown away by the frittata, potatoes and jam. Arguably one of best breakfasts I ever had. But that is also like me just walking out of a movie theater after seeing Guardians of the Galaxy - a cool movie and saying it was the best ever, even better than Star Wars. Not true, but good conversation starter.", "stars": "5.0"}, {"date": "2014-11-11", "text": "A friend of mine recently invited me to Sunday brunch at Dottie's True Blue Cafe in San Francisco, and I learned something: if there's a line snaking out the door of a restaurant, and you see that many of the people in the line have brought a book or an iPad to occupy themselves while they wait, then you're very likely in for a treat.   After all, these folks have been through the crazy line before, and found the food so good that they've chosen to spend a sizable chunk of their day in line to savor it once they're finally inside.  This time, they just came more prepared for the line.", "stars": "5.0"}, {"date": "2014-11-10", "text": "Had a party of 6... so 3 couples. And they asked us if we could split in to 2 tables.. 3 and 3. ????? ... after waiting 45 min outside the door.. waited another 45. The guy did reiterate it would be a longer wait since he wanted to sit together. I guess understandable. Pepper jelly is really good. The rest of the food was mediocre. I would say not worth the wait. Should have gone to mama's. But the Waitress was nice.", "stars": "2.0"}, {"date": "2014-11-10", "text": "This place wasn't at all bad, nor was it at all the hype it appears to be on Yelp. I didn't get to try the pastries though which seems to be a huge hit! ", "stars": "3.0"}, {"date": "2014-11-10", "text": "This place is a real gem. Showed up at 7:45 on a Monday(15 mins after doors opened) and it was packed already. Waited less than 20 minutes to be seated and were treated to a truly special breakfast. The kitchen is small (an open kitchen manned by no more than 3 people), but they work fast. Omelette was superb, the toast was among the best I've gad( I know it's toast okay, just trust me) and the pancakes were large and tasty. If you don't mind a short wait early in the morning, this is a spot not to be missed. Will have to return to try all the amazing looking baked goods on offer.", "stars": "5.0"}, {"date": "2014-11-09", "text": "I've wanted to try this hyped up breakfast spot for a very long time. Sad to say I found nothing special about my experience. I found the dishes hearty & plentiful yet in dire need of some real flavor. ", "stars": "3.0"}, {"date": "2014-11-09", "text": "As I told my wife, \"I won't forget about this breakfast\". I don't often say that about breakfast food because I order the same thing all the time. But I decided to switch up my eggs and bacon and order the eggs & hotlinks. #EPIC. *i added a side of bacon ", "stars": "5.0"}, {"date": "2014-11-07", "text": "It's great down home hearty food with no pretense. The wait staff has always been great. The location gives a great street show. When they were on Jones, around the corner from Glide, you got the best entertainment waiting in line. It's like a breakfast show. My mouth waters when I look at the photos and I always want to get on BART and just go and have breakfast. MMMMM. If you are fussy about the street element, don't go. If you love good hearty SF inspired breakfast, GO. Yum. Take cash and make your life easier.", "stars": "5.0"}, {"date": "2014-11-05", "text": "Came here on a Sunday morning for brunch. I ended up waiting for almost an hour in line, but it was worth it. There's a decent selection of pastries, egg dishes, pancakes, and sandwiches, and of which come in big portions. ", "stars": "4.0"}, {"date": "2014-11-05", "text": "All I can say is WOWOWOW! Almost didn't wait in line... 'cause I'm not a line person, at all. But something told us to stay and thank God we did because this place is an oasis in a very borderline neighborhood.  The food is spectacular!  Baked goods, eggs, world class coffees, happy staff! I want to move in to Dottie's! Can't wait to go back! :-)", "stars": "5.0"}, {"date": "2014-11-05", "text": "Dottie's a diamond in the rough. While the neighborhood isn't that great, the food makes up for it. The Portions are huge, and everything I have tried on the menu has been fantastic.", "stars": "5.0"}, {"date": "2014-11-05", "text": "I used to spend the night down the street occasionally and would wake up to the smell of pancakes and bacon cooking at Dottie's. It became my favorite breakfast place and years later it remains as good. ", "stars": "4.0"}, {"date": "2014-11-04", "text": "This place is fantastic. HUGE shout-out to Damon, our waiter who was insanely great! Talk about no B.S., in and out service and he had me laughing at the same time. On top of his excellent service, the food was as good as he promised. Word of advice, do not order the \"Costco\" English muffins and spring for the home-made dill bread. Delish! ", "stars": "5.0"}, {"date": "2014-11-03", "text": "The cons: The line. It's slow moving. They don't take cards, cash only. ", "stars": "5.0"}, {"date": "2014-11-03", "text": "Cheers to a DELISH experience! Damon was Amazing with his recommendations and his hospitality. The cornbread is a MUST  SINGING praises long after lunch!!!", "stars": "4.0"}, {"date": "2014-11-02", "text": "This place is fucking ridiculous. I'm still waiting in line after standing out on 6th St for over an hour smelling piss and feces and having passersby holler at me but I stuck it out because I've heard good things. I am now at the front of the line (where I have been standing for the last 15 minutes) and I am staring at 5 empty tables and yet they are refusing to seat us. If I ever make it to the table and order food before I pass out from hunger, exhaustion, or the toxic fumes of 6th St, I will update and let you know if it was at all worth it.", "stars": "1.0"}, {"date": "2014-11-02", "text": "The omelet was very flavorful this is the best omelet I have ever had to date. The house coffee was deliciously crafted and the thick bread was toasted to perfection. It is a large bounty for such a small price. Thank you for taking pride In your craft. This will be a place that I will return to and tell my friends about. I'm getting hungry again just from posting this", "stars": "5.0"}, {"date": "2014-11-02", "text": "Ok but it's so overhyped it was a little bit of a let down. This time I tried the fried egg sandwich special with prosciutto and avocado and it was just way too salty. I couldn't even finish a quarter of the sandwich.  The husband had the Wild Boar sausage with eggs and he too didn't finish- the sausage was too rich....... ", "stars": "2.0"}, {"date": "2014-10-31", "text": "Like the many other Yelpers who came here, I was left full & satisfied! Be careful what time you come. I waited 25 minutes today for brunch before the Giants parade (which was a quick walk from the diner) ", "stars": "5.0"}, {"date": "2014-10-29", "text": "Pretty good breakfast/brunch joint. The line's usually pretty long,  so even if you go later in the morning, be prepared for around a 25-30 min wait. The smoked salmon omelette I ordered was very solid and the homemade buttermilk dill toast was excellent. Service was good even though they were busy and waitress filled our coffee at least 3 or 4 times.  Prices are relatively high but reasonable for the large portions", "stars": "4.0"}, {"date": "2014-10-28", "text": "Going early a few Sunday's back; awesome service, made to order traditional breakfast with homemade bread. Given that it's in the heart of San Francisco, this one of the best deals on a City breakfast you'll ever find. The lines exist for a reason. Friendly, helpful waitstaff.", "stars": "5.0"}, {"date": "2014-10-27", "text": "We landed in SF, dropped off our stuff, and walked straight over to Dottie's for lunch. Here are my thoughts: ", "stars": "3.0"}, {"date": "2014-10-26", "text": "I was waffling (no pun intended, HAHAHAHA) between 4 and 5 stars for Dottie's but I decided you know, this is the type of place I keep thinking about and wanting to figure out a way to return to, so it's probably a 5 star joint. ", "stars": "5.0"}, {"date": "2014-10-26", "text": "The best gluten-free pancakes around! Rice Flour Banana Raspberry Pancakes - nice and fluffy and perfectly cooked. The Whiskey Fennel Sausage Scramble was delicious. The portions are generous - so go with an appetite. Everything else about Dottie's is fabulous too - from the cool San Francisco vibe, the high ceilings and brick walls, the delicious generous portions and the friendly sassy service. The menu, the atmosphere, the patrons, the servers, the location, the decor - everything came together to create an authentic San Francisco experience.", "stars": "4.0"}, {"date": "2014-10-26", "text": "Well this is supposed to be the best breakfast in San Francisco, at least according to the hotel doorman. He is so right. A bit of a wait to get in but what a breakfast. Started with a maple pecan scone. Very light and you could taste that it's homemade. Tip-sit at the bar as you get a great view of the kitchen staff and you can see they love their job. Very chatty with some of the staff too. ", "stars": "5.0"}, {"date": "2014-10-25", "text": "Came at 8 AM for Saturday brunch. Waited for  50 minutes and every second was worth to wait. I had zuccini cake poached eggs, hubby had the lamb sausage scramble. Both were so delish. Even side potatoes weren't overly grassy like most breakfast places. Muffins and even coffee was quality one.", "stars": "5.0"}, {"date": "2014-10-23", "text": "I don't get the rave reviews. Food was decent but given the lineup and crappy service, I wouldn't come back!", "stars": "2.0"}, {"date": "2014-10-23", "text": "Friday morning in the Mission District.  Not much has changed in the 40+ years since I worked down here. No parking, crazy traffic, dirty sidewalks, turn of the 20th century buildings, and a strange collection of people representing all of life's choices (some not so great). Same old, same old.", "stars": "4.0"}, {"date": "2014-10-23", "text": "A real neat and special breakfast place that's worth a visit.", "stars": "4.0"}, {"date": "2014-10-21", "text": "This place is awesome! ", "stars": "5.0"}, {"date": "2014-10-20", "text": "Nothing but pleasant things to say about the food at Dottie's. We ordered: the special Avocado, tomato, jalapeño, scallions, corn, and feta frittata; black bean cakes and eggs; and 1 banana raspberry rice flour pancake. The frittata came with potatoes and a bread side, we requested corn bread with jalapeño jelly which was an additional dollar. The cornbread and jalapeño jelly was delicious. The cornbread had chunks of jalapeño as did the jelly. It was the perfect balance of sweet and spicy. The banana raspberry pancake was moist, tasting similar to a cake. The black bean cakes were compressed black beans in a small patty with sour cream and pico de gallo on top. The black bean cakes and egg dish was served with eggs, two black bean patties, potatoes, and cornbread with jalapeño jelly. We felt each dish was large enough to share with two people. Once we placed our order the food was served hot and quickly. We gave this restaurant 5 stars. Our only complaint is the location as we walked to and from Dottie's we were approached by many aggressive panhandlers.", "stars": "5.0"}], "average_rating": "4.0", "latest_date": "20140321", "name": "Dottie’s True Blue Cafe", "address": "28 6th St", "latitude": 37.7817050429594, "latest_score": "96", "num_of_inspections": "3", "ave_score": "83.3333333333", "longitude": -122.409839630127}
{"reviews": [{"date": "2014-11-19", "text": "I don't really get the whole chicken and waffles thing. I grew up eating fried chicken from KFC, so it's always been chicken and biscuits for me. Mmmmm KFC biscuits...", "stars": "4.0"}, {"date": "2014-11-14", "text": "I love this place! Already been here twice within a month and I am so addicted to their chicken. ", "stars": "5.0"}, {"date": "2014-11-11", "text": "I came here before a game. The food and atmosphere was great, but then again it was filled with Giants fans so of course the atmosphere was great. It's so laid back here and the folks are super nice! I ordered the Country Benedict and my husband got the Chicken and Waffles. I'm not a chicken and waffles person but I do like the two separately. The chicken was moist and crispy. The waffles were crispy as well. My plate was delicious, the pulled pork came with these yummy pickled tomatoes. My yolks were nice and perfectly runny. The biscuit was really buttery and tasty. We were  happy campers.", "stars": "5.0"}, {"date": "2014-11-11", "text": "***Surprisingly Good Rendition of Chicken and Waffles***", "stars": "4.0"}, {"date": "2014-11-10", "text": "Totally worth it! If you're in the area give it a try.  The skillet sandwich is awesome!", "stars": "4.0"}, {"date": "2014-11-06", "text": "I ordered the Fried Chicken sandwich. It came with chips sprinkled with paprika(?).", "stars": "4.0"}, {"date": "2014-11-05", "text": "Ordered biscuits and gravy. Biscuits were hard and hardly fresh, sausage gravy was thin and runny and didn't even soak into the bisquits, eggs weren't cooked to order unless over easy is broken yolks in fried eggs, and the amount of food for the price was outrageous.  $15 for something they can fit in a 4x4 box, left me hungry for more. Charging sit down prices when there is nowhere to sit unless it's later in the day and the bar is open. This was my first and will be my only time eating at this hole in the wall. I would have given it less than 1 star if possible.", "stars": "1.0"}, {"date": "2014-11-02", "text": "I'm a bit confused why everyone insists on the takeout window here, because the inside seating is spacious and has a rustic polish. Maybe it's takeout only on weekdays? Regardless if you come here for the food or the ambience, Farmerbrown is a solid chicken and waffles restaurant-bar hybrid. I came for a Sunday brunch with two friends and although there was a bit of a wait to order food, there was an abundance of seating.", "stars": "4.0"}, {"date": "2014-11-01", "text": "Food: B", "stars": "4.0"}, {"date": "2014-10-27", "text": "There's a whole lot of hype for this place and it's well warranted for what you get. ", "stars": "5.0"}, {"date": "2014-10-26", "text": "They have a huge indoor seating area and bar!  The chicken is a little bit overpriced", "stars": "3.0"}, {"date": "2014-10-23", "text": "This cute, take out window on Ritch st. teases your nose with scents of fresh waffles and hot fried chicken. It's hard to miss it once you turn into the little alley. SoMa workers loyally line up at lunch to get their fix, so get here early to beat the lunch rush.", "stars": "4.0"}, {"date": "2014-10-19", "text": "Came here to satisfy my fried chicken craving... This place is no Ad Hoc but it will have to do until I go back to Napa. This place is more like a bar that serves food. You go to the counter to order and seating is open. ", "stars": "4.0"}, {"date": "2014-10-18", "text": "Ordered delivery from EAT24. The fried chicken was excellent! Nice light golden brown, not greasy or cooked in old grease, moist and flavorful! I am so psyched to be able to get really great fried chicken in my neighborhood AND I can have it delivered! Oh, and the mac and cheese side was awesome too! Keep these guys in business!", "stars": "5.0"}, {"date": "2014-10-17", "text": "For the record, the sit-down portion of their restaurant opens at NOON, but the street-side ordering opens at 10:30. This was a bit confusing since the lady behind the counter kept telling people that the restaurant would open at 11:45am. ", "stars": "2.0"}, {"date": "2014-10-14", "text": "such classy fried chicken.", "stars": "5.0"}, {"date": "2014-10-12", "text": "I came for the soul food and stayed for much more.  Very relaxing atmosphere! I came mid day Sunday,  the games were on (not too loud) and the food + drinks were just incredible.  It's hardly more expensive but more upscale than a boring sports bar.", "stars": "5.0"}, {"date": "2014-10-09", "text": "The service is incompetent. Be quicker. Not everyone wants to chat. You should be thrilled you have a line but don't keep us waiting.", "stars": "2.0"}, {"date": "2014-10-08", "text": "I often don't review places, but this one was really bad.  Not only did we have to wait over 70 minutes to get our food, when it came it was cold!  I tried to brush it off, but when I received my credit card bill that month, they had charged me twice. Not even on the same day, on two separate days. I only been here once!", "stars": "1.0"}, {"date": "2014-10-06", "text": "Came here for dinner with some friends...I wasn't aware that it is primarily a bar. It is a pretty cool space as a bar to come and hang out with friends/coworkers. You order your food at a small counter/table pretty deep in the restaraunt/bar, and servers bring out the food to you. ", "stars": "3.0"}, {"date": "2014-10-04", "text": "Allegedly, this is the best fried chicken in San Francisco. But does it pass the KFC test, that is, does it actually taste better than the colonel's \"original recipe\"? ", "stars": "4.0"}, {"date": "2014-09-28", "text": "This place is literally a hole in the wall. I'm not a huge fan of chicken & waffles so I got the bacon waffle dog. MMM!! The waffles here are SO fresh, and the bacon wrapped sausage was juicy and flavorful. It's a bit of a challenge to eat, though. Someone told me to eat it like a hot dog, except the dish comes with two waffles (with pickles & sauce on top). I just ate it with a knife and fork. Well whatever you fancy.", "stars": "4.0"}, {"date": "2014-09-28", "text": "I've been touring a lot of the fried chicken restaurants in the city lately, so I decided to give this place a try (having never been to any of the Farmerbrown places before). I arrived shortly after opening, only a few people in the place. I walked up to the counter to order, mentioned to the guy taking orders that I had never been there, and I asked him a question about the menu. He was pretty rude to me. I have no idea why; maybe he thought my questions was stupid or something, but it was just a question about two of the dishes. Anyway, I ended up ordering the breakfast sandwich on a biscuit with boneless fried chicken and eggs over easy. The food came out pretty quickly, but the order was completely wrong: on a waffle instead of a biscuit, eggs cooked well done, and the chicken had a bone in it. They managed to quickly swap the waffle for a biscuit, which in hind-sight was a mistake, because the biscuit was so dense that it felt like I was like eating a wet brick. I thought the goal was to make biscuits light and fluffy. Not this place. It was like a rock. ", "stars": "2.0"}, {"date": "2014-09-27", "text": "Nothing special. The country benedict was bland and the fried chicken tastes like KFC.", "stars": "1.0"}, {"date": "2014-09-26", "text": "Had a serious craving for waffles and FLS is where I decided to satisfy it. The chicken part of the Chicken and Waffles was AMAZING (crispy on the outside and juicy on the inside). Sadly, the waffles were so hard I thought the roof of my mouth was going to bleed (the taste was good, it was the texture that failed me on this one). When I tried to cut the waffle with my fork it was so hard that the waffle flipped up in the air throwing syrup everywhere. ", "stars": "3.0"}, {"date": "2014-09-22", "text": "Sigh. Even though they've disappointed me in the past with the lack of a weekend veggie poboy, their breakfast sandwich on a biscuit has won me back over.", "stars": "4.0"}, {"date": "2014-09-22", "text": "OK. What can I say.  I got really really excited about the menu. French fries with turkey hash and a fried egg?  So many elements of goodness, how could I dislike this. A little underwhelming in the spice department but makes up for it in the presentation department and the whimsical decor - not a fancy place though, feel free to dress down.", "stars": "4.0"}, {"date": "2014-09-21", "text": "Authentic, cool atmosphere + good soul food. I got the burger, and it was perfectly cooked and garnished. Great place to chill out with some friends and get some good food and drinks.", "stars": "5.0"}, {"date": "2014-09-20", "text": "Waffle is good. Chicken a little dry and somewhat flavorless.", "stars": "2.0"}, {"date": "2014-09-17", "text": "I JUST got lunch from little skillet like half an hour ago. I ordered the pulled pork with grits and watermelon lemonade. The pulled pork and grits were so oily omg. I could not even finish my lunch and I can still feel my insides dying a little. The watermelon lemonade however is sooooo gooood! Since it is so close to my work I will probably be back to try other things.", "stars": "3.0"}, {"date": "2014-09-16", "text": "Came in here with my girlfriend.  We were really excited to eat some southern food! Ordered the works which is the chicken and waffles along with the gumbo.", "stars": "2.0"}, {"date": "2014-09-16", "text": "Didn't realize this place was next to Cento, which I visited recently! You order at a window and can sit outside on a loading dock or inside their Southern style very spacious bar. Ordered the two piece chicken with coleslaw and jalapeño corn muffin. The chicken was delicious, but the coleslaw was lacking dressing and the corn muffin was tiny&certainly not spicy. Should have gotten the waffles  and sat outside. It was a gorgeous day out!", "stars": "3.0"}, {"date": "2014-09-15", "text": "I was dogsitting my friend's 2 dogs and needed to pick up some lunch without having to tie up the dogs to a meter in fear that someone will dognap them.  ", "stars": "4.0"}, {"date": "2014-09-15", "text": "Skillet serves up a good fried chicken, juicy tender chicken. The only reason why I've not given 5 stars was because I've had better and the coleslaw tasted like onions on onions. Its in some alley way, but even so there was a line waiting; preorder online if you want to get take out, or else the queue isn't slow, so you'll be alright. If you're going in a hot day, be prepared to see numerous houseflies flocking about the entrance, but I guess its harmless if it isn't going to be on your food.", "stars": "4.0"}, {"date": "2014-09-14", "text": "Their food is pretty good (not great), and they have a good selection of beers, but the service is incredibly slow. We waited 45 minutes for a 2 piece chicken and waffles with a side last time we were there. The person who ordered before us was clearly sick of the wait as well, and we watched him try to get a refund unsuccessfully (which is why we kept waiting) It's also really expensive. I know SF is pricey, but this borders on ridiculous.", "stars": "2.0"}, {"date": "2014-09-13", "text": "I've never felt so cheated in my life. I'm from NC and this was the worse $20 I've spent on food. I'm a fatty cakes I love to eat good food. Don't get the sweet tea, lemonade, shrimp n grits or cupcakes. Thumbs and all hands are down. And there's a frown on my face right now. I want to get a complete REFUND!!!!!!!!!!!!! Such a disappointment. Should of went elsewhere.", "stars": "1.0"}, {"date": "2014-09-13", "text": "Cute brunch place with no crazy brunch line at 10am on a weekend yes! Came here today after my bf was done with his workout at the nearby crossfit gym. ", "stars": "5.0"}, {"date": "2014-09-12", "text": "Sometimes I feel like being a fatty and today was one of those days. I was up early and walked all around downtown, running errands and getting in my 10K steps far before 11AM even hit. I had been wanting to try this place for awhile now since it was so close! It's tucked away, so unless you plan on going here, you'll probably walk right past it.", "stars": "5.0"}, {"date": "2014-09-09", "text": "Food 4/5", "stars": "1.0"}, {"date": "2014-09-09", "text": "If you're looking for chicken and waffles in the city, LOOK NO FURTHER. You will be very, very happy with what you get here. Don't confuse this place with the other Farmerbrown's by Market. If you're meeting friends here, make sure you clarify the address! ", "stars": "4.0"}], "average_rating": "4.0", "latest_date": "20140512", "name": "Farmerbrown’s Little Skillet", "address": "360 Ritch St", "latitude": 37.778873, "latest_score": "92", "num_of_inspections": "1", "ave_score": "92.0", "longitude": -122.393918}
{"reviews": [{"date": "2014-11-21", "text": "Excellent menu selection. I had 2 super tacos for under $8. Both were good and a good portion size. Get here early because the line quickly fills up with people.", "stars": "4.0"}, {"date": "2014-11-21", "text": "My bf and I went here for dinner last night. It was around 9 pm but there were still several people waiting to be seated. Crazy on a Thursday night! I have been here a few times before but my man hasn't so I was excited to bring him here so he can try the food. The first thing he said walking - in was.. \"Baby, it smells good in here\". The hostess said there's a 35 minute wait but we didn't mind. We sat inside as we watch people coming in to the restaurant. People keep coming and it is passed 9:15! We both loved it since it gave him an impression that the food will be good. We got seated after 25 minutes. We started with the Platanos Fritos: Sweet, fried plantains, black beans, Mexican crema. They came up so warm and well cooked. So soft that it melts your mouth. The black beans were cooked so well; it didn't tasted bitter at all. ", "stars": "5.0"}, {"date": "2014-11-21", "text": "Fantastic margaritas, great street tacos, enthusiastic staff, good happy hour deals. Enough said.", "stars": "5.0"}, {"date": "2014-11-21", "text": "This place is great for lunch or dinner depending on what you are looking for.  I go here at least once a month for lunch and get their super burrito which is delicious.  They also have free chips and salsa as well as a salsa bar with a wide assortment to choose from.  Any Mexican restaurant that has a wide variety of salsas I usually find myself happy with.  Their orange sauce is awesome and I definitely recommend it.  ", "stars": "4.0"}, {"date": "2014-11-20", "text": "One of the best Happy Hour deals in the South of Market/ Convention Center area of San Francisco. But you have to hurry because the place fills up as soon as 4pm hits. The quesadillas with chicken or steak and the nachos with chicken or steak are the best deals from 5-8 bucks. You can't go wrong! That alongside with affordable margaritas and well drinks during Happy Hour, plus a buzzy crowd makes Tropisueno your best option before a movie at the Century Theatre or the AMC nearby or a meeting convention center or just hanging out with friends when needing an affordable option. I highly recommend this place, not necessarily remarkable but always affordable.", "stars": "4.0"}, {"date": "2014-11-19", "text": "I've seen so many of my friends ' reviews of this place and passed by it numerous times.  I thought it was more of a traditional restaurant setting because it looked like it was everytime I'd pass by it, plus since they take reservations in the evening.  So, I chose to meet my aunt there for a lunch break.  ", "stars": "3.0"}, {"date": "2014-11-18", "text": "Came here early with a group of work friends. When we arrived we were pretty rudely told that we would need to get up at 7 for a reservation already in place. Completely understand the reservation thing but it was such a turnoff the way they approached the situation. ", "stars": "3.0"}, {"date": "2014-11-17", "text": "i was with my friends in happy hour on thurday and the waiter that  we got  was a little one nasty we ask  him if he could pick up the curtain because we want see out side he said not for a rule of the restaurant after two rounds of drinks we pay the bill and in less that  five minutes this man came and told us we have to leave the  table to other costumer. i think that was very ignorant. ", "stars": "1.0"}, {"date": "2014-11-16", "text": "I have been here a few times now and it is amazing every time. Margaritas are great and the food is even better. They also give you chips and a trio of salsa. This is one of my favorite restaurants.", "stars": "5.0"}, {"date": "2014-11-16", "text": "This place is incredible. My boyfriend and I came here for the first time on Saturday afternoon. The line wasn't too long, and the food was brought to our table in less than 10 minutes. We each got a combination plate with 2 items (they come with rice and beans, too) and holy guacamole the portions are HUGE. Had we known, we wouldn't have ordered so much! It was great, though. There are tons of salsa options. It was a little too chilly to sit outdoors, but the inside tables were still nice. Inexpensive. Margaritas are yummy. 5 stars!", "stars": "5.0"}, {"date": "2014-11-15", "text": "Great service and ambiance but I wasn't 100% happy with my meal here. My mom and I got the guacamole and chips and four soft tacos. The guacamole was delicious and the portion was generous. They also had a great salsa bar with a variety of salsas to choose from. I thought it was nice they included a section in the salsa bar for extra cilantro and radishes. The downside of my experience here however was the tacos. The meat was well seasoned but nothing amazing. The tortilla was really hard and not steamed properly. I'm thinking this isn't a normal thing for them -- I probably caught them at a bad time. Will come back to try again.", "stars": "3.0"}, {"date": "2014-11-15", "text": "Came here for lunch and had the enchilada plate.  I got one steak and one chicken.  Everything had great flavor.  I usually don't eat beans but the refried had a good taste. The rice had a good kick.  In all the whole plate made me appreciate the whole meal more. Lunch is served fast causal style.  You order then get a number to wait for your food to be brought. I think dinner time is more of a sit down affair. The line is long but moves fast. The tables turn over quickly too during lunch. I will be back.", "stars": "4.0"}, {"date": "2014-11-14", "text": "Food is Awesome... worth the wait (there was a long queue when we went.) The salsa bar with atleast 8 - 10 types was my favorite part, and they served fresh chips to go with that. ", "stars": "4.0"}, {"date": "2014-11-12", "text": "The decor is enough to step foot inside the building! It has sort of a Mediterranean feel to it, but almost Havana-like, which I guess would be Casablanca-esque. ", "stars": "3.0"}, {"date": "2014-11-11", "text": "Happy Hour Report:", "stars": "5.0"}, {"date": "2014-11-10", "text": "They use queso on some dishes, without noting it on the menu, so watch out if you're pregnant...", "stars": "4.0"}, {"date": "2014-11-09", "text": "A popular place recommended by lots of different sources including locals.  In town for a conference, and craving good Cali Mexican food (coming from Hawaii).  Service was good and at expectation.  Ambiance was busy and loud, but it was a Saturday dinner at 7:30pm.  Food was uncomplicated, straight forward, and flavorful.  Had the carne asado taco and chicken enchilada combo, friends got the hanger steak dish (forgot the name sorry).  All around very satisfied with our Cali Mexican food fix.  Bonus: it was right out the door from the Marriott Marquis where we stayed.", "stars": "4.0"}, {"date": "2014-11-08", "text": "I've been here many times covering all times of the day from breakfast to lunch to happy hour to dinner! ", "stars": "5.0"}, {"date": "2014-11-07", "text": "Had the most amazing pollo asado tacos there. They were perfectly seasoned and the chicken was so tender. Some of the best chicken tacos I've ever had. Their salsa sampler that comes before the meal was also a nice treat, delicious!", "stars": "5.0"}, {"date": "2014-11-06", "text": "I love this place. Good prices, large portions, authentic fresh food that is so flavorful and cute inside! The flauta was my favorite and made with corn tortilla instead of flour like most places make.", "stars": "5.0"}, {"date": "2014-11-03", "text": "This place was good. Really good. We came here with a group of six for my brother's  bday, and boy oh boy this place delivered. Fantastic ambience, great server who helped my dad and stepmom find more \"American\" Mexican dishes (I.e, quesadillas, lol). But really the food here is fantastic! Loved their guacamole, salsas, habanero mango margarita (the waiter was worried I didn't like it because I had to take breaks to enjoy the spiciness level but it was really tasty). I definitely will be back for a date night with my husband :)", "stars": "4.0"}, {"date": "2014-11-03", "text": "Solid spot for some good tacos for lunch or dinner. Make reservations for groups as it is fairly popular. Chicken mole was yummy!", "stars": "4.0"}, {"date": "2014-11-01", "text": "Last night was my birthday, so my husband decided to take me to dinner anywhere I wanted.  We are new to the east bay, so we asked one of our new friends where a good spot for great Mexican food.  He told us the best place to go was to head into the city and trying Tropisueno.  My google map said it was only 20 minutes away, plus it was still pretty early, so we figured \"why not?!\"", "stars": "5.0"}, {"date": "2014-10-30", "text": "Came for a quick night snack with a couple of friends. I tried the beef tacos and they were amazing. Very tasty. My friends got the different ceviche plates and they were all good. Would get 5 stars but the hostess was a little rude and unwelcoming, so they lose a star for that. Otherwise would come here again most definitely.", "stars": "4.0"}, {"date": "2014-10-30", "text": "Enjoyed our late night meal on a Wednesday after the Giants' World Series Win. The best item is the chicken soup. To die for! And it's huge! Not to mention the rice and pinto beans, just heavenly. ", "stars": "3.0"}, {"date": "2014-10-28", "text": "Dinner for two at 10:45PM after a world series game.  A nice walk from AT+T park (.9 mi) on the way back to Marriot Marquis (Moscone area).", "stars": "4.0"}, {"date": "2014-10-28", "text": "I wasn't expecting much from this restaurant - after all, we're not in the Mission but I'm a fan. It's a beautiful, spacious restaurant that serves HUGE portions at affordable prices. Their salsa's and Margarita's are amazing. Friendly staff too.", "stars": "4.0"}, {"date": "2014-10-26", "text": "We arrived at around 4pm on a Saturday and it was kind of chaotic. It was not clear where to go and who was in charge. Once we figured out that you order at the window we took a seat in the bar (not at the bar). It took sometime to realize that no one was going to take a drink order, so we walked up to the bar to order. The restaurant opens at 5:30pm, and it was then that our table in the bar started to get regular service. Once we figured out how it all worked, we really enjoyed ourselves. The food was very tasty. I would definitely go back.", "stars": "4.0"}, {"date": "2014-10-25", "text": "Best Mexican food. Mole is outstanding. Tortillas are home made. Chips and three kinds of salsa are great.  Chips are thin and after the three requisite bowls I am not stuffed. A gem and you need to come here but reservations are a good idea. Final tip. Try margarita with mango and jalapeño. You'll need at least two. Really.... Go here.", "stars": "5.0"}, {"date": "2014-10-24", "text": "This place is great for workday lunches.  There's always a line, but it moves pretty fast.  The food here is always rich flavorful and delicious.  My favorite is the Tropisueno Torta, which is a sandwich with three kinds of meats on it.  They have bowls of chips and a salsa bar with several varieties.  There is plenty of seating indoors and out.", "stars": "4.0"}, {"date": "2014-10-23", "text": "My boyfriend and I made reservations here while visiting from Philly, in town for the Nike Women's Marathon. We came based on the other reviews and the closeness to our hotel. The décor and ambiance of the place was so great! I loved the lighting and the feel of the place. It didn't feel chainey or like it was trying too hard. I'm a vegan and they had a tofu dish on the menu but I asked the waiter if they could accommodate me by making the enchiladas without cream or cheese and with veggies.. It wasn't an issue and they were delicious. The salsas were tasty and the portions were hefty. My boyfriend enjoyed his meal as well. Our bill was about $30 for the two of us... It was a steal! I wish I could have taken my left overs but our hotel didn't have a fridge! Great eats in San Fran :)", "stars": "4.0"}, {"date": "2014-10-21", "text": "There's not too many medium-high end Mexican places in SF, but this place is pretty solid. I wish they had more veggie items though. I haven't tried any of the meat products there but they sound fantastic. Their ceviches are really good. Service is prompt and with a smile, even when the place is slammed. The drinks are really good too. The salsas that come with the chips are great, I like how there's 3 different kinds of different textures and flavor profiles.", "stars": "4.0"}, {"date": "2014-10-20", "text": "I was brought here recently with some workmates. I am usually skeptical of Mexican food outside of the mission, but my expectations were by far exceeded here. Tropisueño is a beautiful Mexican place that manages to combine affordability, decent ambiance, and very good food. Good rice and beans. Meat is tasty and of good quality.", "stars": "4.0"}, {"date": "2014-10-20", "text": "To sum it up:", "stars": "3.0"}, {"date": "2014-10-19", "text": "Always here at lunch. Great shrimp burritos...guac and tacos.", "stars": "5.0"}, {"date": "2014-10-18", "text": "Portions are plenty and quality is pretty good. I got the chicken quesadilla. I could not finish it myself. They have a salsa bar so go crazy. The waiters who bring your food (you order at the counter) are really hard working and accommodating. Tip them!", "stars": "4.0"}, {"date": "2014-10-16", "text": "Great margaritas!!!!", "stars": "5.0"}, {"date": "2014-10-15", "text": "Always love this place whether it be for lunch, happy hour, or dinner.  I've had the tacos for lunch/happy hour, mango ceviche & enchiladas for dinner.  The spicy mango margarita is amazing, reminds me of those mexican lolly pop candies!", "stars": "5.0"}, {"date": "2014-10-15", "text": "This place is great for happy hour!  Margaritas are $6.50, tacos are $2.50, Fernet shots are $3 (unheard of!).  The portions are very generous and chips and salsa are free!  It's hard these days to find free chips and salsa in the Bay area.  ", "stars": "5.0"}, {"date": "2014-10-15", "text": "Got the pollo asado. Chicken was tender, and the sides on the plate were pretty good. Could've  used more veggies, but I usually think that for everything. ", "stars": "4.0"}], "average_rating": "4.0", "latest_date": "20140324", "name": "Tropisueño", "address": "75 Yerba Buena Ln", "latitude": 37.7854322732258, "latest_score": "89", "num_of_inspections": "5", "ave_score": "90.8", "longitude": -122.403874397278}
{"reviews": [{"date": "2014-11-22", "text": "This place was THEEEEEEEE BEST! Ivan is an amazing bar tender!!!!!!!!!!!!! Great time. And all of the food is so delicious.", "stars": "5.0"}, {"date": "2014-11-20", "text": "This place is awesome. It reminds me of a very special place in my heart: Vegas. Haha have you ever been to a Lavo champagne brunch? Well, if you haven't, this place is pretty similar sans the half naked people in slutty outfits and huge crowd. ", "stars": "4.0"}, {"date": "2014-11-19", "text": "This is probably one of the few bars in the area that is not packed post work on a weekday.  I came in around 6:00pm or so and there were plenty of stools to sit on.  They have a limited amount of tap brews to get and a lot of bottles on site.  Most of them veer towards the Belgian/White Ale sort of thing with a few IPA thrown in.  The food is what I was digging.  I tried the chicken tacos and even though the tortilla was super small, the filling itself was great!  The mini tortilla barely could hold all of that together.  Also had the parmesan truffle fries when I got my 2nd beer.  It was a good pairing with the beer and it wasn't a small amount either, perfectly suited to be shared for two people.", "stars": "4.0"}, {"date": "2014-11-18", "text": "It's a little confusing whether this place is The Pink Elephant or Alibi.  Either way I'd say its important to note with friends when meeting up!", "stars": "5.0"}, {"date": "2014-11-17", "text": "Went here for brunch this last weekend for their self serve bottomless mimosa bar. ", "stars": "4.0"}, {"date": "2014-11-15", "text": "Place was lively in sat at noon! Only gripe was they kept asking to clear plates and Bill came before we asked!", "stars": "4.0"}, {"date": "2014-11-12", "text": "Showed up late in the evening because Dave's was packed and I was looking for a bar that served snacks. Overall, this place is alright, but nothing impressed me.", "stars": "3.0"}, {"date": "2014-11-11", "text": "Lots of beer selections, especially Belgium.  Pretty cool place but I feel like the tables could be a lot cleaner.  Otherwise, the happy hour menu is not bad. $5-6 wines and well drinks.  Lots of seating. Appetizers and fingers food is alright but pricey is a bit steep.", "stars": "4.0"}, {"date": "2014-11-09", "text": "Brunch review only!", "stars": "1.0"}, {"date": "2014-11-09", "text": "Holy moly! Self serve mimosa bar with 20 flavors is enough for the 5 stars. Luckily we had a Groupon $25 for $50 worth of food! The smoked salmon Benedict on the biscuit was delicious even though it didn't need to be! ", "stars": "5.0"}, {"date": "2014-11-09", "text": "This place was SO. STUPIDLY. LOUD. It's set up as a pretty regular-looking place, with lots of tall tables and a long bar, with TVs above the bar - but the music was annoying-bro-club loud. The focus is Belgian beer, but the food is all Latin, and they were playing some crazy loud Enrique Iglesias. It all seemed like an odd confluence of styles. Our plantains with black bean puree were very yummy, but the guacamole and salsa fell flat. The beer selection looked interesting, but we couldn't agree and settled for a vodka tonic, which was tolerable but weak.", "stars": "2.0"}, {"date": "2014-11-08", "text": "Great food, and server, but the DJ train wreck and mindless sound volume ruins the party scene for Saturday brunch.", "stars": "1.0"}, {"date": "2014-11-08", "text": "On a week day Pink Elephant:", "stars": "4.0"}, {"date": "2014-11-05", "text": "Great place to have a good time and enjoy delicious food and cocktails. They now offering entertainment every Friday night I will check it out this week and see what is like!!!", "stars": "5.0"}, {"date": "2014-11-02", "text": "I came in here thinking this would be an awesome place to catch the games on Sunday and grab mimosas...definitely not the business. Food was average at best and mimosas were whatevers...they have a bucket that has Nasty spoons that you use pour mixers with your overpriced \"Andre\" champagne. Music was whatevers for the most part...live DJ but he was definitely average at best. I think what ticked me off the most was the fact that a bar like this does not subscribe to a proper cable/dish service and I was forced to watch the game on my phone...almost seemed like they were using dial up to stream games on the tv and fairly embarrassing to watch the dude behind the bar struggle to load the games. Overall, pretty whack experience...probably won't go back", "stars": "1.0"}, {"date": "2014-11-02", "text": "Went there on a friday, it was decent. There are no mimosas that day but there is  a lot of beer to choice from. I got the quesadilla, it was good. Not something out of this world. The service is what was weird about this place. I kept having to try and get their attention to pour me water, they are really inattentive about that, despite the fact that there weren't many people there. They have big screens at the bar so this place would be a good place to watch games. I was not super amused though.", "stars": "3.0"}, {"date": "2014-11-02", "text": "Stumbled upon this place with a peer in a big conference week in the city. The atmosphere is great with the best selection on beers in town specially Belgian beers. The service amazing though a packed place with the SF Giants playoff game on TV. Must go place hidden near Moscone.", "stars": "5.0"}, {"date": "2014-11-01", "text": "An interesting location with cool decor and fun music for Saturday brunch. The eggs Benedict are fantastic, though the hollandaise is a bit salty. Great home fries with feta! Juice bar is awesome, with dozens of options. Sassy bacon is to die for. Good service also!", "stars": "4.0"}, {"date": "2014-10-29", "text": "The Pink Elephant is like brunch club madness. You've got self-serve bottomless mimosas in a bunch of different flavors with good tunes blasting at you from the DJ booth. All of that is great, if you're in the mood for it, but be warned that it's really loud in there, so if you're with a big group, you're not going to be able to talk to most of the people you're with without shouting (and even then, they probably won't be able to hear you, as my group quickly learned). But moving on...", "stars": "4.0"}, {"date": "2014-10-28", "text": "I never write a review, and it so happens that the one or two times that I do write a review, it is on a place that was extremely disappointing.  I have been here once in August prior to my horrible experience.  I went here with some friends and already did not have a great impression of this place but decided to come again.", "stars": "1.0"}, {"date": "2014-10-28", "text": "I'm here to watch game 6 of the World Series their TV is connected to the Internet and the connection sucks!! Service sucks as well. Half hour to get my drink order and had to follow up. If not, I don't think I'll get it. Truffle fries I had to pick up myself from the table by the kitchen. By the time it reached my table it's already cold. Being from the hotel and restaurant industry this establishment needs to work very hard to make it.", "stars": "1.0"}, {"date": "2014-10-26", "text": "Alibi is a great spot to hang out and enjoy some beer and grub.  They have a huge selection imported German beers and on Wednesday, they usually feature one of those beers.  They have some cool mugs too for some of those beers.  Really its a good beer spot.", "stars": "4.0"}, {"date": "2014-10-26", "text": "Such an awesome hidden spot!! Their brunch is amazing! They have bottomless mimosas with so many different flavors - its a pour-it-yourself set up so you can pick whatever flavor you want. They food is also amazing! I got a duck benedict and it was phenomenal! Highly recommend if you can find it! :)", "stars": "5.0"}, {"date": "2014-10-23", "text": "Chilled with a couple of the bartenders who were great. Awesome music and atmosphere. Upbeat but not douchie or ghetto. Drinks were good - only had the fries which were bangin. Overall great experience.", "stars": "5.0"}, {"date": "2014-10-19", "text": "Nope nope nope. If you look like you just walked out of an Old Navy ad and you don't mind bros hitting on you, this is your joint. There is no character here and the food isn't worth the atmosphere. Super douchetastic. The servers were nice but there may not be a hostess? We just stood there until the bar took pity on us and got us help. The French toast is tasty, the burger wasn't good, the eggs benny also not great. The menu is limited, and not in a fancy way, and there is no coffee... AT A BRUNCH JOINT.", "stars": "2.0"}, {"date": "2014-10-18", "text": "If you can overlook what can only be described as a spring break dance party for tech workers, the MR beef burger for him and bottomless mimosa bar for her make this place a real contender for my SF brunch dollars.", "stars": "4.0"}, {"date": "2014-10-17", "text": "Really awesome place to hang. I'm not a drinker, I admit, but I'm always looking for the perfect place to hang and chill with friends after a hard day. This place was entirely SF in its flavor and a great place to catch up with good company.", "stars": "4.0"}, {"date": "2014-10-15", "text": "good place,  good people, good food. what else can you ask for? It's my go-to place to  socialize with buddies on the weekend", "stars": "4.0"}, {"date": "2014-10-13", "text": "Maybe I'm just getting old, but 6 friends of mine and I strolled in here for brunch on a Sunday morning and thought the in-house DJ blasting hits at 11am was a bit much. Maybe it's because we were hungover from the night before...", "stars": "2.0"}, {"date": "2014-10-13", "text": "First time coming to The Pink Elephant after hearing from friends how great this place was but after coming here, I'd only come back for a night event. We went here for brunch on a Sunday morning; there's an in house DJ playing music while you eat your food, drink, and watch Sunday football. ", "stars": "4.0"}, {"date": "2014-10-12", "text": "Brunch review - For all those recommendations on the sassy bacon, DELETE THOSE COMMENTS.  The sassy bacon was the biggest disappointment I've had in food eating history.  When someone tells you they're serving you bacon, you expect some delicious ass bacon because, of course bacon is delicious by itself.  What is the sassy bacon? The sassy bacon is PORK JERKY, sweet teriyaki PORK JERKY.  So if you want a cold dry sweet spicy piece of pork jerky feel free order the shit outa it.  If you had in your head that you wanted some delicious hot salty greasy bacon, then prepared to be let down..........................Eggs benny was aight and thats all folks", "stars": "3.0"}, {"date": "2014-10-11", "text": "An excellent happy hour spot in FiDi! It is one of the few places in the city that plays ratch hip hop - a bar after my own heart (: I came at 5:30PM on a Friday and it was pretty packed but my party of 5 was still able to get a standing table pretty easily.", "stars": "5.0"}, {"date": "2014-10-10", "text": "Could be better service. People don't have all day to be here during lunch. Slow service and not attentive to update the patrons on changes.", "stars": "3.0"}, {"date": "2014-10-05", "text": "The Pink Elephant's located down a weird alley. This adds to the uniqueness of this place. The place has some very interesting paintings and a very very nice looking bar. There's a few TVs in this place that they played some sports game on.", "stars": "5.0"}, {"date": "2014-10-05", "text": "They have a full menu on weekdays for lunch and dinner, but only serve brunch on weekends. Even so, the brunch menu is quite decent, with a selection of omelette, eggs benedict, french toast, and a variety of burgers. ", "stars": "4.0"}, {"date": "2014-10-04", "text": "The food was decent and the beer selection was good, but the place reeked of auto fumes and ran uncomfortably hot.", "stars": "2.0"}, {"date": "2014-10-03", "text": "Crystal is one of the managers here and she rocks!  She took a shot of Fernet with me and is super cool.  Ivan is super awesome too.  I like to buy shots for people who will take them with me and they were down so this place gets 5 stars immediately!  Good food too!  Truffle fries.... Get this, free bacon during happy hour!! Whaaaat!?!?  Go here, nuff said.", "stars": "5.0"}, {"date": "2014-10-03", "text": "Came here for my brother's birthday, great music[thanks to the live DJ], delicious craft beer, and affordable drunchies. The lights are dim and the evironment is ecstatic. Restrooms are clean and most of all the staff is extremely friendly, the waitress checked in every now and then to make sure we were good. I have to say this is the best experience I have ever had at a gastropub and I definitely recommend taking a visit. Definitely coming back **", "stars": "5.0"}, {"date": "2014-10-02", "text": "Meh. The brunch is good, especially the potatoes, but the portions are small and you'l likely leave still hungry.  I've heard good stuff about their happy hour though so...I'll be back (in Arnold's voice).", "stars": "3.0"}, {"date": "2014-10-02", "text": "Don't usually leave reviews but this place deserves it! Staff is way beyond friendly, they also have a wide selection of beers to choose from, their \"Sassy bacon\" is mouthwatering. Overall, a very chill place to grab a couple of drinks and hang with friends or down a boot of beer! Haha", "stars": "5.0"}], "average_rating": "4.0", "latest_date": "20131213", "name": "The Pink Elephant", "address": "142 Minna St", "latitude": 37.7867846, "latest_score": "92", "num_of_inspections": "4", "ave_score": "86.0", "longitude": -122.4004657}
{"reviews": [{"date": "2014-11-15", "text": "I asked what the special pastel was and it sounded delicious. I waited 20 minutes for a to go order and it ended up being wrong. I got ham and cheese. I was so hungry and crunched for time I ate them both and left. The acai looks great but in not sure I'll be back.", "stars": "2.0"}, {"date": "2014-10-18", "text": "An authentic, casual piece of Brazil right next to Portrero Hill!  Feijoada was yummy.", "stars": "4.0"}, {"date": "2014-10-16", "text": "Pastel Do Brazil is a true gem in Potrero Hill. Their acai bowl is delicious and very refreshing on a warm day. The acai fruit blend is thick and creamy, not watery at all. Topped with sweet, nutty and crunchy granola and fresh banana slices, this fruit bowl makes the perfect breakfast or post-workout snack.", "stars": "4.0"}, {"date": "2014-10-04", "text": "Best post-workout food around. Conveniently located in World Gym. The owner is super nice too!", "stars": "5.0"}, {"date": "2014-09-27", "text": "Tried their acai bowl and my friend had the Ronaldo's breakfast (i think). Idk what kind of bread they served with the Ronaldo's but it was goooood", "stars": "4.0"}, {"date": "2014-09-25", "text": "This is a great place for those from Brazil to enjoy some home cooked food like some of us... Pastel is delicious. I tried all of them. The salgadinhos are also great especially coxinha. But the best is Feijoada. The best in SF. Perfect on a Saturday. The place is by World's Gym so it serves some healthy stuff too. Great freshly squeezed juices. The good looking people going in and out of the gym is icing on the cake. The owner/cook is so friendly. Actually all the staff there. Anyway, you can't go wrong here. JUST GO!", "stars": "5.0"}, {"date": "2014-08-18", "text": "I like the Owner of Pastel Brazil who rumbling he is.. I came here with my two teenager boys so they can experience the Brazilian food and Both of my sons eat their food so quickly that I had to order a second ", "stars": "5.0"}, {"date": "2014-08-04", "text": "This place is a little gem. I went specifically for a pastel, but came too late in the afternoon, because they were already sold out for the day. ", "stars": "4.0"}, {"date": "2014-07-25", "text": "Wow! I'm really impressed by this place. The food is great and the prices are cheap! After trying fogo de chao, I discovered my love for brazilian cheese rolls. I came here after a doctor's appointment randomly because I was in the area and I'm glad I did. Unfortunately, cheese rolls were all sold out but I tried the pastel (fried meat pastry) with ground beef and cheese. It was fried fresh and was sooo good. The breading tasted almost like a big, thick wonton skin and the filling had warm cheese, corn, and ground beef. Delish!", "stars": "5.0"}, {"date": "2014-07-21", "text": "Great service, Alemao and his wife are super friendly and always greet you with a smile. ", "stars": "5.0"}, {"date": "2014-07-19", "text": "I am a regular at this place because of the neighboring gym.  The smoothies are a near- daily thing for me, and ready specially for me when I walk out the door.  On the occasions I've tried the food, I have always been pleased.", "stars": "5.0"}, {"date": "2014-07-18", "text": "Love this place. Quick, cheap, healthy meals after a workout, or breakfast in the mornings. I eat here about 3 times / week. Delicious - highly recommended!!", "stars": "5.0"}, {"date": "2014-07-17", "text": "Tão delicioso!  Tha's how you say \"Its sooooo delicious!\" in Portuguese!  Pastel Do Brazil does NOT disappoint.  This is a gem of a place which is conspicuously situated in front of World Gym.  The food is AMAZING!  During my past visits, I have had their steak wrap (get your own, you will NOT want to share!), their grilled chicken platter which is generously served with tender moist chicken and Wides' amazing pumpkin/okra mash (which is crack in itself - I need to order a super side order of this next time with everything else!), their pasteles are addictive and worth every bite - and you MUST try their special pasteles!  On one occasion, Wides made a \"special\" dish for me and needless to say, I engulfed it within 10 minutes before thanking him.  Their smoothies are delicious and fresh and all natural.  The next time I visit though I will have to try their Acai Bowl.  Its always staring at me but yet I'm so full of their delicious treats that I never have enough time.  Wides and Raul are an amazing father/son duo who keep the kitchen and stoves running while keeping their customers engaged, happy and bellies full.  It's a definite favorite go to place.  Check it out!", "stars": "5.0"}, {"date": "2014-07-14", "text": "Omg... I can't  believe I've had missed this place . I work around this place every day and only today I gave it a try. I really like the plate  I ordered. A huge plate of brazilian homemade dishes..", "stars": "5.0"}, {"date": "2014-06-30", "text": "This is the best cafe in SF. Healthy smoothies with real fruit, breakfast sandwiches, salmon for dinner.. and staff is so friendly and low key.", "stars": "5.0"}, {"date": "2014-06-27", "text": "This place being inside the gym saves me multiple times a week. Their pink protein. Steak and rice or chicken and veggies with maduros are my go-to's. If you live or work around and don't frequent this place, you're doing something wrong.", "stars": "5.0"}, {"date": "2014-06-23", "text": "100% Authentic Brazilian snacks. Owner is super friendly and helpful. Makes his pastéis right on the spot. Very humble and quaint little restaurant. It's a family owned business too, he's got his sons working with him. Went there today to celebrate our victory 4-1 Brasil vs Cameroon after the game. Was more than pleased. The portions are great. The açaí is amazing and so is their pastel (parece pastel de feira mesmo!!!!). Will definately be back for more. There's also a special everyday on the menu and if i remember correctly he told me saturdays there's Feijoada. A comida é um delícia aqui!!! Se você for brasileiro/a dá uma conferida, com certeza mata um pouco da saudade do Brasil!!", "stars": "5.0"}, {"date": "2014-06-16", "text": "It's a hidden gem. Didn't realize it was there until I joined World Gym. Great food, very tasty, fresh, and healthy. I had both the chicken and steak wraps; not only they were delicious, they serve a generous amount. ", "stars": "5.0"}, {"date": "2014-06-14", "text": "I have to give this place five stars! The entire dining experience took me right back to Brazil. My favorite food while studying in Brazil was the pão de queijo, of course, and rice and beans.  They nailed it! If you ever have a hankering for Brazilian food, be sure to give this place a try! I can never recapture the spirit and beauty of Brazil , but this place brings back the fond memories of my time there!", "stars": "5.0"}, {"date": "2014-06-11", "text": "Was so excited to have lunch today.  I walked in and saw they had a salmon lunch special platter.  I ordered it to go. When I opened my lunch the salmon was cooked to death!  Dry as a cardboard and flavorless.  The rice and beans was great but again the salmon was far to be desired. Oh ya it was $13.00 and overpriced!!  Don't get the salmon!", "stars": "3.0"}, {"date": "2014-06-01", "text": "Amazing pastel!!! You can order a delicious soda from Brazil, Guarana, and have a cheese pastel. The staff is really friendly, they prepare other kinds of pastel and tipical brazilians food!!! I recommend this place to all!!!", "stars": "5.0"}, {"date": "2014-05-13", "text": "Great açaí the best healthy and refreshing choice on this crazy hot day!!! But I couldn't resist and order some delicious pastel", "stars": "5.0"}, {"date": "2014-05-07", "text": "Super bomb chicken wraps and priced very well. Guys are friendly and the food is clean. Eat here", "stars": "5.0"}, {"date": "2014-05-04", "text": "Hidden gem! It's randomly tucked inside the world gym but the location totally works in its favor. Hilarious random jacked dudes plus simple delicious Brazilian food makes for a fun lunch. ", "stars": "5.0"}, {"date": "2014-05-03", "text": "Best food in Potrero Hill. Healthy and tasty !!!", "stars": "5.0"}, {"date": "2014-04-28", "text": "recommend this restaurant, they have the best food and also Brazilian acai, will prove the best Brazilian food.", "stars": "5.0"}, {"date": "2014-04-23", "text": "I am so excited to have discovered this place so near my office. There is such an authentic and welcoming vibe. A lot of Brazilians hang out here and the lady and gentleman behind the counter are always joking around and all smiles. The food is great - they can make pretty much anything you want, even if it's not on the menu. Every time I go they give the food a special touch and it is amazing. ", "stars": "5.0"}, {"date": "2014-04-23", "text": "I love Brazilian food so much that I can speak enough Portuguese to order a meal. The owner of this fine establishment even complimented by pronunciation and asked if I was Brazilian!! Score!!", "stars": "5.0"}, {"date": "2014-04-15", "text": "The best Brazilian pastel outside Brazil!", "stars": "5.0"}, {"date": "2014-04-13", "text": "I love this place cause i lov my job.my costumers and i love who comes every day end always bring me a new friend .so my name is wides vital da silva i am pastel brazzuca  owner .thanks everybody", "stars": "5.0"}, {"date": "2014-03-31", "text": "When I'm craving for a Brazilian goodies I come  to Pastel Brazil!", "stars": "5.0"}, {"date": "2014-03-27", "text": "The food is great and very authentic! Everyone who works there and the people that visit are friendly and have formed a community. I love it :) ", "stars": "5.0"}, {"date": "2014-03-26", "text": "I have nothing but good things to say about Pastel.  I first discovered it when I started working out at World Gym, where it is located and I have been hooked ever since.  It is healthy Brazilian food at very reasonable prices; perfect for post-workout meals.  I even introduced my friend from Brazil to this place and he loves it and continues to come back.  He says the Pastels are just like what you would find in Brazil and they are phenomenal.  It doesn't hurt the the owner Wides is the nicest guy ever, and that goes for the other employees as well. It's always a good day when I get to eat at Pastel. And, if you want a dose of Brazilian culture, look no further; Pastel is frequented by lots of Brazilians and you may even learn how to speak Portuguese. It's an awesome place and I would recommend it to eveyrone!", "stars": "5.0"}, {"date": "2014-03-06", "text": "The best Brazilian food in the Bay Area. Their fresh juice is delicious. You gotta try their platter special with steak, rice, bean and a salad.", "stars": "5.0"}, {"date": "2014-03-05", "text": "The best smoothies, shakes, pastries, plus Brazilian food of the most delicious stile, fresh made everyday, personalized in front of you. Something that just a family business can bring to your diet!", "stars": "5.0"}, {"date": "2014-03-05", "text": "I'm here a few days a week after working out at the gym next door.  They are superfast, and make a variety of healthy and great tasting meals and shakes.  Happy this place is here!", "stars": "5.0"}, {"date": "2014-02-26", "text": "I just hoped in early today after passing this Brazilian place several times. I ordered a Bagel Melt Egg for breakfast and must say this is pretty good.", "stars": "5.0"}, {"date": "2014-02-06", "text": "I've been a member of World Gym for quite a while now, and it wasn't until recently that I decided to try my taste buds here. All I can really say is... WOW. Not only is the food AUTHENTIC BRAZILIAN, and not to mention AMAZING, but this place offers a variety of choices for you to enjoy. I can say without a doubt that every dish in their menu is not only well prepped, but the ambiance and the QUALITY SERVICE that the staff provides makes my trip here always enjoyable. ", "stars": "5.0"}, {"date": "2013-12-31", "text": "Awesome! I didn't eat here but just by looking at the food, the menu and the prices, I can tell I want to and I will.  I had a papaya smoothie and a hard-boiled egg. Next time I may order rice with steamed veggies and an egg on top. Yum. ", "stars": "5.0"}, {"date": "2013-11-09", "text": "Yummy Pink Protein smoothie, but the meat in the wrap I had was indistinguishable...kinda scary!", "stars": "2.0"}], "average_rating": "4.5", "latest_date": "20140417", "name": "Pastel Do Brazil", "address": "290 De Haro St", "latitude": 37.7664098, "latest_score": "90", "num_of_inspections": "2", "ave_score": "95.0", "longitude": -122.4019885}
{"reviews": [{"date": "2014-11-17", "text": "Best spot to stop for a pre-game drink and sandwich!  The prices are better than anything in the neighborhood and so is the food!", "stars": "5.0"}, {"date": "2014-11-16", "text": "Waaaaay overdue review. ", "stars": "4.0"}, {"date": "2014-11-14", "text": "Great place for lunch. Food is pretty good and everyone is friendly. ", "stars": "4.0"}, {"date": "2014-11-03", "text": "Good value and also has a nice selection of books and magazines (to buy). The little garden is very pretty and seems family/dog friendly.", "stars": "5.0"}, {"date": "2014-11-02", "text": "My favourite coffee shop in San Francisco and possibly ever. The staff are the greatest, the food is freshly prepared or baked on site and the prices cannot be beaten. On top of all of that the Delancey St. Foundation is doing amazing things for what seems like amazing people. Ice cream scoops are massive, coffee refills are free, indoor and outdoor seating and even beer and wine.  We are lucky to live in the same neighbourhood.", "stars": "5.0"}, {"date": "2014-11-02", "text": "Cheap eats. Love this place. Ambience is very relaxing. No Wifi BUT there are books/magazines around that you can read. It's a quiet place so you can get a lot of things done. Friendly service.", "stars": "5.0"}, {"date": "2014-11-02", "text": "Apple tea slice is to die for.This place is a unique joint with books coffee desserts to dive in.I have also tried and loved the berry smoothie.This place is amazing for dessert and drink lovers.Desserts dont seem to rotate or change often though.", "stars": "5.0"}, {"date": "2014-11-01", "text": "Atmosphere: Order at the front, bring a number to your table, food is delivered, and when you're done, plates can be left on the tables (or brought to a nearby basin next to the trash can). Great for studying or chatting with friends. Seating is  mismatched and haphazard which works for 1 person or as many as 6 (with 4 being ideal) as it includes benches, small/large tables and sofas with coffee tables.", "stars": "4.0"}, {"date": "2014-10-27", "text": "Fantastic gem in SoMa. Delicious sandwiches. Great atmosphere and outdoor seating. This place is my little secret.", "stars": "5.0"}, {"date": "2014-10-15", "text": "Favorite SF place, ever! Food is delicious, prices are amazingly reasonable - no where better in SF for that, for sure - staff is AWESOME, and to add to all that, they have both a lovely outside garden area that is big, full of trees and flowers, and peaceful. Oh, and my other favorite attribute is the bookstore and cool gift area. I usually have b'fast or lunch, tea, and buy books and gifts all in one fell swoop. Lastly, parking is usually available right outside. Can you think of any other place in SF that has all this?", "stars": "5.0"}, {"date": "2014-10-14", "text": "Unforgettable pie.", "stars": "5.0"}, {"date": "2014-10-12", "text": "Great cute spot with good atmosphere! Very friendly service and good food! I didn't give 5 stars because of 1 register, 2 persons on kitchen and huge line on Sunday morning!", "stars": "4.0"}, {"date": "2014-10-10", "text": "Best damn tuna melt of my life. The tuna was fresh and the sandwich itself was perfectly grilled. Four stars because of the slow service. I waited a long time for my food and it was mostly empty in there.", "stars": "4.0"}, {"date": "2014-10-04", "text": "So the menu on this page isnt correct with their actual menu so I was bit disappointed when I walked in and they didnt have some stuff. This place gets really busy at lunch but over all pretty good. Sometimes the service isnt that good and the people behind the counter are playing around and dont notice your waiting to be helped.", "stars": "3.0"}, {"date": "2014-09-27", "text": "Had a bagel with lox and it was amazing! Great outdoor patio. Would definitely recommend!", "stars": "5.0"}, {"date": "2014-09-26", "text": "Great hidden gem. Perfect lunch place, coffee, and desserts! Great prices with gorgeous garden seating!", "stars": "5.0"}, {"date": "2014-09-26", "text": "The whole place is cool i would definitely be back here. It has a whole outside seating area thats very relaxing. You can eat and read at the same damn time. The inside is like a coffee shop/ library.", "stars": "4.0"}, {"date": "2014-09-25", "text": "Very nice and affordable place, great for breakfast and lunch!", "stars": "5.0"}, {"date": "2014-09-18", "text": "This place is on my way to work and I love it for a few reasons:", "stars": "4.0"}, {"date": "2014-09-18", "text": "My go to place after appointments and city activities. Since I have had the pleasure of the delicious meals as a disabled individual the staff goes out of their way to be genuine and warm. Delicious salmon crapes, great grilled sandwiches, and interesting platters. My favorite is the chocolate cake made from scratch!", "stars": "5.0"}, {"date": "2014-09-10", "text": "Very disappointed. Poor service, poor food, and 30 minute wait during off-peak hours.", "stars": "1.0"}, {"date": "2014-09-05", "text": "Really nice little discovery.  Was introduced to this place by a friend who works near-by.  Plenty of metered parking right in front for a Friday lunch (on a non-game day!).  Got there early, so I spent some time browsing their small (but well stocked) bookstore.  ", "stars": "4.0"}, {"date": "2014-08-31", "text": "I guess I'll have to come back here some day to try some more things on their menu, but I grabbed a small bite when I was here to meet someone and didn't think it was all that spectacular. I can see the appeal of it as a place to just sit, read, and sip on coffee or nimble on some food, though. It certainly has a large enough space for you to chill alone or with a group.", "stars": "3.0"}, {"date": "2014-08-29", "text": "They have super cheap good coffee, ", "stars": "4.0"}, {"date": "2014-08-28", "text": "Great service, good food, and excellent prices, what more can I say? Oh location can't be beat either. Nice place to have lunch and support rehabilitation! Will definitely be back!", "stars": "5.0"}, {"date": "2014-08-27", "text": "Wow, I was really pleasantly surprised at the great service and better yet great food here! ", "stars": "5.0"}, {"date": "2014-08-27", "text": "what a slice of heaven in busy San Francisco!", "stars": "5.0"}, {"date": "2014-08-26", "text": "Nice place with good and affordable coffee and breakfast.", "stars": "4.0"}, {"date": "2014-08-24", "text": "A surprising delight whilst walking down the street aimlessly for a decent joint to eat at on a Sunday afternoon, awesome!", "stars": "5.0"}, {"date": "2014-08-23", "text": "I come here often for lunch, as my work is right next to Crossroads. I get two crepes, which is something I'm working on cutting down. But the spinach and cheese crepe is on point.", "stars": "4.0"}, {"date": "2014-08-17", "text": "By far my favorite daily cafe and not just because it's nearby. Been coming here regularly for over 8 years now. Great setting (outdoor garden area, variety of seating options inside). Great service (most food is brought over to your table). Diverse menu (crepes, Mitchell's ice cream, wine & cheese, etc.). If asked there isn't much I'd ask them to improve on.", "stars": "5.0"}, {"date": "2014-08-06", "text": "This is a great spot for a quick lunch or early dinner. The salads are fresh and filling. I find that the staff is friendly and helpful. The patio is really comfortable on a warm day.", "stars": "4.0"}, {"date": "2014-08-05", "text": "I have to say, this place was one of my best experiences ever in San Francisco and given the circumstances of my day, it could have easily ended up being my worst.  After purchashing some used furniture nearby, my son and I decided to stop in here for a late lunch. We just happened upon it accidentally because we were looking for a place to park, assuming we would have to walk a ways to eat somewhere. There were plenty of open, pay parking spots right in front and a number of cute shops nearby. ", "stars": "5.0"}, {"date": "2014-07-29", "text": "Great food! Tasty drinks! Awesome service! Great location! Relaxing environment. This place is a rare gem in the SoMa, and you won't find anything like it around.", "stars": "5.0"}, {"date": "2014-07-22", "text": "I adore this place so much. It is part bookstore, coffee shop, cafe, and garden. Love the tables all throughout - unlike most bookstores that make sure to keep dining area separate. ", "stars": "5.0"}, {"date": "2014-07-22", "text": "Wandered over with some coworkers to grab a healthy lunch.  Great selection of options to suit most people - healthy and not so healthy.  Sandwiches, paninis, salads, crepes (sweet and savory), small plates, etc.  Not to mention they've got beer, wine, ice cream and coffee.", "stars": "4.0"}, {"date": "2014-07-22", "text": "A cozy place with beautiful patio and an interesting small store. Child-friendly. Fair prices and delicious ice creams and milkshakes. No free wi-fi and my mobile wi-fi didn't work well there, but sometimes it's not so bad to be internet free.", "stars": "4.0"}, {"date": "2014-07-20", "text": "I know some people who go to crossroads constantly. I really don't understand it. The food is average at best. The venue is kind of nifty the first time you go, but wore on me very quickly. The service can be slow as well. This place is kind of a cross between like Starbucks and Panera bread, but it's kind of also the worst of both in my opinion.", "stars": "2.0"}, {"date": "2014-07-18", "text": "Everything is homemade and pretty cheap. Good variety of food options, the iced apricot tea was delicious and so was the clam chowder! And the crepes are big and made just like the street vendors in Paris. Yum!", "stars": "4.0"}, {"date": "2014-07-18", "text": "Excellent food, excellent service, at a price you really cannot beat around here. Their savory crepes are amazing, and you can get a cup of their house coffee for a dollar. They also have great desserts.", "stars": "5.0"}], "average_rating": "4.0", "latest_date": "20140429", "name": "Crossroads Cafe", "address": "699 Delancey St", "latitude": 37.7830673, "latest_score": "94", "num_of_inspections": "4", "ave_score": "95.25", "longitude": -122.3889795}
{"reviews": [{"date": "2014-11-19", "text": "Oh how I love this pretentious little cafe! Not that they need more business (lines crawl down the block by noon), but it wouldn't hurt for the staff to lighten up a bit and make an occasional exception on the 4 orders per person rule for regulars. Still, I keep coming back. The kale salad is exceptional. The chefs here have tamed an otherwise unappealing vegetable into a crave-worthy meal dotted with pancetta and tossed with balsamic reduction. The baguette sandwiches are perfect; they travel well and are easy to share. The hot sandwiches are delicious and large but get soggy after a while. The changing salad menu usually disappoints; they're either too small, too protein-focused, or over-dressed. The coffee is great. Everything is priced reasonably, but you get the most bang for your buck when you share a few different orders with friends. There are a few bar seats, two 2-person tables indoors, and a few outdoor seats.", "stars": "4.0"}, {"date": "2014-11-05", "text": "Get the Kale salad, roast beef sandwich of ham & cheese baguette! Make sure you come before noon to avoid the line!", "stars": "5.0"}, {"date": "2014-10-30", "text": "I tried salads and sandwiches, they are good, but I really wish they started serving them earlier than 11.30.", "stars": "4.0"}, {"date": "2014-10-20", "text": "Never disappoints. One of my favorite spots in the city. I just wish you guys stayed open later", "stars": "5.0"}, {"date": "2014-10-15", "text": "Darwin has a nice vibe and friendly service. Good sandwiches, reasonable coffee, long lines at lunchtime.", "stars": "4.0"}, {"date": "2014-10-12", "text": "Just finished brunch (aka second breakfast) at Darwin Cafe.  What a diamond in the rough.  I've lived in Soma for 8 years and can't believe that I haven't found this place sooner.  This part of Soma is mostly dead on Sundays, I'm so happy to have found a new brunch spot.  Everything was delicious, but mad props out to the cinnamon hallah bread and the kale salad with prosciutto and poached eggs.  The staff is very friendly and attentive.  We'll be back.", "stars": "5.0"}, {"date": "2014-10-12", "text": "Do a favor to yourself and get a proper cappuccino from Darwin.", "stars": "5.0"}, {"date": "2014-10-12", "text": "Totally delicious and worth the wait.  They change their menu every two weeks but my absolute favorite is the roast beef. Ingredients are fresh and the chefs seem to take pride in their preparation. I've been here more times than I can count and Darwin has yet to disappoint.", "stars": "5.0"}, {"date": "2014-10-05", "text": "Glad they have extended hours now. Ive tried many times to go but failed. Recently, i had a meeting in the area but was only able to catch a beverage there. When asked which they liked more between the iced tea and iced coffee, the latter won out. Heading to the train i got extra jacked on a solid iced coffee for the road", "stars": "4.0"}, {"date": "2014-10-02", "text": "Since I work in SOMA, this is one of my favorite spots for lunch. This place is an absolute gem! The food here is fresh, rustic, honest, and hearty. I've gotten the mortadella sandwich and the kale salad here. The sandwiches all come with a seasonal salad. The last time I got a sandwich, it came with a salad that had persimmons and pomegranates in it. Yum! Don't let the line fool you, it goes through pretty fast. And although the space is tight, I haven't had trouble finding seating because a lot of people take it to-go. Keep your eyes open because this place is a hole-in-the-wall. As many people have mentioned, try their kale salad. It's absolutely delicious!", "stars": "5.0"}, {"date": "2014-09-24", "text": "After searching for something new in the SOMA area, we decided to walk down during our lunch break and brave the long lines. The highlight was really the nutella and banana baguette. It was ahh-mazing! I would wait through the lines any day for that again.", "stars": "4.0"}, {"date": "2014-09-22", "text": "I heard such great things about this place and about the Kale salad.  I am beyond disappointed. Worst $11 I've ever spent. I ordered the Kale Salad to go. It is missing the aged balsamic which I asked for on the side and asked for the prosciutto to be left off (gasp, I know).  I am literally eating a bowl of dry kale, radicchio, and Parmesan cheese.   I'm 4 bites in and on my 3rd glass of water.  If I were still in the area, I would go back and express my disappointment in a heartbeat.  ", "stars": "1.0"}, {"date": "2014-09-22", "text": "Great food, true. I don't even mind the prices for the quality. But all but two of the customer-facing employees are so snarky that I'm going to curtail my visits. Over the past year our office probably spent $400/week there; we're starting to tire of the attitude and think twice, especially given you have to stand in line so long. Pre-order instead? Sure--but be ready for almost-angry insistence that you be in by 11:30 to pick up, and when you do, your food won't be ready.", "stars": "3.0"}, {"date": "2014-09-18", "text": "This place had been on my list for a long time because I'm a sucker for a good kale salad. I made a friend meet me here and trekked it down to Soma from my office on a Monday. I got there about 11:45 and there wasn't much of a line. We ordered the kale salad and the avocado, tomato, hummus, feta sandwich. The kale salad was good but I think I'm more of a parmesan/currant kale salad person. The real winner here was the sandwich. The flavors melded together perfectly and the bread was fresh and chewy. I've been thinking about it ever since.", "stars": "4.0"}, {"date": "2014-09-16", "text": "Not exactly sure what the big line is about. Haha survival of the hippest? But the food was good. We were able to find outside seating. I ordered the roast beef which comes with a side salad of greens, feta, and plums. I'd like to come again and try the other salads!", "stars": "4.0"}, {"date": "2014-09-12", "text": "I really wanted to give a better review but I had a pretty bad experience here.", "stars": "2.0"}, {"date": "2014-09-11", "text": "Darwin Cafe is worth the crazy line that forms outside everyday. ", "stars": "5.0"}, {"date": "2014-09-11", "text": "Super duper delicious and beautifully represented. The outdoor seating is lovely and inside is also hip and stylish- very SOMA San Francisco. ", "stars": "5.0"}, {"date": "2014-09-07", "text": "I was thrilled to hear that Darwin Cafe opened for brunch since I live nearby but work far away so I can never make it on weekdays.  My buddy and I came for brunch at noon on a Sunday and there was no line.", "stars": "4.0"}, {"date": "2014-09-05", "text": "Coffee review only**", "stars": "4.0"}, {"date": "2014-09-02", "text": "The sandwiches here are truly delicious with fresh ingredients and unique combinations. They usually have a long line during lunch hours but you can always take the food to go and eat at a nearby park. I love their coffee too, and sometimes stop by at off peak hours for a coffee break.", "stars": "4.0"}, {"date": "2014-08-17", "text": "Yummy salads, ok sandwiches, awesome service, and LOTS of people during lunch. I tried to come in at 11 to grab my salad and skip the crowd, but turns out they weren't ready for lunch yet. : ( I went back at 11:30, John remembered I had been there before, and I got my yummy kale salad. All was good. Prices are average for lunch in SOMA. ", "stars": "4.0"}, {"date": "2014-08-13", "text": "FOOD - CHEEZ WHIZ on a sandwich?!?!  I took a risk because it sounded a little bit too much but it was amazing.  Had the Roast Beef and would go back again.  ", "stars": "4.0"}, {"date": "2014-08-11", "text": "Great food quality, but the price is a little off setting. $11 for a Kale salad? It's good but really, $11?", "stars": "3.0"}, {"date": "2014-08-07", "text": "I really enjoy getting lunch here. I work close by so it's easier for takeout, especially since there isn't much seating. a few tables outside and a few inside. the wait to order can be long, 20 minutes or more, but once ordered the food comes out pretty quickly, and it's definitely worth the wait. they change the menu occasionally, so there are always new things to try. but it's my favorite sandwich and salad place in SoMa. I often get a sandwich for lunch and a salad to save for dinner.", "stars": "4.0"}, {"date": "2014-08-04", "text": "This place is so tasty. I love that they have a bit of everything from salads to sandwiches...anything you might be craving. Try out the baguettes that change all the time. They're generally chap, fresh, and perfect for a light lunch. ", "stars": "5.0"}, {"date": "2014-07-26", "text": "I wish I could tell you that it was ME who discovered this place. ", "stars": "5.0"}, {"date": "2014-07-24", "text": "When you're my age you've had several thousand turkey sandwiches in your life, and you don't expect anything to come along and rewrite the genre.  You weren't expecting Darwin Cafe.", "stars": "5.0"}, {"date": "2014-07-19", "text": "Much better than the average SOMA lunch joint!", "stars": "4.0"}, {"date": "2014-07-15", "text": "The food is good, but it definitely comes at the San Francisco portion with the San Francisco price. I got the roast beef sandwich that can be taken down in about 5-6 normal bites. Plus an arugula salad. Everything is tasty but I had to pay $12 for all of that. $12 for not even 1/2 lb of food. By that standard, Whole Foods is a bargain compared to this place. I wanted a mexican coke too while I was there but the bucket the bottles were sitting in was lukewarm. I understand they are busy and didn't have time to fill it back up so I won't ding em for that. But at the end of the day, I just feel cheated in what I get.", "stars": "3.0"}, {"date": "2014-07-13", "text": "This place is like an episode of \"Portlandia.\" But, unlike Portlandia, completely humorless. Someone correct me if I am wrong, but I believe it's called Darwin because in the time it takes to get a cup of coffee A NEW SPECIES WILL HAVE EVOLVED.", "stars": "2.0"}, {"date": "2014-07-11", "text": "Kale salad is killer, wait time for a pre-made salad (or anything at all, really) is ridiculous. Even when you're the only person in the place, don't expect to wait less than 10 minutes for whatever you get, whether it be coffee, a baguette sandwich, or even a can of San Pellegrino (ok, maybe I'm exaggerating on the last one).", "stars": "3.0"}, {"date": "2014-07-09", "text": "Shrimp avocado on butter lettuce w/herbs   Salad. Along w/Greek goddess dressing - Delicious! Cost was $12 and the portion was TINY! I was still hungry but it was good.", "stars": "4.0"}, {"date": "2014-07-07", "text": "boyfriend and i only live a block away and we've never came here. big mistake- this is definitely a good place if you want to eat light and healthy! everything else around here is pretty heavy (garaje, brickyard, hrd, cafe chaat)", "stars": "4.0"}, {"date": "2014-06-23", "text": "Wow first time here and already loving it. I definitely love love love the food but it's sorta expensive for sandwiches & salads (although I would still pay for it). I wouldn't know about this place unless someone who lived or worked in SoMa told me to come here, which I came here for. It's kind of a hole in a wall for those who don't normally hangout around this district. ", "stars": "5.0"}, {"date": "2014-06-19", "text": "I work around the corner from here, and come here often. ", "stars": "3.0"}, {"date": "2014-06-16", "text": "After a couple visits and some memorable eats, it's safe to say this is one of my most highly recommended sandwich lunches in the SoMa district. ", "stars": "5.0"}, {"date": "2014-06-04", "text": "this just seems like one of those perfect little cafes. well, its more than a cafe, they serve some of the best salads and sandwiches i've ever eaten. had the kale salad $11, ham & cheese baguette sandwich $5.50, and i couldn't not get the local handmade whoopie-pie cookie $3.50.", "stars": "5.0"}, {"date": "2014-05-31", "text": "As you can tell from the other reviews the food at Darwin is awesome! It's a wonderful not-so-hidden (anymore) gem!!! What amazes me about this place though is the people who work there are awesome! Most SF cafés and restaurants with the level of demand Darwin has can skimp on service. That's not the case here. The staff is super friendly and go out of their way to make you feel at home! ", "stars": "5.0"}, {"date": "2014-05-29", "text": "I went to Darwin today because really wanted a great salad, and thought it would be a great day to splurge at Darwin!  Aside from one not so great kale salad one time, I have always really enjoyed their menu, even if it is on the $$ side.", "stars": "2.0"}], "average_rating": "4.0", "latest_date": "20140507", "name": "Darwin Cafe", "address": "212 Ritch St", "latitude": 37.7806091, "latest_score": "94", "num_of_inspections": "4", "ave_score": "93.25", "longitude": -122.3961443}
{"reviews": [{"date": "2014-11-21", "text": "Decent fast casual Vietnamese. Noodles and chips - what more could the mother of a toddler ask for? Of course I would rather go to a real Vietnamese pho restaurant, but you can't beat the proximity to our hotel.", "stars": "3.0"}, {"date": "2014-11-20", "text": "Fresh. Custom. Healthy. What else can you ask for?", "stars": "5.0"}, {"date": "2014-11-18", "text": "Wish I can give you 0 stars!  While getting my pho fix... My chicken was partially raw... Wtf??! First thing in the restaurant industry is not to serve raw meat!! Argh. Never returning again. fck that, I will go else where. Plus, they are skimpy with their rolls. It seems smaller and smaller each time I order it.  For $9... I will go to a pho restaurant instead..", "stars": "1.0"}, {"date": "2014-11-08", "text": "We were looking for something fast and tasty near our hotel (Marriott) after a full day walking around the city.  We came here because we thought this place looked clean from outside.   Well, we were pleasantly surprised by the food.  The menu was limited with rolls and Pho...  we had both and were happy with both.", "stars": "4.0"}, {"date": "2014-11-07", "text": "For what it is (fast food, Vietnamese-style), you can't beat the fresh flavors and cool wraps that magically appear when moistened with water at Freshroll.  We managed to get up here after the SF Giants parade, and ordered pretty much one of everything, including the pho.  Have had better soup noodles, but the meat was tender and the decent broth was perfect for a brisk Fall evening in the City.", "stars": "4.0"}, {"date": "2014-11-03", "text": "Theoretically this spot offers food that would hit a great spot on my palate. I enjoy Vietnamese foo greatly, and the fast-casual atmosphere ensures that both my taste buds and wallet remain happy. However, the problem is in the execution. My wraps, and especially my bowl, feel like a careless mishmash of ingredients rather than an actual entree of a meal. It's hard to quantify, but I just feel awkward eating such a thing.", "stars": "2.0"}, {"date": "2014-10-28", "text": "Very delicious! I came here super hungry one night and got the steak pho, fresh -wrapped spring rolls (2 lemon grass pork and 1 chicken - they let you mixed and match) and a limeade. Yum yum!", "stars": "4.0"}, {"date": "2014-10-28", "text": "This place makes great Banh Mi sandwiches. I had the lemongrass pork at lunch today. I had to wait about 25 minutes in line due to the lunch rush but all in all it was worth it especially for the reasonable price they charge. They also offer complementary water that had sliced cucumbers infused which was a nice touch as it was a warm day today. There are several different sauces at the counter available to try. But I didn't even need any as my sandwich was perfect.  ", "stars": "4.0"}, {"date": "2014-10-27", "text": "Chipotle meets Vietnamese food. The pho was pretty good, but I really like that you can customize your spring rolls. Nice touch!", "stars": "4.0"}, {"date": "2014-10-24", "text": "Love the bowl! Everything is fresh, clean and healthy. The meat and garlic shrimp are well flavored, goes great with the noodles. ", "stars": "5.0"}, {"date": "2014-10-24", "text": "Great fresh food. Creative concept. In need of a quick, cheap, yummy bite. Go. Done.", "stars": "5.0"}, {"date": "2014-10-22", "text": "This one being opposite moscone center had a huge queue durig lunchhtime.It took me a good 20 min to just get to the register.They should have process to take online order to avoid this.I had the banh mi sandwich and vietnamese coffee.The coffee had no taste.Too mild.The sandwich was ok.Tofu was uncooked and cold.Their signature sauce was good.", "stars": "2.0"}, {"date": "2014-10-22", "text": "This place is minimalistic (streamlined for the lunch rush I assume) but friendly.  Dropped by on a lazy shopping Sunday.", "stars": "4.0"}, {"date": "2014-10-17", "text": "Catered lunch from here and it was surprisingly good. ", "stars": "3.0"}, {"date": "2014-10-16", "text": "While attending Dreamforce on Howard and 4th, my friend and me wanted to grab a quick lunch so I took her to my favorite roll place! Healthy, clean (everything is made in front of you), efficient (you are in and out of the place in 7-8 min) and not too harsh on the wallet. My go to item is the Tofu spring rolls (3 pcs for $8.90). My friend opted for a Tofu bowl (which had rather chunky pieces of Tofu). On an earlier occasion, I had tried the Taro chips, I am not a fan but my hubby loved it, so I guess thats subjective.  But if i am in the area, rest assured, its ROLL time!", "stars": "4.0"}, {"date": "2014-10-14", "text": "OK.  A-OK?  Kind of industrial.  I was expecting less kind of industrial.  But okay.", "stars": "3.0"}, {"date": "2014-10-08", "text": "I was traveling on business for Oracle Open World.  This is conveniently located across from Moscone West.  My first day's box lunch was such a hassle and ordeal that I told myself I was going to treat myself to an awesome lunch the rest of the week to make up for it.  Freshrolls definitely did the trick!", "stars": "5.0"}, {"date": "2014-10-03", "text": "Yum!  Great flavors that made a party in my mouth that I didn't want to  stop :)", "stars": "5.0"}, {"date": "2014-09-29", "text": "Freshroll is a great place if you have a convention at Moscone center.  Directly across from Moscone West it is a good choice if you want a break from convention center/hotel food.  ", "stars": "5.0"}, {"date": "2014-09-22", "text": "We ordered through TryCaviar (a delivery service) and only received one of the two phos we ordered. When we called to tell them, they said we could come pick up the missing pho (no can do with a sleeping baby) or mention this the next time we ordered so it would be reimbursed. Like we would order again. The person I spoke to couldn't do refunds (but said we could email someone) so we were just out of luck. Luckily TryCaviar refunded us the missing soup. Just sloppy.", "stars": "1.0"}, {"date": "2014-09-22", "text": "A great alternative to the regular sauce and fat laden lunches in the city. It is just as they claim to be, fresh. Service wise they can get a little lost although it is \"subway style\" and should be stright forward, however they make it up with politness. ", "stars": "3.0"}, {"date": "2014-09-17", "text": "I went yesterday with my mentor and it was awesome!!! loved every bit of it, I got the bowl with chicken and shrimp and it was perfect! geesh im looking for somthing else for lunch but I think im going to just go back for lunch today,lol OHHHHHH YEAH VERY FRESH, YUP IM GOING THERE FOR LUNCH TODAY", "stars": "5.0"}, {"date": "2014-09-13", "text": "My first time coming here I got the vietnamese sandwich with the lemongrass pork. It was ok good. Would like it if the bread were a little bit bigger. Today I came to try their vermicelli noodles. It was nice and easy to order. It was ok too but thought the vinagrette could be better -it was too sweet. There were other condiments available too which was nice. All the staff was welcoming and nice/friendly. Average food.", "stars": "3.0"}, {"date": "2014-09-12", "text": "The restaurants around the Metreon are so unique and their concepts are way too cool. Who would have thought you can turn any cuisine into a Chipotle style one? ", "stars": "4.0"}, {"date": "2014-09-11", "text": "Freshroll is Vietnamese Fast Food. You select your meat, and you have the option of rolls, sandwich, rice bowl, or pho. I got the rolls with the pork, and taro chips. My coworkers got the sandwich and the rice bowl, and the lychee tea. He said the tea wasn't very strong, but for me the food was simply delicious. Very fresh. Next time I'll go for the rice bowl..the proportion is a deal! And I didn't get to try the vinaigrette :(( The decor is very mod with white high tables and green swivel chairs. Oh and the cashier kinda winked at me when I was getting water for my table hahaha", "stars": "5.0"}, {"date": "2014-09-10", "text": "My Go-to place for a healthy bowl of \"bun\".", "stars": "4.0"}, {"date": "2014-09-09", "text": "The best way to describe Fresh Roll is that it's like Chipotle but with Vietnamese food. You pick your protein and what it comes in (salad, sandwich, or Spring rolls), and then the toppings.  All the ingredients are pretty true to Vietnamese dishes and actually are fresh. ", "stars": "4.0"}, {"date": "2014-09-08", "text": "When moving to a new city, it's always wonderful to see some familiar faces. The other day, a close friend of mine from Las Vegas came to town and wanted to grab lunch. I quickly jumped to the opportunity to reconnect with a friend from my past. The good thing was they were moving to SF VERY soon! They also suggested this place as they've visited this joint time and time again. I was super excited to try something new! ", "stars": "5.0"}, {"date": "2014-09-05", "text": "Freshroll is like the Vietnamese version of Chipotle -- choose your own meat, filling and dipping sauce. The sauces were unique and different from traditional ones I've had at other restaurants. Great for a quick snack or light lunch. Love the concept and would definitely try it again!", "stars": "4.0"}, {"date": "2014-08-31", "text": "Great place to get some fresh Vietnamese food in downtown SF at a very reasonable price.  My wife and I both got the bowls and we felt we got decent portions and the quality was better than we expected.  ", "stars": "4.0"}, {"date": "2014-08-25", "text": "Healthy and delicious!! ", "stars": "5.0"}, {"date": "2014-08-25", "text": "Love this place! It's like a Vietnamese Chipotle. You can pick between Vietnamese spring rolls, sandwich, bowl or pho.", "stars": "5.0"}, {"date": "2014-08-21", "text": "Interesting concept that I wish they had on the east coast. The spring rolls are often my favorite part at Vietnamese joints, so I was delighted to get three GIANT spring rolls that I chose the ingredients for. This GF gal left full and happy. Lychee tea was very refreshing. Hubby's pho was super tasty as well.", "stars": "5.0"}, {"date": "2014-08-21", "text": "Was jonesing for pho. Came here based on Yelp ratings. ", "stars": "4.0"}, {"date": "2014-08-21", "text": "This place makes some tasty rolls. For around $10, you get 3 good-sized rolls wrapped in rice paper. You can fully customize what meats and veggies go into your rolls, so I usually get a round-robin of meats. And like I said, they're really tasty and filling. They'll fill one little container of sauce of your choosing, but feel free to grab more. I've also tried their bowls, which are exactly like the rolls except with some noodles. Portion sizes are comparable, i.e. 3 rolls is approximately equal to one bowl. One note: While their rolls and bowls are great, you may want to avoid this place if you're looking for a hot meal, as that does not appear to be their specialty. But it's a great place for a lunch!", "stars": "4.0"}, {"date": "2014-08-18", "text": "It's like a Vietnamese chipotle for spring rolls!  Quick and easy!  I had tofu, chicken and pork spring rolls.  It was not bad", "stars": "5.0"}, {"date": "2014-08-17", "text": "We were looking for a quick bite after the movies.  All of us enjoy Vietnamese food (one of us is Vietnamese) and we were kinda curious but didn't have high expectations.  Turns out just what you want from Vietnamese food - very fresh veggies, mix of hot and fruit, great sauces and good meat.  It was nicely done.  All of us ordered different things and really enjoyed our meals.", "stars": "4.0"}, {"date": "2014-08-14", "text": "Great fast-food.  Ingredients are fresh and varied - get them in a rice wrap&roll, in a salad bowl, on a bed of noodles or rice.   Personnel are good-natured.", "stars": "5.0"}, {"date": "2014-08-12", "text": "The lemongrass pork freshrolls here taste delicious! I got the 3 for $7.95 plus the taro chips. The service was a little bit slow (the line was quite long), but it was well worth the wait in my opinion. Everything tastes so fresh and makes you feel healthy. ", "stars": "4.0"}, {"date": "2014-08-11", "text": "Girlfriend and I went to this place for dinner before watching Gaurdians of the Galaxy. Her roommate recommended it and we haven't had any viet food in a while. Pretty much a Vietnamese Chipotle/subway/have-it-your-way type of deal where you can customize your orders. I had the pork spring rolls and my lady had the chicken Pho. Definitely on point and I also enjoyed their Lychee tea and Taro chips! Will come back for a 2nd round one day.", "stars": "5.0"}], "average_rating": "4.0", "latest_date": "20140528", "name": "Freshroll Vietnamese Rolls & Bowls", "address": "157 4th St", "latitude": 37.7839351290841, "latest_score": "88", "num_of_inspections": "4", "ave_score": "93.25", "longitude": -122.403370141983}
{"reviews": [], "average_rating": "4.0", "latest_date": "20140624", "name": "Jamber", "address": "858 Folsom St", "latitude": 37.781146, "latest_score": "96", "num_of_inspections": "3", "ave_score": "91.0", "longitude": -122.402668}
{"reviews": [{"date": "2014-11-19", "text": "4505 Meats is decent. If you love salt, you'll LOVE this place. They literally drop the salt bomb on everything!", "stars": "3.0"}, {"date": "2014-11-09", "text": "I'm confused why this location of 4505 has such high reviews, and I hope the NoPa one is better and contributing to this hype. I've heard good things about the meat here, but it is honestly lackluster and the burgers are put together with the thought of a $3 burger, not a $9 one.", "stars": "3.0"}, {"date": "2014-10-23", "text": "Very disappointed by the brisket sandwich. It was mostly a $13.50 cole slaw sandwich. It really put to shame the word brisket.", "stars": "1.0"}, {"date": "2014-10-12", "text": "4505 Meats! They have a food stand on Thursdays at the Ferry Building for the farmer's market. It's one tiny stand but they serve up a lot of meat.", "stars": "4.0"}, {"date": "2014-10-02", "text": "Apparently they don't allow you to choose 2 of the same meats in the combo plate (comes with 3 meats) but this was not posted anywhere. I do not eat pork for religious reasons, but they refused to accommodate even though there were only 2 non-pork options...wouldn't even double up on chicken even though it was the cheapest option on the menu. They will not be receiving my business again.", "stars": "1.0"}, {"date": "2014-10-02", "text": "Beef brisket sandwich. Most disgusting beef / sandwich I ever had in my life. All tasted like the chewy slimey greasy blubbery animal fat u throw away. Horrific. Can't believe I paid $14 for this. So nasty. Never again. Never.", "stars": "1.0"}, {"date": "2014-09-27", "text": "That burger was amazing. No need for further review or comment.", "stars": "5.0"}, {"date": "2014-09-23", "text": "Another hunt for the best burger in the bay since Disco Volante died (RIP).", "stars": "4.0"}, {"date": "2014-09-22", "text": "Stopped by to try the burger - it was really good! I'll try a few other things next week.", "stars": "4.0"}, {"date": "2014-09-19", "text": "Had the Maple Bacon Breakfast Sausage there last weekend.  It definitely did not live up to the hype. Despite all the fixings on the sandwich, it was devoid of any taste.  You would think sausage would be naturally salty, but there was no hint of salt or seasoning (it was also surprisingly rubbery).  It's a shame the taste didn't match the presentation.  Seriously, a microwaveable Jimmy Dean sandwich would've been more satisfying.  I'm giving 1 star for presentation...would've been 2 stars if not for the $9 price tag.", "stars": "1.0"}, {"date": "2014-09-13", "text": "The beef brisket sandwich is the bomb but at $ 13+ including tax where do you draw the line ?  I would give it five stars but the price is prohibitive.  The sandwich is definitely quality but on the smaller size.  Simply the most tasty around period.", "stars": "4.0"}, {"date": "2014-09-06", "text": "the food here looks delicious but isn't that great. my boyfriend and I got the best damn cheeseburger, the hot dog, and the garlic fries. usually, I love extra sauce on all my foods but the fries were just way too overpowering. we only ate half of it and it got worse and worse throughout the bites so we ended up throwing it away. the hot dog was full of flavor but it would be even better if they had grilled onions and bell peppers on top. the cheeseburger isn't too bad as well but it wasn't amazing. worth the try though!", "stars": "3.0"}, {"date": "2014-08-29", "text": "I just had their pulled pork sandwich yesterday, and it was more like a pickle sandwich with slaw, pepper and some pork.  My wife ordered the same since they were completely out of the brisket, and quickly regretted it. We both complained about the amount of pepper used and had to throw them away.  ", "stars": "1.0"}, {"date": "2014-08-27", "text": "Love their cheeseburgers and hamburgers. Some of the best burgers in town.", "stars": "4.0"}, {"date": "2014-08-21", "text": "I love 4505 meats for their sandwiches and their chicharrones. I like visiting them at the Ferry Building on Saturdays.  Their sandwiches are delicious and reasonably priced but their chircharrones are where it's at. I like chiccharones but after tasting a 4505 meat one, it was like ok this is what all chicharrones should be measured against, they are so tasty.  They are little pockets of light pork goodness. I have eaten them from both large and small bags and may be partial to the small size bags becaues I like the smaller sized chicharrones but that may just be me.  Glad to see they have a store in the Mission now.", "stars": "5.0"}, {"date": "2014-08-19", "text": "This is a tasty burger!", "stars": "5.0"}, {"date": "2014-08-14", "text": "I've never met a BBQ I didn't like. Except today. ", "stars": "1.0"}, {"date": "2014-08-07", "text": "Outstanding BBQ. I've eaten the brisket twice and I assure you it is inspired. Today's side was baked beans -- equally inspired. Worth the wait. Worth the cost (skip dinner or eat a crappy Banquet's frozen entree).", "stars": "5.0"}, {"date": "2014-07-18", "text": "Best Brisket! Winning ribs... the sides are too rich for me but the Farmer's Market Organic salad is so fresh, beautiful, and satisfying to have with your brisket. ", "stars": "4.0"}, {"date": "2014-07-15", "text": "The maple sausage sandwich was delicious. I shared with my son, but he loved the sausage so much, he ate most of mine too.  The cheeseburger was very good. I could taste the quality of the meat. It has a sauce that's similar to In N Out sauce but better. Would I say it's the best burger ever? Not for me, but it's definitely up there. ", "stars": "5.0"}, {"date": "2014-07-12", "text": "WOW! WOW! The first wow was for the freaking line. I waited almost an hour for this. The whole time I was thinking it better be worth it! ", "stars": "4.0"}, {"date": "2014-06-15", "text": "The chicken fried steak was GOOD, but it was the messiest thing I've eaten in awhile.  Talk about a chunk of meat that my teeth just weren't sharp enough for.  Argh.", "stars": "4.0"}, {"date": "2014-05-28", "text": "4505 Meats seems to be known for their cheeseburger, but unfortunately they didn't have it on the day that I was at the Ferry Building Farmer's Market. I settled on the pulled pork sandwich, which was packed with very flavorful and tender pulled pork, but was an overall average sandwich. The bun itself was buttery and had a good crunch on it, providing a good balance to the fall-apart meat and the crunchy slaw inside. I liked the addition of the pickles inside to add an extra brightness to the otherwise heavy, bold-flavored sandwich. The sandwich is definitely on the expensive side, weighing in at $11 for a decent size sandwich that will probably be snack-sized for big eaters.", "stars": "3.0"}, {"date": "2014-05-19", "text": "If you find yourself at the farmer's market Saturday afternoon and are craving a little something, something to hold you over.  Keep your eyes peeled for 4505 meats (Not for vegans).  They offer very tempting bags of chicherrons (They will be mine. Next time they will be mine). I went for the classic cheeseburger. 1/3 pound patty with a slice of cheddar, lettuce, tomato and mayo. I chose to \"level up\" with one farm fresh egg (over easy). With a dollop of dijon mustard and ketchup on the side, my first bite couldn't have sold me faster.  The meat was tender and juicy, the yolk from the egg slowly integrated with each and every layer of the burger. Rich, juicy, well seasoned, and beautifully cooked. This burger met my expectations. However, it's slightly overpriced, and not worth making a trip down there due to the tremendously annoying hoard of people aimlessly wandering around.", "stars": "3.0"}, {"date": "2014-05-16", "text": "My go to Saturday morning breakfast spot...nothing bad on the menu but my favorite is the burger...eat it as they serve it (nothing else is needed).  If more than water is required, their iced tea is simple and legitimate...finally, the staff is polite and friendly...I'll be there tomorrow.  JA", "stars": "5.0"}, {"date": "2014-05-01", "text": "Kinda sad and disappointed. I came here for lunch and was soooooo ready for their juicy cheeseburger w/ an egg but no go. Apparently, they didn't have the burger today (only Saturdays...?), only BBQ.", "stars": "3.0"}, {"date": "2014-04-27", "text": "I've been eating their food since 2011 and I'm noticing a downward slide. The meat on the burger isn't the same even though the sauce is still good. A few months ago I had one of the worst briskets here. Maybe there are too many butcher/burger/bbq places opening up in the city and everything is becoming stale but I use to enjoy this place. Now its getting pricey for something less memorable. I hope the tide turns for them and everything goes up again. And what's up with the tax? It's a farmers market just include it in the price or something easy. No one wants random change in their pocket.", "stars": "2.0"}, {"date": "2014-04-24", "text": "Got a brisket sandwich just before closing; not super cheap at $12, but pretty good and quick. Perfect portion size; filling but reasonable enough for me to get back on the bike and across town without regrets.", "stars": "4.0"}, {"date": "2014-04-05", "text": "Okay, I'm just to go and say, oh my goodness. I've had a fair share of burgers before, but I couldn't imagine eating the best cheeseburger at a farmers market.", "stars": "5.0"}, {"date": "2014-03-27", "text": "Just finished a great brisket sandwich.  It looked small-ish from a distance, but it is loaded with meat.  In fact, the ratio of bread, meat, and coleslaw is pretty much perfect.  I will definitely be back to try the other sandwiches.  ", "stars": "5.0"}, {"date": "2014-03-12", "text": "One small bag of chicharrones for $3.50 is outrageous.  They taste like normal pork rinds with not enough flavoring.", "stars": "3.0"}, {"date": "2014-03-01", "text": "Yummy fried Mac and cheese ! The hot dog is delicious ! 2 x more hot dog then bread ! The burger is next on my list", "stars": "5.0"}, {"date": "2014-03-01", "text": "Tried the 4505 Bacon stuffed dog Zilla style, although I'm not a fan of kimchi, it was very, very good.  Would definitely have again.", "stars": "4.0"}, {"date": "2014-02-16", "text": "Simplicity and quality. period.", "stars": "5.0"}, {"date": "2014-02-08", "text": "Although I am blinded by my infatuation with the Porchetta Sandwich at Roli Roti ", "stars": "4.0"}, {"date": "2014-01-27", "text": "the burger: it was not nearly as awesome as i thought it would be... just average.", "stars": "4.0"}, {"date": "2014-01-20", "text": "It is more the hypes of food stands  and the small selection on farmers market.  The food was okay but not as great as all the rating out there.  I had the Lamb hotdog, please don't get that.  The taste of lamb is pretty authentic but the price for a hotdog is too much, I will need like 3 to get satisfied.  The chicharron were pretty good, but really a small bag is to share, except if you can take that much fat in.  It is really a guilty sensation each those chicharrones almost sinful for your own health.", "stars": "3.0"}, {"date": "2014-01-19", "text": "Best damn cheeseburger ever? Not even close.", "stars": "3.0"}, {"date": "2014-01-18", "text": "I've been to this food stand SO many times now that I can't count. Farmers markets, Outside Lands... no matter where they stand, I'm a regular.", "stars": "5.0"}, {"date": "2014-01-09", "text": "Showed up on a Thursday and apparently they're doing a BBQ menu. Naturally, I got cheeseburger withdrawal and could barely stammer out my order, \"Ch-Ch-Ch-chicken s-s-s-andwich, please.\" I said, scratching myself and trying to fight the burger-delirium tremens. ", "stars": "5.0"}], "average_rating": "4.0", "latest_date": "20140806", "name": "4505 Meats", "address": "1 Ferry Building", "latitude": 37.795322, "latest_score": "100", "num_of_inspections": "2", "ave_score": "100.0", "longitude": -122.39302}
{"reviews": [{"date": "2014-11-22", "text": "One of the best restaurants in the city . Peter and his team are first rate .", "stars": "5.0"}, {"date": "2014-11-22", "text": "Oh la la Ladies and Gents... Get pretty and dine on pretty things.  I am so lucky my husband decided to celebrate our 1 year wedding anniversary here.  We honeymooned in Paris so this was quite fitting for the taste and senses of a year ago...  ", "stars": "5.0"}, {"date": "2014-11-17", "text": "We came here for a Team dinner and it was really good.", "stars": "5.0"}, {"date": "2014-11-09", "text": "With so many top restaurants in SF, I haven't been to Boulevard in years.  My memories of it were:  very good food; service not bad but not stellar either.  My current review will say that the food is still very good, and our table staff service was also very good and sincerely personable.  Physical ambience lovely.", "stars": "4.0"}, {"date": "2014-11-08", "text": "Had dinner here with my boyfriend and his family last night, and the food was exceptional!", "stars": "4.0"}, {"date": "2014-11-07", "text": "Came here for work lunch (cellar room!) and had a great meal. ", "stars": "5.0"}, {"date": "2014-11-05", "text": "Had a celebratory work lunch here. Exceptional food and service. Intimate, old-school feel. I had the salmon and it was fantastic. Our team several desserts and they were all bomb. PS Had a bite of someone else's burger and it was divine!", "stars": "5.0"}, {"date": "2014-11-04", "text": "i've been to Boulevard many times and they never disappoint...", "stars": "5.0"}, {"date": "2014-11-04", "text": "I ate here on a Friday night with some girl friends and had a great time. It was filled with diners and seems like a great date night or family dinner venue.", "stars": "4.0"}, {"date": "2014-11-04", "text": "My mother and I came here for dinner. It was highly recommended by friends who have excellent taste. We had an excellent experience. The ambiance was stylish. At the right table towards the rear of the restaurant, if you're lucky to be seated there, you will enjoy views of the bridge and the bay.  We were promptly seated on time for our 6 pm reservation. ", "stars": "5.0"}, {"date": "2014-11-03", "text": "Got this recommendation from a local SF foodie, and he was right on target. Food was delicious, service was fantastic, beverages were tasty and prices were fair. Convenient location, and not too loud even though restaurant was full.", "stars": "5.0"}, {"date": "2014-10-29", "text": "Beautiful restaurant, and great view of the ferry building.", "stars": "4.0"}, {"date": "2014-10-27", "text": "Husband took several business partners for dinner. Everything was very good, Problem...he ordered a very large steak (porterhouse or something) he was only able to eat a quarter of it and asked that it be boxed. Is that such a no no in this fancy restaurant? Well lo and behold when he got home he went to give our labrador a treat, unfortunately all the meat had been cut off the bone and he was sent home with just a bone. Pathetic.", "stars": "1.0"}, {"date": "2014-10-27", "text": "Boulevard continues to be our goto place for a romantic dinner or where we take family members for a special dinner.  Their service is top notch and is unsurpassable as seen when the servers continually, without being annoying, asked us if we needed anything and even went so far as sticking something under our table leg when from afar they noticed that out table was a bit wobbly.  The food is memorable, savory, and the portions are appropriate.  The crab cakes were to die for and were the best we ever had, as they were cooked to perfection, made from quality meat (not just a bunch of claw meat or breading) and our main meals were beyond delicious.  As my husband and I work so hard we occasionally need a special night out and Boulevard continues to be the restaurant we visit for special occasions or when we feel we need to treat ourselves to the best food and service.", "stars": "5.0"}, {"date": "2014-10-25", "text": "Came here to grab dinner with a few friends. Located in Embarcadero, it definitely fits into the neighborhood with its upscale ambiance. Food and service were both mostly solid, with only a few hiccups. ", "stars": "3.0"}, {"date": "2014-10-23", "text": "I think this restaurant just gets a lot of attention becasue of its location but it's nothing special given the myriad of exceptional restaurants in the city. I ordered their \"seasonal chicken salad\" for lunch and it was hands down the worst lunch salad I have ever had in a restaurant. No flavor, no thought went into it, no richness or complexity. Just a bunch of random ingredients that don't make sense together thrown on a plate.....second time eating here and I don't think I'll be back.", "stars": "1.0"}, {"date": "2014-10-17", "text": "3 of us had dinner and each one of us raved. Great appetizers (lobster ravioli, ahi tuna tartar, artichoke salad) followed by great mains, finishing with awesome deserts.  Superb service. Yahtzee!", "stars": "5.0"}, {"date": "2014-10-15", "text": "Though this has been on my list for years... we wound up here rather spontaneously, as their other restaurant, Prospect, was closed. We walked in without a reservation and the very friendly front of the house sent us to the bar and had us seated within 20 minutes or so.", "stars": "5.0"}, {"date": "2014-10-14", "text": "Since its beginning Boulevard has stuck with its original concept and it works!", "stars": "5.0"}, {"date": "2014-10-14", "text": "Overall its good, not outstanding or innovative. The steak was sub-par in quality. I was surprised it has a Michelin star. I probably should have ordered the pork chop, that looked good. The ambiance is excellent. Service impeccable.", "stars": "4.0"}, {"date": "2014-10-13", "text": "Went here for my birthday dinner and exceptional food and service. The price tag was higher than comparable places in nyc but having tried other places in sf - it's on par with price. Notable wine list and knowledgeable servers with pairings.", "stars": "4.0"}, {"date": "2014-10-12", "text": "I had dinner here last week with 2 other colleagues.  The restaurant has a warm ambiance and the food is good but not exceptional.  The service was professional.  I will definitely return for a business dinner, but probably won't for any special occasion or if I'm looking for an exceptional dining experience.", "stars": "4.0"}, {"date": "2014-10-09", "text": "I was a little skeptical because just because a restaurant is popular doesn't  always means it measures up where it matters - the food.", "stars": "5.0"}, {"date": "2014-10-08", "text": "Big disappointment... Not going back for sure! I actually didn't even finish my food it was so bad. My husband got the salmon and it was also really bad! To top it off our server was bizarre, totally inappropriate with his comments. So much hype for nothing.", "stars": "2.0"}, {"date": "2014-10-08", "text": "Maybe I'm getting too old, or have been to too many great meals.  As lovely as this restaurant is, it did not show me anything new, and I found this disappointing.  Dined here for the first time last night, a birthday celebration.  Everything we ordered was fine, but nothing particularly impressed or dazzled us, which, for the price, we rather expected.  That's my first (limp) complaint.  My second complaint is more serious.  It reeked.  They have a very serious oven venting problem (or so said the very competent waiter when I asked, and who on his own initiative removed the cost of our desserts from the bill due to the 'atmosphere').  All of a sudden we would get an overwhelming stench of something like sterno, which would pass in 5 minutes.  Then another blast of something more carbon-like (like the smell of animal fat soaked briquets?) from the oven.  It seriously detracted from enjoyment of our meal and MANAGEMENT SHOULD SOLVE THIS PROBLEM.  ", "stars": "3.0"}, {"date": "2014-10-08", "text": "The whole experience here was fantastic.  We got there super early for a 9pm res so we sat at the bar and had a couple drinks (the bees knees - whoa! and some good pinot).  We were seated near the back of the restaurant with a nice view of the lighted bay bridge.  Service was excellent the whole time - we didn't feel bothered, but never waited for anything we needed.  Now I can't remember what we had (squab, I think, and maybe lamb) and apps... whatever it was, it was delicious, all of it.  We'll definitely be back here!", "stars": "5.0"}, {"date": "2014-10-07", "text": "Just had lunch here today while taking care some business in the Embarcadero. I was welcomed with warmth from everyone the moment I stepped into the door to being seated. Unfortunately, things went downhill from there. ", "stars": "3.0"}, {"date": "2014-10-06", "text": "We had a reservation for 6:30, arrived at 6:25 - we were seated as soon as we walking in the door. The tables for two are a little small - but the ambiance is really nice. Great food, great location. Valet was easy and quick.", "stars": "5.0"}, {"date": "2014-10-04", "text": "Great service. 8:15 reservation. Place was packed, got seated immediately, at a table with a view of the Bay Bridge light show. Excellent service. Two salads ordered, heirloom tomato and Avocado/Hearts of Palm and Truffle... Both great. The four of us ordered quail, pork chop, lamb t-bone and sole. Every entree was full of amazing flavors, we sampled from each other! We brought one bottle of wine and purchased one bottle, so no corkage on the one we brought. Will definitely return. Highly recommend!", "stars": "5.0"}, {"date": "2014-10-03", "text": "Came here for my birthday dinner! ", "stars": "4.0"}, {"date": "2014-10-01", "text": "We were 15 minutes late to our dinner reservation but we didn't have a problem at all, even though it was packed. Had an ahi tuna dish as an appetizer and it was delicious. Tried the berkshire pork and it equally as tasty. Portions are (arguably) small but I thought they were just right. The food is very high quality, as it should be for the price. Service was very professional. Well done, Boulevard, well done.", "stars": "5.0"}, {"date": "2014-09-30", "text": "I gave this place 2 stars for the wine, as the food and place was average at best. We had the swordfish, and pork, but both meals were boring, unimaginative, and lacking accompaniments to make them stand out.  The place is loud, and crowded, when the waiter asked me how the meal was, and I explained the above, he advised that due to being so busy, they have to make the meals with Subtle  tastes.  Very disappointed in this place after reading the reviews on here.", "stars": "2.0"}, {"date": "2014-09-30", "text": "I went to Boulevard with some friends and we had a wonderful time. We started off with a special pasta dish to share with white truffles, which was absolutely fabulous. I recommend not sharing it, and getting it as your starter. For main dishes I would highly recommend the Kurabuta Pork or the Filet of beef. Both were excellent dishes. We passed on the dessert and went with a cheese plate. The cheese plate is good, but not great. Nobody beats Garyo Danko for cheeses. The restaurant was packed like always, even 5 years ago during the recession. The service was pretty good, and I recommend getting the table in the back of the restaurant so you can enjoy the views of the Bay Bridge both for dinner and lunch. Overall, a great place to come enjoy a fine meal with friends or on date night. A little tweaks here and there and this place will be 5 stars on my list. Boulevard isn't going anywhere for years to come during good times and even the bad times of the economy. This place is here to stay and great location as well.", "stars": "4.0"}, {"date": "2014-09-29", "text": "Good service, good food.", "stars": "4.0"}, {"date": "2014-09-29", "text": "Wonderful experience at the Boulevard. My boyfriend and I were visiting San Francisco and wanted to try a place that fit our foodie needs/wants. The presentation of the food was spot on and the service complimented the experience perfectly. Our waitress was very knowledgable about the food including origin, how it was prepared and how she would suggest we remake the dishes at our own home. Very happy with the experience and my boyfriend and I look forward to visiting again with our friends.", "stars": "5.0"}, {"date": "2014-09-27", "text": "Our go-to place in San Francisco. Love the food and decor. I miss their orange creme brulee though. Hope they bring it back soon.", "stars": "4.0"}, {"date": "2014-09-24", "text": "Everything on the menu looked wonderful. I had the pork chop which was amazing. The best jewel of the night was the Moscow Mule. Perfection!! I have it a four for the price and wait.", "stars": "4.0"}, {"date": "2014-09-22", "text": "Awesome French restaurant. We went there by chance and we were actually not expecting a Michelin-star! The quil was so delicately cooked. It's great in the look, the smell, and the taste~ Great service and also icecream :)", "stars": "5.0"}, {"date": "2014-09-21", "text": "It was good, not spectacular.  We had a similar meal at Insalata's later on in the week, and it was equally as good (saying this because the items we ordered were very similar).  I really do wish I could give it more starts, but it was just A-OK as yelp says 3 stars indicates.", "stars": "3.0"}, {"date": "2014-09-20", "text": "Wonderful destination restaurant. We decided to come here for dinner tonight despite not having a rsvp. We were able to snatch one of the tables in the bar area. Service is efficient, friendly, and knowledgeable of the wine list. Excellent food and reasonable price. We had 1 starter, 2 entrees, 2 wines for a total of $144 before tips. I do hate that they charge the SF health fee. ", "stars": "4.0"}], "average_rating": "4.0", "latest_date": "20140626", "name": "Boulevard", "address": "1 Mission St", "latitude": 37.79332, "latest_score": "96", "num_of_inspections": "3", "ave_score": "96.6666666667", "longitude": -122.392761}
